[{"SessionId":"1d419392-76d0-44e3-904c-a5bec3cfc551","SessionTitle":"Microservice design patterns for line of business applications","SessionAbstract":"So you broke up your big, unmaintainable monolithic system into microservices. Good for you. Each piece is now easy to understand and maintain. Except things didn\u0027t get simpler. You\u0027ve got lots of dependencies between your services to implement your business processes. You\u0027re having to modify many services to change your processes and the complexity is exploding. This isn\u0027t any better, if you can\u0027t improve things you\u0027re going back to the old way of doing things.\n\nThis talk discusses how you can use just three simple architectural patterns to design and implement microservice systems that can isolate the complexity of changes and support managing the evolution of business logic and processes over time. As a bonus it includes other buzzwords like event sourcing and CQRS at no extra charge. Process managers also deal with the distributed non-transactional nature of the system.","RecommendedAudience":"Some basic knowledge of DDD and CQRS would be helpful.","PresenterName":"Colin Scott and Zulhafiz Akbar","PresenterEmail":null,"PresenterTwitterAlias":"AbstractCode","PresenterWebsite":"","PresenterBio":"Colin Scott is an alleged carbon-based biped who has been doing .NET since 2003. He will likely never forgive Microsoft for MSBuild and has been known to go into ReSharper withdrawal.\n\nWherever the code is darkest there you will find Zulhafiz Akbar. Unshakeable and unflappable,  Fiz gets the job done regardless of the odds. He enjoys long walks on the beach, complex SQL queries and regretting telling Colin to write his bio."},{"SessionId":"2e79c7bf-0a42-4fa2-b9c2-96963648377f","SessionTitle":"Microtesting: How We Set Fire To The Testing Pyramid While Ensuring Confidence","SessionAbstract":"As seen at Yow! West.\n\nDo you want to write less tests for the same amount of confidence?\n\nDo you want to print out the testing pyramid on a dot matrix printer, take it outside and set fire to it?\n\nHow confident are you that you can survive the refactoring apocalypse without breaking your tests?\n\nAs consultants, my colleagues and I get to see how testing is performed across many different organisations and have a chance to experiment with different testing strategies across multiple projects. Through this experience, we have developed a pragmatic process for setting an initial testing strategy that is as simple as possible and iterating on that strategy over time to evolve it based on how it performs. We have also settled on a style of testing that has proved to be very effective at reducing testing effort while maintaining (or even improving) confidence from our tests.\n\nThis talk will focus on some of our learnings and we will cover the different types of testing and how they interact, breaking apart the usual practice of testing all applications in the same way, the mysterious relationship between speed and confidence, how we were able to throw away the testing pyramid (and watch it burnnnnn!!!) and a number of techniques that have worked well for us when testing our applications.","RecommendedAudience":"None","PresenterName":"Rob Moore and Matt Davies","PresenterEmail":null,"PresenterTwitterAlias":"robdmoore","PresenterWebsite":"http://robdmoore.id.au","PresenterBio":"Robert is a Principal Consultant with Readify and specialises in leading and mentoring software teams to deliver business value. He has had a range of experience working with organisations to introduce and/or improve the use of Agile, Lean and continuous delivery approaches and this is an area he is particularly passionate about. While Robert has experience in a range of technologies, he specialises in C#, ASP.NET and Windows Azure.\n\nMatt is a Lead Consultant for Readify specialising in Windows Azure and mobile application development.He sets out to introduce targeted new Agile software delivery practices and modern technology options with the goal of always leaving teams he works with operating more effectively than when he first met them. He speaks at the Perth Cloud user group, Windows Azure workshops and hackathon events in Perth."},{"SessionId":"3a6d6a60-74b5-4dea-93b5-985f91f340f3","SessionTitle":"Patterns for Internet-of-Things Projects in Azure","SessionAbstract":"In this session Mitch will discuss the maturing patterns that are being adopted by development teams building IoT solutions in the cloud. We\u0027ll apply these patterns to the Azure platform and look at the specific technologies in the platform and how they can be applied as building blocks to implement the discussed patterns.","RecommendedAudience":"Familiarity with IoT as a concept, and Azure as a platform.","PresenterName":"Mitch Denny","PresenterEmail":null,"PresenterTwitterAlias":"mitchdenny","PresenterWebsite":"http://mitchdenny.com","PresenterBio":"Mitch Denny is the Chief Technology Officer of Readify, a Visual Studio ALM MVP, and ASP Insider. He spends his time looking at emerging technology trends, working with customers develop their technology strategy and coming up with practical approaches to solving problems using cloud, mobile and embedded technologies."},{"SessionId":"3cce7ebd-b91e-40e5-aa86-4dc9830a7e84","SessionTitle":"What makes React different?","SessionAbstract":"There has been a heap of talk about web frameworks recently, React is one which is particularly interesting.\n\nReact takes a very different approach to how you build and compose your JavaScript applications. After this session you will have a good understanding what React is, how it is different to other frameworks like Angular and Ember and the reasons you might want to give it a go.","RecommendedAudience":"Should know JavaScript","PresenterName":"Jake Ginnivan","PresenterEmail":null,"PresenterTwitterAlias":"JakeGinnivan","PresenterWebsite":"http://jake.ginnivan.net","PresenterBio":"Jake is a Microsoft MVP in .NET developing JavaScript and .NET applications day to day for Readify. He maintains a number of open source projects such as Shouldly, GitVersion and others. He recently moved back to Perth after working in London in the financial services space for two years."},{"SessionId":"44d4e2ec-108c-4142-a7ce-4bf75480f30d","SessionTitle":".NET actor programming with Akka.NET","SessionAbstract":"Akka.NET is an open-source .NET port of the Akka actor programming toolkit and runtime from the JVM. The toolkit provides an abstraction layer to help programmers deal with the current challenges and optimise development for modern hardware and infrastructure: multi-core architecture, cloud infrastructure, and distributed computing.\n\nWe will talk about various actor programming concepts and fundamentals, and learn how to apply Akka.NET toolkit in your applications to make it scalable and fault-tolerant.","RecommendedAudience":"Junior to Intermediate programmer. No pre-req knowledge required.","PresenterName":"Herdy Handoko","PresenterEmail":null,"PresenterTwitterAlias":"_hhandoko","PresenterWebsite":"","PresenterBio":"A polyglot developer / programmer working for one of the mining company here in Perth.\n\nStarted from web design (highschool\u0027s alma mater website in 1998), slowly graduating into `programming` to Classic ASP, and now mostly working in .NET (SharePoint, MVC, ServiceStack), Scala / Java, with a little bit of Python, Objective-C, and Elixir (for fun)."},{"SessionId":"4ccb057b-c3d1-472a-8ad9-83b9f1e17c14","SessionTitle":"Why Pointers Still Matter","SessionAbstract":"As computers continue to become faster, and programming languages more powerful and abstract, the question arises: is there still a need for the humble pointer? I will demonstrate why the answer is \u0027yes\u0027, and show some practical scenarios in C# where some basic pointer skills pave the way for simpler and more efficient applications on today\u0027s desktops and devices.","RecommendedAudience":"All","PresenterName":"Joe Albahari","PresenterEmail":null,"PresenterTwitterAlias":"linqpad","PresenterWebsite":"","PresenterBio":"Joe Albahari is the inventor of LINQPad and author of C# 5.0 in a Nutshell."},{"SessionId":"599fc187-2f4a-49d0-8531-2634467fb8f0","SessionTitle":"What happens when...?","SessionAbstract":"Starting from an innocent question - what happens when you type google.com into a browser? - we\u0027ll explore how complex our field of computing has become. It\u0027ll be a ride through acronym soup and rarely seen debugging experiences, as we peel back layer upon layer of magic. You\u0027ll leave this talk with a reinvigorated passion for complexity and problem solving. Or, you\u0027ll want to rage quit and take up horticulture.","RecommendedAudience":"All","PresenterName":"Tatham Oddie","PresenterEmail":null,"PresenterTwitterAlias":"tathamoddie","PresenterWebsite":"","PresenterBio":"Based in Melbourne, Tatham is the Chief Information Officer at Readify. This has him balancing technology, process, and commercial decisions to deliver outcomes for both Readify, and their customers. Still a keen developer at heart, he has received the Microsoft MVP award seven times. He regularly shares his experiences at conferences and events throughout Australia, New Zealand, North America and Europe."},{"SessionId":"5a2911ec-207d-45ca-a6fa-11892bb92bbd","SessionTitle":"Cordova and Xamarin - Mobile dev from the trenches","SessionAbstract":"We\u0027ve all heard of the wonders of cross platform mobile development before. Xamarin and Cordova are well known in our industry now, but are they really silver bullets? With so many ways to develop mobile apps out there, how do we make a choice and how to we avoid the common pitfalls of each of those?\n\nIn this talk, Greg James from Readify will run through Xamarin and Cordova to demystify the above statements and show you the ropes. There\u0027ll be sharing some war stories, tools, tips and tricks to get the most out of (mostly) painfree mobile development with Xamarin and Cordova.","RecommendedAudience":"Some experience with mobile application development","PresenterName":"Greg James","PresenterEmail":null,"PresenterTwitterAlias":"GregAlexJames","PresenterWebsite":"","PresenterBio":"Greg is a Senior Consultant for Readify specialising in Mobile (Xamarin, Windows Phone, Cordova) and Windows Application Development (C#, XAML, ASP.NET Web API). He loves nothing more than tinkering with mobile devices and taking those learnings to provide the most cost efficient solutions. Greg has worked in the financial, telecommunication and mining industries since he started as a Software Engineer in 2007."},{"SessionId":"674f1340-94a4-43b2-b8ec-0a93f7b80060","SessionTitle":"Containers, Docker and... Cats!","SessionAbstract":"Containers, docker, microservices... I am pretty sure I have heard those words before, they have been pretty hardcore lately...\n\nSo, this thing, \"containers\" what is all about? is it like a big box where you put things? would that run in Windows? is just another virtual machine? why is so \"awesome\"? can I fit a cat in a shoe box?\n\nI will try to explain all those questions in a simple language, about what are containers, what are they right now the sweet potato and why I should care and why in a few months you will probably be using them.\n\nVote for this and I promise a lot of cat pictures as well...","RecommendedAudience":"100-400","PresenterName":"Cristian Prieto","PresenterEmail":null,"PresenterTwitterAlias":"cprieto","PresenterWebsite":"http://cprieto.com","PresenterBio":"Cristian is a giant chicken whom sometimes pretend to be a human programmer. He loves coding (a lot), how computers and things work and cats..."},{"SessionId":"799ef773-81c2-4c58-b942-64a1152cbf2e","SessionTitle":"How Git Corrupts The Mind","SessionAbstract":"Lots of companies are adopting Git, and for many developers they\u0027re quite content to just use the basics of Git when they transition away from whatever version control system they used previously. But why stop there?\n\nIn this talk I want to walk through some of the concepts of Git and distributed version control, talk about what\u0027 happening under the hood, and show how working with Git can changes your workflow radically - for the better.","RecommendedAudience":"Some familiarity with version control would be excellent","PresenterName":"Brendan Forster","PresenterEmail":null,"PresenterTwitterAlias":"shiftkey","PresenterWebsite":"","PresenterBio":"Brendan is an Engineer at GitHub and works on assorted open source projects."},{"SessionId":"d07b5bd2-32f9-4e61-8232-5bcf3572d111","SessionTitle":"Octopus Deploy or How to Stop Deploying like an Idiot","SessionAbstract":"Ever had your site go down because Jim accidentally copied over the web.config? Ever broken out into a cold sweat because you forgot the where clause was in a production update script? Well stop deploying like an idiot.\n\nDeploying applications has traditionally been one of the most dangerous parts of software development. It\u0027s often very hands-on, relying on the right people doing the right thing at the right time, and is therefore extremely prone to failure.\n\nIn this presentation, I\u0027ll briefly look at why developers should automate their deployment process as soon as possible. I\u0027ll looks at some of the ways teams try to manage their deployments and reduce the danger. Finally, I\u0027ll show you why a tool like Octopus Deploy is the best way to do it. We\u0027ll look at some real-world Octopus implementations, including very complex environments, in-depth testing, and automated rollbacks.","RecommendedAudience":"Any developer","PresenterName":"Damian Brady","PresenterEmail":null,"PresenterTwitterAlias":"damovisa","PresenterWebsite":"http://www.damianbrady.com.au","PresenterBio":"I\u0027m a Microsoft MVP in Application Lifecycle Management and I work as a Solution Architect for Octopus Deploy. I\u0027m also a co-author of Professional Team Foundation Server 2013 from Wiley. I run the Brisbane .Net User Group, and the annual DeveloperDeveloperDeveloper Brisbane conference.\n\nI spend a lot of time training teams on how to improve their software, be it through improving their agile process, devops, or code quality. I regularly speak at conferences, User Groups, and other events, but most of the time you’ll find me working on Octopus Deploy, or helping teams get the most out of their devops strategies.\n\nI write software mainly for the web using Nancy or ASP.NET MVC combined with healthy amounts of JavaScript and Angular, and I usually cut code in Visual Studio 2013 and manage my work with Visual Studio Online or GitHub. However, I\u0027ve gained experience in many other languages and environments."},{"SessionId":"fc7289f8-575d-4d65-992b-51d1ee218334","SessionTitle":"Let Azure Machine Learning APIs teach your app to be smarter.","SessionAbstract":"Most of us saw the how-old.net demo from build this year. What if you want to include some of those smarts into your app?\n\nWe\u0027ll have a look at some of the Azure Machine Learning APIs to see how easy it is to give your app an education.","RecommendedAudience":".Net developer, mid level","PresenterName":"Doug Paice","PresenterEmail":null,"PresenterTwitterAlias":"baralong","PresenterWebsite":"","PresenterBio":"I\u0027ve been working in the software development industry for 25 years (starting on green screens and mainframes). Most recently as a Solution Architect and Technical Lead with Diversus.\n\nI\u0027m mostly focused on Microsoft Technologies and have a particular interest in finding interesting ways to build things out of the Lego blocks we  have at our disposal."}]