[{"SessionId":"20f26760-d2bf-400a-8a73-807502c11291","SessionTitle":"Pair Programming - Experience from the trenches","SessionAbstract":"What are the some of the problems software delivery teams experience? Is there a way of working that will allow software delivery teams to overcome these problems?\n\nSoftware delivery teams face challenges with productivity, code quality, team health, and knowledge sharing and code ownership. There are many ways of working that allow a team to address these issues. The challenge is to find the right way of working that helps to address these issues quickly.\n\nIn this talk, you will learn how Pair Programming is one such way of working that will help address these challenges. You will learn the mechanics of Pair Programming, things to watch out for and tips to successfully set up a pair programming session.\n\nLearning outcomes:\nWhat is pair programming?\nWhat are the benefits of pair programming?\nWhat things to look out for?\nWhy some people find it hard?\nWhen not to pair program?","RecommendedAudience":"This talk is an introduction to pair programming with some advice to intermediate users of pair programming.","PresenterName":"Sameer Chauhan","PresenterEmail":null,"PresenterTwitterAlias":"@sameer_chauhan","PresenterWebsite":"","PresenterBio":"Sameer is a software developer who focuses on delivering customer focussed outcomes through technology. He continues to experiment with design thinking and customer-centric design to improve the value to the customer.\n\nHe has worked across many industries and with many different teams’ and continuously draws insight from the ways of working to improve the flow of value."},{"SessionId":"286930b8-ab3d-4a33-9b3a-ba863032aa1d","SessionTitle":"Congrats, You are a Solution Architect, now what?","SessionAbstract":"Ok so you have been made a tech lead/architect and you have been tasked to build an elegant, performant, scalable, cloud application. What would you do? There are a lot of decisions that you are going to make and you are accountable for these. Things like what cloud provider to choose? What data storage you choose? What compute unit to choose? How to secure it? How to protect it? How to communicate the design well to the devs to implement it? What messaging components to use? How to verify you design against functional and non functional specs? And the list goes on and on\nI have been lucky enough to be involved and leading some of the great projects in my career and I was there from day 1 ( in some cases). I have had to make many of these decisions. Some of them were good and others turned out not too great.\nIn this talk, I will share with you my experience and the approach that I have developed. My process works for most project and it creates a good recipe for rinse and repeat. The talk would be full of demos to demo the impact of these decision.","RecommendedAudience":"This talks is aimed at developers, architects, and tech leads who like to look at the big picture and consider the tough choices ahead","PresenterName":"Has AlTaiar","PresenterEmail":null,"PresenterTwitterAlias":"@hasaltaiar","PresenterWebsite":"https://www.hasaltaiar.com.au","PresenterBio":"A full-time principal consultant, a part-time researcher, a blogger, and a cyclist. Have been tinkering with mobile and web for over a decade. Enjoy working with Xamarin, and Azure."},{"SessionId":"2be131c5-155d-4207-8e24-910bf50a6894","SessionTitle":"Modern TypeScript is amazing!","SessionAbstract":"You think you know TypeScript? Unless you have been looking at it recently you likely have missed some of the amazing features shipped in 2.0, 2.1 and 2.2. Some of these language features exist in very few other languages and open up so many doors.\n\nIn this talk we will introduce you to TypeScript and run through a number of the latest language features including spread/rest operators which many Babel users love, Mapped Types, Generics and cover practical examples where he has been using these features to improve the code he is writing day to day.","RecommendedAudience":"Introduction to TypeScript talk with a focus on how it helps, rather than just what it does.","PresenterName":"Jake Ginnivan","PresenterEmail":null,"PresenterTwitterAlias":"@jakeginnivan","PresenterWebsite":"","PresenterBio":"Jake is currently working with Seven West Media on their new digital platform, before this he spent many years as a consultant for Readify with a brief 2 year sabbatical to London working in the finance industry for Adaptive Consulting. He is an active maintainer or creator of quite a few open source including GitVersion, DbUp, Shouldly, BDDfy and contributes to many more."},{"SessionId":"2c375902-fe42-4009-96ca-1206ab4447a9","SessionTitle":"Serverless architecture for small-scale projects","SessionAbstract":"\"Serverless\" is one of the latest trending buzzwords in the industry.  Much of the hype about this architectural style is about the scalability and ease of infrastructure management for large-scale projects, with a lot of users, and big volumes of data.\n\nHowever, the serverless architecture is not solely concerned with the large-scale, and can be extremely cost-effective for small-scale projects.\n\nThis session explores some ways of using serverless architecture, tools and services for smaller projects with a limited budget, based on professional experience and successes utilising these technologies in various business domains, including citizen science, academic research, and government.","RecommendedAudience":"This is an introductory to intermediate level talk.  A basic understanding of what is meant by \"serverless\" and how this is implemented by service providers will be beneficial for audience members.  Various AWS services (Lambda, API Gateway, DynamoDB, S3, etc) will be discussed directly, however other providers (Google, Microsoft) present a similar enough range of services that knowledge will transfer easily.","PresenterName":"Ben New","PresenterEmail":null,"PresenterTwitterAlias":"@leftclickben","PresenterWebsite":"https://www.gaiaresources.com.au/","PresenterBio":"Ben has worked with a diverse range of technology, in a wide range of business domains, from military to finance to advertising, over a 20-year professional career.  Currently a technical lead and head of R\u0026D at Gaia Resources, an environmental technology consultancy.  Ben is a proponent of open source software, and has been a JavaScript fanboy since before it was cool."},{"SessionId":"36bc7011-11a7-4c33-bb84-e0e49da88b39","SessionTitle":"Web Accessibility: Responsibilities, Laws and Policies, Australian Requirements","SessionAbstract":"Learn the approach followed in Australia related to the requirements for digital accessibility.  It certainly won\u0027t be boring or technical, but will provide you with the knowledge you need to address the requirements and persuade those within your organisation that this is not just a \u0027good thing to do\u0027, but the \u0027smart thing to do\u0027, the \u0027right thing to do\u0027 and is \u0027good for business\u0027 at the same time!\n\nIn this session, we will explore the Australian context of web accessibility including the new Australian Standard for procurement of ICT products (AS 301549), the W3C\u0027s new release of Web Accessibility Laws and Policies which show the Australian setting, the procedures followed by the Australian Human Rights Commission in administering the Disability Discrimination Act and other related materials.\n\nCome along and get informed!","RecommendedAudience":"appropriate for all levels","PresenterName":"Dr Vivienne Conway","PresenterEmail":null,"PresenterTwitterAlias":"","PresenterWebsite":"http://www.webkeyit.com","PresenterBio":"Dr Vivienne Conway is the Director of Web Key IT Pty Ltd which she founded in 2011.  Web Key IT has a vision to enable website access for persons with disabilities.  Web Key IT assists organisations with web-based programs and information to meet the needs of people with disabilities as well as to understand their legal requirements for website accessibility and develop the tools needed to meet the internationally-recognised website standards.\n\nAs well as being involved in research and conference presentations, Vivienne leads her team of accessibility professionals to provide consulting, audit and accreditation and training in all aspects of digital accessibility.  She is an ardent advocate for the effective recognition of the needs of people with disabilities and their inclusion in our digital society.  Vivienne has been involved with ACS since joining as an undergraduate and has presented at numerous ACS events.\n\nVivienne completed her PhD in IT (website accessibility) at Edith Cowan University and is a Certified Professional (Snr) member and WA Branch Executive member of the Australian Computer Society. She is active in W3C and the working groups, where Web Key IT is a member.  This year she was the co-General Chair of the Web for All Conference (W4A 2017) held in Perth."},{"SessionId":"3a75a53c-3cb1-41dc-ba5a-b74efc8546ac","SessionTitle":"Quantum Encryption - New Advances in Data Security","SessionAbstract":"There are exciting advances being made in the way we securely transport data. At present there is a technological space race between the super power nations on who can crack this first. The implications are massive!\n\nIn this talk I will detail  how this new approach works, why data security is so important and what it could mean to us all in the future.\n\nWe will also have a fun looking back on existing data security methods of times gone by.","RecommendedAudience":"All welcome. Would suit anyone with an interest of privacy, spying and world security.","PresenterName":"Will Webster","PresenterEmail":null,"PresenterTwitterAlias":"@willwebst","PresenterWebsite":"http://burlistic.github.io","PresenterBio":"Technical leader and web development expert with hands-on skills. Founder of the Perth Code Dojo, co-organiser of Agile Perth.\n\nExperienced at enabling modern software development practises in large organisations. Improving processes and encouraging innovation. Setting up automation, Agile training, certified Scrum Master and Kanban practitioner.\n\nTeam player with great product development, effective negotiation and stakeholder management skills. Business focus with strong client relationship and financial awareness.\n\nWeb stack development specialist. Versatile and enjoys coding a multitude of languages and platforms. Automation addict; Testing, Continuous Integration, deployment and other related DevOps practices."},{"SessionId":"44f64f98-53ef-4344-93f6-9d852f845ed2","SessionTitle":"Five key challenges for software quality tomorrow","SessionAbstract":"With the advances in our industry we can build software faster and operate it cheaper while serving more platforms and solving more problems than ever before. This is not without it\u0027s complications though, this new landscape requires teams to change their approach to reduce risk and ensure quality in their software.\n\nIn this presentation, Gojko will look at five important software quality challenges facing delivery teams due to these shifting roles. He will also present some emerging ideas that will help address these challenges and inspire you to rethink your approach to testing.","RecommendedAudience":"Everyone","PresenterName":"Gojko Adzic","PresenterEmail":null,"PresenterTwitterAlias":"@gojkoadzic","PresenterWebsite":"https://gojko.net/","PresenterBio":"Gojko Adzic is a strategic software delivery consultant who works with ambitious teams to align software delivery with business goals, and improve the quality of their software products and processes. Gojko specialises in are agile and lean quality improvement, in particular impact mapping, agile testing, specification by example and behaviour driven development.\n\nGojko’s book Specification by Example won the Jolt Award for the best book of 2012. Gojko won the 2016 European Software Testing Outstanding Achievement Award. In 2011, he was voted by peers as the most influential agile testing professional, and his blog won the UK Agile Award for the best online publication in 2010.\n\nGojko is a frequent keynote speaker at leading software development conferences, and one of the authors of MindMup and Claudia.js."},{"SessionId":"6742a7ad-0e47-4704-86d0-22b038afe2c4","SessionTitle":"Mobile App Test Automation: Let\u0027s look into the future","SessionAbstract":"In the present world, mobile applications are growing exponentially. A large number of businesses \u0026 enterprises, ranging from large corporations to start-ups, are increasing their spending on mobile app development to create an awesome customer experience \u0026 an emotional attachment with their end users. The increasing popularity of the mobile applications has surfaced a few very imminent issues, mostly related to determining the quality of these mobile applications.\n\nMobile applications typically work with limited resources; hence the resource usage needs to be monitored continuously to avoid performance issues. More conventional functional testing approaches, like user interface testing, usability testing \u0026 integration testing with underlying application programming interface, need to be employed in addition to compatibility testing and performance testing for exhaustively testing a mobile application across multiple platforms (iOS, Android, Windows). On top of that, confidential data like phone contacts, banking and other personal information, global GPS position could be disclosed by vulnerable applications \u0026 unreliable mobile networks, so sensitive applications require validating exchanged data to avoid security issues over various available mobile networks. Other factors we need to consider while testing would be user experience, testing the interruptions caused by incoming calls or text messages while the application under test is on foreground and battery. \n\n\nThis presentation outlines the mobile test automation challenges from the perspectives of user interface design, product function, performance \u0026 security. Furthermore, we also focus on some of the gaps that exist in present day mobile app automation testing \u0026 propose some future work to enhance the existing testing frameworks.","RecommendedAudience":"This presentation will be targeted at anyone who is an user of any mobile application.","PresenterName":"Subrata Bhattacharjee","PresenterEmail":null,"PresenterTwitterAlias":"","PresenterWebsite":"","PresenterBio":"Subrata is an Engineering Team Leader, presently working with Bankwest,  with broad experience in leading cross-functional Agile engineering teams. Actively involved in the local Testing \u0026 DevOps communities, have presented multiple times at Iqnite, TestWest \u0026 Yow West conferences across multiple cities in Australia. Also presented in international software conferences like Accelarate in Vienna, Austria.\n\nHe\u0027s passionate about designing, developing \u0026 testing native, web \u0026 hybrid mobile applications for iOS \u0026 Android platforms. He has experience in leading software testing teams \u0026 creating test automation frameworks for cross-platform \u0026 cross-browser testing using a wide range of technologies. \n\nHe has worked with some of the major investment \u0026 retail banks like Royal Bank of Scotland, Bankwest across various geographies including UK, Australia \u0026 India."},{"SessionId":"684b7f57-fd87-4963-a7a3-b77715287347","SessionTitle":"Death By Good Intentions","SessionAbstract":"After spending time in over 25 different workplaces, I\u0027ve seen examples of high-performing teams, and those that are totally stifled by their environment.\n\nI\u0027ve spent time trying to distill what made each of those places tick and extracted common problems. For each of those problems, I use examples to explain their effect on the team, and the solutions I\u0027ve seen work to mitigate them. We\u0027ll cover topics like security theatre, tech strategy and team setup amongst others. \n\nBy the end of it you\u0027ll come away with a few tools to take back to your organisation to help your teams get stuff done and hopefully make some customers happy along the way.","RecommendedAudience":"Suitable for most ages.","PresenterName":"Nathan Jones","PresenterEmail":null,"PresenterTwitterAlias":"@the_nathanjones","PresenterWebsite":"","PresenterBio":"I\u0027ve been working in software development for over 10 years, the last 7 years as a consultant for ThoughtWorks, and am currently the Market Tech Principal for Perth. \n\nI\u0027ve performed most of the roles on a software development team, but nowadays you\u0027ll usually find me in the role of a Tech Lead or providing advice on techncial strategy."},{"SessionId":"6916c81d-28e4-4471-8368-26f4c80aea29","SessionTitle":"GraphQL - A query language to empower your API consumers","SessionAbstract":"The API economy is here, fueling disruption across many established industries. REST, as specified in Roy Fielding’s seminal dissertation, has become the architectural pattern of choice for APIs and when applied correctly allows for clients and servers to evolve in a loosely coupled manner. There are areas however where REST can deliver less than ideal client experiences. Often many HTTP requests are required to render a single view.\n\nWhile this may be a minor concern for a web app running on a WAN with low latency and high bandwidth, it can yield poor client experiences for mobile clients in particular. GraphQL is Facebook’s response to this challenge and it is quickly proving itself as an exciting alternative to RESTful APIs for a wide range of contexts. GraphQL is a query language that provides a clean and simple syntax for consumers to interrogate your APIs. These queries are strongly typed, hierarchical and enable clients to retrieve only the data they need.\n\nIn this session, we will take a hands-on look at GraphQL and see how it can be used to build APIs that are a joy to use.","RecommendedAudience":"This talk will be pitched at an introductory level. Whilst knowledge of building web APIs and HTTP would be beneficial they should not be considered  prerequisites.","PresenterName":"Rob Crowley","PresenterEmail":null,"PresenterTwitterAlias":"@robdcrowley","PresenterWebsite":"","PresenterBio":"Rob is a software consultant, developer and team lead with a passion for delivering systems that perform at scale. Rob has over 15 years of experience building distributed systems on the web stack and has read more RFCs than he cares to admit. As the Technical Lead for APIs at Bankwest, Rob works with delivery teams on transforming the bank’s technology landscape to realise its digital strategy."},{"SessionId":"74ad268f-38ad-4dc5-814a-f7a0437360d6","SessionTitle":"How feedback helped me get over myself","SessionAbstract":"What happens when your view and opinions of yourself don’t match everyone else’s around you? People can start to think you’re conceited and pretentious. Feedback can help bridge that gap.\n \nThis is the story of a developer that wasn\u0027t used to being told the not-so-great things about them, and their journey in struggling and eventually embracing feedback (and getting over themselves).\n \nThis talk will take a look at feedback culture with a tongue-in-cheek storytelling and lessons learned approach. \n \nBy seeing the journey of someone who started with no exposure to feedback culture, you will learn what feedback can do for you and the impact it can have on your personal growth. You will also learn how to empower those around you with tips on how to give effective feedback.\n \nKey takeaways:\nWhat is feedback\nWhat is a feedback culture\nWhat are the benefits of feedback\nHow to ask for feedback\nHow to give effective feedback","RecommendedAudience":"No pre-requisite knowledge required, it is an introductory talk","PresenterName":"Jasmine Quek","PresenterEmail":null,"PresenterTwitterAlias":"@jas_quek","PresenterWebsite":"","PresenterBio":"Jasmine is a software developer consultant working for ThoughtWorks. She\u0027s a local Perthian and likes cool front-endy things but happy working on all sorts of code (but likes devops less).\n\nJasmine is passionate about encouraging a workplace culture safe for diversity, having fun at work,  and delicious food."},{"SessionId":"7e482ec2-9657-40ea-a3dd-ba0c53f824c3","SessionTitle":"A (gentle) introduction to Neural Networks","SessionAbstract":"As developers we’ve all heard a lot about Machine Learning, Big Data and I\u0027m certain that most if not all of us would love to get involved in this exciting field. However the pressures of juggling the demands of a full-time career in software can make getting started in such a broad field feel a little daunting. I’d like to change that!\n\nWhat I’d like to cover in this talk are the fundamental concepts of Linear Regression. Next we’ll look at Gradient Descent, a simple, yet powerful technique we can use to find the ‘best fitting’ parameter values for our model. Next, a we’ll take a quick look at Logistic Regression and discuss the central tenant of any Neural Network, the Perceptron. With this understanding, we can jump into building and initializing a small Neural Network. The last piece of the puzzle is  how we train a Neural Network. We’ll discuss Back Propagation, an algorithm that retrospectively updates the weightings between nodes our Neural Network. With that knowledge in hand, we’ll have everything required to throw some unseen data at our  Neural Network and watch the magic unfold.  Last but not least, is a look at how Neural Networks can be used in practice. Whilst the solve many real life problems, from enabling an autonomous vehicle to navigate a busy highway to detecting fraudulent banking patterns, for the purposes of this talk I’ll be demonstrating how a neural network can be used to solve the age old problem of handwriting recognition.\n\nBy attending this talk attendees will walk away with a clear understanding of the deceptively simple techniques used to build the majority of the learning algorithms used in industry (Linear Regression, Gradient Descent). My goal is to motivate attendees to seek ongoing education in this space, and at the conclusion of the talk references will be provided to material that I’ve found invaluable in my personal journey, including a brief review of Coursera’s  Machine Learning MOOC.","RecommendedAudience":"I believe that as Software Engineers and Computer Scientists, we have a unique sets of skills that enable us to build complex, multi-faceted software solutions. Having said that, most of us don’t have a background in Mathematics and I believe that it is this gap (or gulf!) that often makes fields like Machine Learning and Artificial Intelligence appear off limits.","PresenterName":"Rami Ruhayel","PresenterEmail":null,"PresenterTwitterAlias":"","PresenterWebsite":"","PresenterBio":"Human computer scientist with an interest in mathematics, linguistics and web development. Holds a double degree with first class honors in computer science and information technology systems, and is currently completing  a part 1 qualification with the institute of actuaries."},{"SessionId":"83ce0668-9d21-41bb-802a-50a810abfa9a","SessionTitle":"Attraction and retention strategies for Women in tech","SessionAbstract":"Women make up 31% of the Australian IT workforce with only 14% in leadership roles; this is a statistic we can and should improve. \n\nResearch shows that organisations with equal gender in leadership roles perform better and employee satisfaction of both men and women are higher. Most organisations have goals and are trying to improve these statistics but its proving to be a big challenge.\n\nSo get your notepad ready because I will give you some practical tips on how and where to attract more females to your organisation along with the insider tools to help retain and develop them.\n\nYou don’t need to be a manager to make a difference and help create a successful gender balanced organisation.","RecommendedAudience":"Anyone interested in helping create a gender diverse workplace and industry.","PresenterName":"Donna Edwards","PresenterEmail":null,"PresenterTwitterAlias":"","PresenterWebsite":"http://www.linkedin.com/in/edwardsdonna","PresenterBio":"Donna has been building amazing teams for over seventeen years. Most recently she has grown Ignia from a 25 person locally-focussed development shop to one of the largest and most respected consultancies in Perth, now expanding globally through their acquisition by Insight.\n\nShe regularly speaks about employee engagement, talent management, recruitment and business growth, and is the Co-Chair of WAITTA Game Changers, a member of 100 Women and President of Central Communicator Toastmasters club."},{"SessionId":"8c7a2d53-bc00-436f-9150-3f7db76b3610","SessionTitle":"Web, Wellness and Getting Sh*t Done","SessionAbstract":"In an industry that doesn\u0027t sleep and where there\u0027s probably something new to learn or try released by the time you’ve finished reading this paragraph, it’s no wonder we get overwhelmed and sometimes lose focus.\n\nThere\u0027s a lot to be said about pressing pause, resetting and unfolding that roadmap often to see if you’re still going in the right direction. \n\nBeing a brilliant dev is great, but being a brilliant dev who understands balance, how to manage time, how to focus and be aware of when to put the foot down on the pedal or that you might need to pull over for a nap… well, this person becomes a super dev.","RecommendedAudience":"No pre-requisite knowledge required","PresenterName":"Patima Tantiprasut","PresenterEmail":null,"PresenterTwitterAlias":"@the_patima","PresenterWebsite":"","PresenterBio":"Patima is a Creative Director with a background in both code and design, with over 15 years’ experience in the web. By day, she leads the team over at Bam Creative, a Perth-based award-winning digital agency. Her jam is to bring people together to achieve beautiful and meaningful things. \n\nShe specialises in experience design, brand development and quality assurance for digital projects. In her spare time, she’s also a co-founder of @team6Q, co-organiser for @MixinConf, founder and host of @LocalhostAU, previously an Australian Web Industry Association (AWIA) board member, a newbie speaker, writer, not-so-newbie gin drinker and dog lover."},{"SessionId":"c09518f6-58a0-4cbc-84ba-87b862d6f514","SessionTitle":"Stop Mocking – start testing.","SessionAbstract":"How much value do your automated tests really provide? I will demonstrate common and regular pitfalls in automated testing. Namely, that of mis-defining what a ‘unit’ is and disregard for integration tests. Among other things I will also demonstrate how stale tests – be they failing or passing are a problem as well.\n\nTesting is a good thing, testing a lot for the sake of it is NOT. Stop mocking and actually start testing to provide the highest amount of value in your application with the least amount of code.","RecommendedAudience":"Devs","PresenterName":"Raphael Haddad","PresenterEmail":null,"PresenterTwitterAlias":"@RaphHaddadAus","PresenterWebsite":"http://www.raph.ws/","PresenterBio":"Raph is an energetic, easily amusable, developer consultant with a focus on simplicity. He strongly believes in incremental delivery, and wishes to purge the industry of premature optimisation, guessing and complexity!"},{"SessionId":"d06d45de-de42-44da-83eb-ea1d9d14b6cc","SessionTitle":"The Campsite Rule - Leaving the Tech Industry Better than We Found It","SessionAbstract":"Improving the codebase for the next developer is a great goal, but what about making the industry better for the next generation? In this talk, Kris will debunk some of the damaging myths and ideas we’re all guilty of perpetuating, the ones that lead to stress and burnout. Fortunately there is an antidote - becoming a mentor! You’ll learn how you can change your own behaviour and thinking, be more supportive to those just starting out, and feel more engaged and inspired in your work - all with minimal effort. We all have a responsibility to make things just a little bit better for those who come after us.","RecommendedAudience":"Everyone","PresenterName":"Kris Howard","PresenterEmail":null,"PresenterTwitterAlias":"@web_goddess","PresenterWebsite":"http://www.krishoward.org/","PresenterBio":"Kris Howard has been building websites in one form or another for over twenty years. She\u0027s been a developer, a business analyst, and a manager; and most recently wrangled engineers at Canva, one of Australia\u0027s fastest growing startups. She now heads up Developer Relations for YOW! Conferences, meeting and working with developers around the country. She\u0027s spoken at meetups and events across Australia and Asia, including TEDx Melbourne. Her Instagram account is pretty much all selfies and food."},{"SessionId":"d1bb10e3-c2af-4db7-93fc-dcbfe03d9b7b","SessionTitle":"Flying Solo - lifehack your way to a pants-optional workplace","SessionAbstract":"Many developers harbour the dream of throwing off the shackles of corporate serfdom and experiencing the glorious freedom of self-employment. So is the grass really greener on the other side?\n\nAs a developer who took the plunge a few years ago, I can offer some honest feedback and practical advice on things like:\n* what to consider when assessing whether self-employment is right for you.\n* the different software development business models, the pros \u0026 cons of each.\n* setting up a business/company - which structure is best.\n* knowing when to quit your job.\n* pricing yourself correctly.\n* sales \u0026 marketing - critical activity or soul destroying waste of effort?\n* why on earth can’t people just pay you on time.\n* what to say to friends and relatives who think you don’t do anything all day.\n* generally everything else that I know now, that I wish I knew then.\n\nAttendees will either walk out with a solid plan of attack for starting their own business, or thankful they have a job and don’t have to deal with that rubbish.","RecommendedAudience":"Relevant to anyone who’s considered striking out on their own.","PresenterName":"Sam Ritchie","PresenterEmail":null,"PresenterTwitterAlias":"@FakeSamRitchie","PresenterWebsite":"http://codesplice.com.au","PresenterBio":"Sam is a mobile \u0026 cloud developer who likes writing Swift and F#. He runs the software consulting company codesplice, organises the Perth iOS Developers meetup group, and occasionally speaks at conferences. For the record, he usually wears pants."},{"SessionId":"de3f62ca-fd85-43a0-865c-fd17102588bb","SessionTitle":"What a real sprint looks like","SessionAbstract":"A lot of us have worked in \"agile\" teams that if we\u0027re being honest are about as agile as a rock, and a surprisingly high number of people in software really don\u0027t know what a successful agile process looks like.\n\nI want to show you a real world sprint from a mature Scrum team, exploring how they actually deliver, and how the Scrum meetings work in practice and why they\u0027re important.\n\nIf you\u0027ve never seen a mature Scrum team in action before you\u0027ll get to see what a high performing one looks like, and if you\u0027re already agile you can compare and hopefully pick up some tips or share your own.","RecommendedAudience":"This talk is for anyone who is interested in seeing how a mature Scrum team can work.","PresenterName":"Ian Hughes","PresenterEmail":null,"PresenterTwitterAlias":"@ian_hughes","PresenterWebsite":"","PresenterBio":"Ian Hughes likes code, science, travel, beer, and footy. He\u0027s a Principal Consultant with Readify during the week, primarily in Agile, DevOps/CD and Mobile; he mostly does other stuff on the weekend... mostly."},{"SessionId":"f14fe883-7570-4459-b71e-4f6165ff99b0","SessionTitle":"Speaker Panel","SessionAbstract":"Join selected speakers during the afternoon tea break for an extended Q\u0026A panel session. Ask more detailed questions on their topic, or ask the questions you didn’t get a chance to after their presentation.\n\nFormat will be an open Q\u0026A session, so come with your coffee, grab a microphone and join in!","RecommendedAudience":"All welcome!","PresenterName":"Donna Edwards, Nathan Jones, Rami Ruhayel, Patima Tantiprasut","PresenterEmail":null,"PresenterTwitterAlias":"@the_nathanjones,@the_patima","PresenterWebsite":"","PresenterBio":"Donna Edwards\n--\nDonna has been building amazing teams for over seventeen years. Most recently she has grown Ignia from a 25 person locally-focussed development shop to one of the largest and most respected consultancies in Perth, now expanding globally through their acquisition by Insight.\n\nShe regularly speaks about employee engagement, talent management, recruitment and business growth, and is the Co-Chair of WAITTA Game Changers, a member of 100 Women and President of Central Communicator Toastmasters club.\n\n\nNathan Jones\n--\nNathan has been working in software development for over 10 years, the last 7 years as a consultant for ThoughtWorks. He is currently the Market Tech Principal for Perth. \n\nHe has performed most of the roles on a software development team, but nowadays you\u0027ll usually find him in the role of a Tech Lead or providing advice on technical strategy.\n\nRami Ruhayel\n--\nRami is a human computer scientist with an interest in mathematics, linguistics and web development. Holds a double degree with first class honors in computer science and information technology systems, and is currently completing  a part 1 qualification with the institute of actuaries.\n\n\nPatima Tantiprasut\n--\nPatima is a Creative Director with a background in both code and design, with over 15 years’ experience in the web. By day, she leads the team over at Bam Creative, a Perth-based award-winning digital agency. Her jam is to bring people together to achieve beautiful and meaningful things. \n\nShe specialises in experience design, brand development and quality assurance for digital projects. In her spare time, she’s also a co-founder of @team6Q, co-organiser for @MixinConf, founder and host of @LocalhostAU, previously an Australian Web Industry Association (AWIA) board member, a newbie speaker, writer, not-so-newbie gin drinker and dog lover."},{"SessionId":"ff7521d0-7513-404a-a9e8-d506e6547e5d","SessionTitle":"Atari 2600 for a developer in 2017","SessionAbstract":"Atari, it was out in 1977, it gave to many of us our first glance of home video games. How did they work? I mean, I am pretty sure there was not C# in 1977!\nVote and come to my talk to listen to a short story of hardcore development (no, seriously, hardcore), inspiring engineering tales and a moment to go full geek into the overlooked marriage between software and hardware.\nI promise no assembler knowledge required... Well, mostly.","RecommendedAudience":"Geekiness level over 9000","PresenterName":"Cristian Prieto","PresenterEmail":null,"PresenterTwitterAlias":"@cprieto","PresenterWebsite":"http://cprieto.com","PresenterBio":"Cristian is a software developer, he loves software, history and cats (in no particular order). He is a huge open source fan and sometimes he can be found installing Windows 95 in a virtual machine for no particular reason."}]