[{"Id":"9ac2e311-7559-436c-8ee8-6f0aed17a431","Title":"10 UX principles you should know about","Abstract":"User Experience Design is closely connected to human psychology. From research to usability testing, human behaviour is at the centre of what we do. We can only build better products when we pay special attention to things like the user's memory, attention and perception. \r\n\r\nLet's take a dive into the \"Laws of UX\", and reflect on how they can help us craft better experiences.\r\n\r\nAn example? According to Hick's law, \"The time it takes to make a decision increases with the number and complexity of choices.\"","Format":"20 mins","Level":"No experience necessary","Tags":["Design and UX","Frontend dev","Web"],"Presenters":[{"Id":"2d606884-ac12-4224-91d0-a6e425f0841c","Name":"Phil Delalande","Tagline":"Lead UX Designer at Readify","Bio":"I'm an Experience Designer with a background across tech, education and design. I've worked in a number of startups delivering user-centric products, predominantly in healthcare.","ProfilePhotoUrl":"https://sessionize.com/image?f=699884cd81d4af79043490e34497e358,200,200,True,False,50-5736-401a-92ba-15762e59e4b9.2b4a6191-984c-42b6-a56c-2edf68148616.jpg","TwitterHandle":"phildelalande","WebsiteUrl":"https://www.linkedin.com/in/phildelalande/"}]},{"Id":"fd830fb5-8e7b-4527-bc79-f7ddf693232f","Title":"Advanced Testing Techniques: Tips from the trenches","Abstract":"Software testing is undeniably hard. We have worked with many teams over many years through consulting with a wide range of companies. Through this perspective we have had a unique opportunity to see the entire continuum of testing successes and failures. This has ranged from highly effective teams that can confidently deploy changes multiple times a day through to teams struggling to deploy twice in a year.\r\n\r\nOne of the key things we've observed in the teams that are highly effective is a pragmmatic approach to software testing and a realisation of how to effectively and judiciously use test automation to accelerate delivery speed and confidence. On the other end of the spectrum, we ourselves have written (and seen) everything from heavily mocked, time-consuming implementation tests that impede refactoring, 24 hour long brittle automated UI test suites and 4 week long regression testing cycles (as well as everything in between).\r\n\r\nWe both have a strong passion for code quality, automated testing, DevOps and getting valuable features out quickly and safely to users. This passion, combined with our extensive experience has led to us uncovering and adopting a number of testing techniques and mindsets which we, and teams we have worked with, have found highly effective at reducing overhead of testing while improving confidence and utility.\r\n\r\nIn this presentation, we will blow apart the traditional testing mindset/methodologies and contrast them with the battle-tested pragmatic approaches we've been using. We will also leave attendees with some new, highly effective testing techniques for their toolbelt that are easy to get started with.\r\n\r\n","Format":"45 mins","Level":"Mostly intermediate","Tags":["Testing","DevOps"],"Presenters":[{"Id":"482e8c11-340a-44fd-8cef-56eeab34a8b4","Name":"Graeme Foster","Tagline":"Principal Engineer @ Bankwest","Bio":"Graeme’s IT passion was first stirred with a 1Kb ZX81 in 1983 at 8 years old. He’s now had over 20 years of commercial experience using .Net, Javascript, Java, and VB, as well as writing Lisp neural networks at Uni and having Objective-C ios apps in the AppStore.\r\n\r\nHe is currently working at Bankwest helping teams to safely go faster.\r\n","ProfilePhotoUrl":"https://sessionize.com/image?f=13e6a74c358606598dd17f89cd5d9a59,200,200,True,False,9ea6c235-678c-4c64-8215-b3334fbbb2d7.jpg","TwitterHandle":null,"WebsiteUrl":null},{"Id":"99574c10-1a69-481e-a338-8372b1750949","Name":"Rob Moore","Tagline":"Principal Consultant for Readify","Bio":"Rob is a Principal Consultant with Readify and specialises in leading teams towards the delivery of business value using Agile and Lean values and principles and by adopting DevOps and Continuous Delivery practices.\r\n\r\nRob has a proven track record of successfully delivering software projects with a particular focus on accelerated business value delivery, measurement and realisation and he has also been a proponent for and leader towards positive cultural change and gradual continuous improvement across a number of organisations, teams and projects.","ProfilePhotoUrl":"https://sessionize.com/image?f=61b77e53d51cf0383a7f1e1efd04883e,200,200,True,False,c5-ddd4-4ed4-b919-dd0eb429bfa9.7591062c-d02c-4c84-90ae-5132a84e2bea.jpg","TwitterHandle":"robdmoore","WebsiteUrl":"https://robdmoore.id.au/"}]},{"Id":"264b7669-8127-41a3-9f6b-87511a879cf1","Title":"Better mental health in the workplace","Abstract":"Mark Leopold, beyondblue’s Head of Workplace Engagement, will discuss the importance of improving workplace mental health. Attendees will learn about best practice approaches in workplace mental health and strategies for adopting an integrated approach to workplace mental health including: minimising risk, supporting those with mental health conditions and promoting the positives within the workplace. This session will include introduction to resources to help people and organisations take effective action to improve workplace mental health. Mark is a passionate advocate for workplace mental health. Informed by his personal experience with depression and experience across numerous industries, Mark discusses the topic in a relatable manner; helping people and organisations to take action. ","Format":"45 mins","Level":"No experience necessary","Tags":[],"Presenters":[{"Id":"bf95ea05-6881-43cf-99fa-af201c7e859c","Name":"Mark Leopold","Tagline":"Head of Workplace Engagement ","Bio":"Mark Leopold is Head of Workplace Engagement for beyondblue, a national organisation that provides information and support to help everyone in Australia achieve their best possible mental health.\r\n\r\nPrior to beyondblue, Mark gained 25 years of operational and management experience across a diverse array of industries. He joined beyondblue because he understands the benefit that professional men and women can gain by working in mentally heathy workplaces; as a member of the beyondblue team he helps to stimulate more conversations within Australian organisations.\r\n\r\nHe’s a passionate advocate of Heads Up – an initiative of beyondblue and the Mentally Healthy Workplace Alliance (headsup.org.au). Heads Up is all about giving individuals and businesses the tools to drive change and create more mentally healthy workplaces.\r\n\r\nMark keeps mentally and physically healthy by working, running, lifting, strumming, golfing and laughing. His wife Sara and two daughters, Annalise and Sienna, are a great support to each other. \r\n","ProfilePhotoUrl":"https://sessionize.com/image?f=7ce19280d7332bd0ce14a414c625d53f,200,200,True,False,4c-cce8-4a3c-80c3-7af0b66bdf04.2a874793-aa46-4b0b-825b-a68780d081b0.jpg","TwitterHandle":null,"WebsiteUrl":null}]},{"Id":"0d35dfb9-c75f-48a4-bd73-18fe07f6a04b","Title":"Blockchain: More than cryptocurrency!","Abstract":"Blockchain is more than just cryptocurrency; it's a complex assembly of technologies that offer practical solutions to some very challenging problems.\r\n\r\nIn this session {the speaker} will share their adventure learning about blockchain, how it works and how they developed their own. From its defining principles, its distributed nature and the magic that is consensus. I'll also explore some of the potential real world applications that aren’t just another altcoin!\r\n\r\nBy the end of the session, you will have an understanding of blockchain outside of the context of cryptocurrency and be equipped with the knowledge you need to embark on your own blockchain adventure! ","Format":"20 mins","Level":"Mostly intermediate","Tags":["Backend dev","Architecture"],"Presenters":[{"Id":"a728c224-8f1a-4a3b-b932-49922af99c53","Name":"Brandon Lewis","Tagline":"IT professional and meme king extraordinaire!","Bio":"Brandon is an IT veteran with extensive experience in data and systems integration. Having worked in a number of industries he's helped to solve a broad range of integration challenges with innovative solutions crafted through the creative use of technologies both old and new. He currently leads a team at one of WA's largest mutuals","ProfilePhotoUrl":"https://sessionize.com/image?f=c606c7e7adfacc6664c99d5920941d3f,200,200,True,False,e2-f994-4a51-a33c-74dff96a4ed1.17373182-02e1-4aff-94b0-865229ee8160.JPG","TwitterHandle":"slashrawr","WebsiteUrl":"https://www.linkedin.com/in/brandonmichaellewis/"}]},{"Id":"0f383402-2fee-4728-a6bf-fbe74ba2671e","Title":"Building Highly Engaged Teams","Abstract":"Hiring and retaining good people is hard but super critical. A high performing team delivers, has fun and kicks goals.\r\n\r\nOver the years I have become known for hiring and spotting good talent. I have had compliments from senior architects and leaders on the quality of people I choose for my teams.\r\n\r\nHiring is an art form and a challenging endeavour. Get it wrong and you will pay the price.\r\n\r\nSo how do you attract top talent and maintain top class engagement scores?","Format":"20 mins","Level":"Mostly intermediate","Tags":["Teams","Leadership","Soft skills"],"Presenters":[{"Id":"c7ae22bd-dc33-4b5a-8611-16774fee0060","Name":"Will Webster","Tagline":"Herder of catz","Bio":"Technical leader and web development expert with hands-on skills. Experienced at enabling modern software development practises in large organisations. Improving processes and encouraging innovation.","ProfilePhotoUrl":"https://sessionize.com/image?f=1be00a0a3b882354e5067be2f933cecb,200,200,True,False,0b499a5a-7857-4167-8270-04fc1d02fabb.jpg","TwitterHandle":null,"WebsiteUrl":null}]},{"Id":"dd4a2717-47ed-426f-a97d-5bb4f9c1fef3","Title":"Creating a ‘best place to work’ culture","Abstract":"Being a leader in a ‘best place to work’ has many advantages. It’s easier to attract the best talent, employees are engaged and more productive, employees collaborate and actively contribute to making your company better and more successful.  \r\n\r\nBut where do you start? How do you create this type of environment? In this talk I will take you through some practical advice on how to create and implement strategies to turn your organisation into a ‘best place’.  ","Format":"45 mins","Level":"No experience necessary","Tags":["Soft skills","Leadership"],"Presenters":[{"Id":"18918042-749f-4012-b5da-de1c721f4c63","Name":"Donna Edwards","Tagline":"State Delivery Manager @ Readify","Bio":"Donna has been building amazing teams for over seventeen years. Her passion is connecting people so that they can inspire and learn from each other and building great workplace cultures. These passions have resulted in a knack for successfully scaling businesses.\r\n\r\nAs the State Delivery Manager of Readify WA she has spent the last 6 months growing the team from 22 to 40 employees. Previously, she played major role in taking Ignia from a 25 person locally-focussed development shop to one of the largest and most respected consultancies in Perth, who have now expanded globally through their acquisition by Insight. \r\n\r\nDonna regularly speaks about business growth and culture development and is the Events Manager for Women in Technology WA (WiTWA), Organiser of NodeGirls Perth, Events Manager for Playup Perth, Committee member of ACS Women, Beacon foundation mentor and Tech Girls are Superheroes judge. ","ProfilePhotoUrl":"https://sessionize.com/image?f=72cf5f009e553d0eb9d9a3644440fc1d,200,200,True,False,28-da1d-4681-817c-6cc42bf9484e.e85def54-cb87-4fe8-a2b7-a909351f01ab.png","TwitterHandle":"Don_IsGood?s=09","WebsiteUrl":"https://www.linkedin.com/in/edwardsdonna/"}]},{"Id":"9a72d1fa-6563-4de2-bb3c-27d13d7e0d64","Title":"DDD from the trenches","Abstract":"You’ve probably heard about Domain Driven Design, heck you may have even read THE book on it, but like most of us you’ve probably wondered how to apply it in practice. Where do you begin? How do you win people over to this sometimes drastically different way of thinking and doing? In this short talk you’ll hear from both a UX Designer and Engineer on how they navigated the early stages of a project, the challenges encountered along the way and some of the techniques that were employed to overcome them. Finally, we’ll retrospect on the overall process of DDD and contrast the outcomes with those of other traditional approaches. Make sure you don’t miss this talk!","Format":"20 mins","Level":"No experience necessary","Tags":["Agile","Leadership","Teams","Design and UX","Soft skills","Architecture"],"Presenters":[{"Id":"0aeafde6-614e-447e-bf3d-823f71b016d5","Name":"Rami Ruhayel","Tagline":"I accept bribes. ","Bio":"I love mathematics, coffee, software and talking long walks off short piers.","ProfilePhotoUrl":"https://sessionize.com/image?f=8ef67d2ab45ba4f01d024e1941192891,200,200,True,False,654376da-c71c-44c7-b8c1-5780dba24daf.jpg","TwitterHandle":"ruhayel","WebsiteUrl":"https://medium.com/@ruhayel"},{"Id":"954c4d31-6e60-4c75-b730-caab6159d612","Name":"Valeria Spirovski","Tagline":null,"Bio":null,"ProfilePhotoUrl":"https://sessionize.com/image?f=365cf2305cbfd8011ddb22be881df0b0,200,200,True,False,be9c82e9-8a87-44d2-91f6-df4a76a80521.jpg","TwitterHandle":null,"WebsiteUrl":null}]},{"Id":"c0f29a8d-0c21-43d6-aeb1-c34054e6541f","Title":"Delightful Frontend Development: An Intro to Elm","Abstract":"\"undefined is not a function\" - Google Chrome, 2018\r\n\r\nLet's be honest, it's not a great user experience is it? To say JavaScript is a prickly learning experience is an understatement. There's all the little quirks inherit to JavaScript itself, combine that with a colourful cast of frameworks, libraries and patterns, and you've got a recipe for disaster.\r\n\r\nElm provides a refreshing alternative to JavaScript. Elm is a language built with an emphasis on being easy to use, building robust applications and great performance. Elm does this through polite and friendly error messages, no runtime exceptions and a virtual DOM similar to React.\r\n\r\nIn this session we'll cover a brief overview of Elm and some of the developer-focused features it provides. As well as a live demonstration of coding in Elm.","Format":"45 mins","Level":"No experience necessary","Tags":["Frontend dev","Web","Functional programming"],"Presenters":[{"Id":"a450c432-e108-48a7-b3ab-abb69d5dbdf0","Name":"Dylan Pindur","Tagline":"Penetration Tester","Bio":"Dylan was a plucky young software developer before he realised breaking things was easier than building them. He now works as a penetration tester for CommBank, but still has a passion for software development. Always on the lookout for new technologies, Dylan can usually be found working on something frontend or pestering friends and colleagues about functional programming.","ProfilePhotoUrl":"https://sessionize.com/image?f=0a091a7b1ac5e32cb51ff758bc6ca338,200,200,True,False,c2-ee27-42f8-9156-060d14828502.cb86b109-09ba-425f-a106-5f460f163d8a.jpeg","TwitterHandle":null,"WebsiteUrl":null}]},{"Id":"4f463f9b-bf28-446a-9558-c6ac59697cc9","Title":"Functional HTML","Abstract":"HTML, the foundation of the web! With so much time being spent on typed javascript, functional programming, unit tests, visual regression testing, tools, frameworks and a drive to write better more efficient code we often forget that the web starts with HTML.\r\n\r\nLet’s talk HTML and semantics and why choosing the right HTML elements will help you write more accessible, efficient and maintainable code not just in your HTML but your CSS and Javascript as well. \r\n\r\nMost importantly we’ll explore why HTML is so vital in improving your projects overall functionality for people and for bots. \r\n","Format":"45 mins","Level":"No experience necessary","Tags":["Web","Frontend dev"],"Presenters":[{"Id":"f5d4c6a5-c993-4de3-9647-c652dc19bf9f","Name":"Mandy Michael","Tagline":"Lover of CSS and Batman","Bio":"Mandy is a community organiser, speaker, and developer working as the Front End Development Manager at Seven West Media in Western Australia.  She is a co-organiser and Director of Mixin Conf (http://mixinconf.com/), and the founder and co-organiser of Fenders (http://www.fenders.co), a local meetup for front end developers providing events, mentoring and support to the Perth web community.\r\n\r\nMandy’s passion is CSS, HTML and JS and hopes to inspire that passion in others. She loves the supportive and collaborative nature of the web and strives to encourage this environment through the community groups she is a part of. Her aim is to create a community of web developers who can share, mentor, learn and grow together.\r\n","ProfilePhotoUrl":"https://sessionize.com/image?f=512d5f8b011293a62e9baed2c8965de6,200,200,True,False,85-89d8-4020-801c-5b9380c606a3.594064bc-b254-4e0f-862a-a5b541540299.jpg","TwitterHandle":"http://twitter.com/mandy_kerr","WebsiteUrl":null}]},{"Id":"ee60b006-8662-4d8c-8a60-4ee4ad2018f7","Title":"How to win friends and comply with the Notifiable Data Breaches scheme*","Abstract":"The \"Notifiable Data Breaches scheme\" amendment to the Australian Privacy Act kicked in in February 2018, to much confusion amongst Australian businesses. If you're interested in demystifying the \"legalese\" of the scheme to understand what actually counts as a data breach, who the laws apply to and what they require - this is the talk for you!\r\n*will not actually win you friends","Format":"20 mins","Level":"No experience necessary","Tags":["Leadership","Security"],"Presenters":[{"Id":"0b364a6a-5f92-4b17-917f-2c8f6bfc6e2c","Name":"Cairo Malet","Tagline":"Definitely not a lawyer","Bio":"Cairo is an Information Security consultant at Asterisk Information Security, specialising in governance, risk management and compliance. She spends most of her time drinking tea, writing security policies and reading legislation for kicks. She is definitely a lot of fun at parties.","ProfilePhotoUrl":"https://sessionize.com/image?f=a40a6baa3fa0c3c7def2f609a9efb1d8,200,200,True,False,1b-f988-42d9-97a2-6cde871f60b5.222d1be4-4ac0-412d-8d67-152e9c0bff81.jpg","TwitterHandle":"Caiwrote","WebsiteUrl":"https://www.linkedin.com/in/cairo-malet-137590b9/"}]},{"Id":"318d8f95-54e8-486b-8119-94bb91924f64","Title":"Looking for a pet project? Here is a list of humanity's biggest challenges.","Abstract":"It's your well earned time off, an evening or a weekend - yet you are at your keyboard, in the flow, working on your side project, devouring whatever skills and new tech your goal demands, and getting an endorphin kick from seeing results of your efforts along the way. It runs! It does something! And I created it!\r\n\r\nNot only it's the best feeling ever it also makes you better at your job and a more interesting person; people are drawn to driven, passionate people. But it's not easy to pick something that is really... really worth all that time and focus, is it? \r\n\r\nHave you started on a website for a local public speaking club and after few months of work felt.. underwhelmed? Or perhaps have you tried to dip your toe into a new technology, like machine learning, and raise your eyebrow at the number of tutorials on how to distinguish tomatoes from grapes or kittens from cars? Yet - we forget there are those nasty problems that we all face as humanity, like climate change, health or equal rights.\r\n\r\nThey do sound monstrous and abstract, but we did our research and split them into bite-size pet projects, actionable and inspiring.  We believe - we can all make this world a better place - by following our passion, leveraging technology and having fun!\r\n\r\nWe are two data analysts from Perth, and while every problem does resemble \"a machine learning nail\" to us,\r\nwe filled this call to action presentation with ideas ranging from educational visualization to apps and digital communities so everyone feels that there is something for them. \r\n\r\nWould you chip in?","Format":"45 mins","Level":"No experience necessary","Tags":["Web","Data and analytics","Leadership"],"Presenters":[{"Id":"24060020-34d7-4db5-8109-5e74fc49e83a","Name":"Rimma Shafikova","Tagline":"A hard working dreamer","Bio":"We both work as data scientists at Perth's most exciting social casino company. We come from different backgrounds: Diana has a rare combination of experience in senior roles in digital marketing and a solid education in data science; Rimma is a multidisciplinary analyst with a research background and a budding public speaker. ","ProfilePhotoUrl":"https://sessionize.com/image?f=1be921d2b52043762ab5d331b3a7cb5a,200,200,True,False,ee-4979-4c87-ba1d-5bf4d0769b42.cff99449-f94f-4105-a1a0-170d6e081425.jpg","TwitterHandle":null,"WebsiteUrl":null},{"Id":"8638c295-fce5-40f6-adb4-efde3d8d2a44","Name":"Diana Mozo","Tagline":"Data Scientist - Data Analyst","Bio":"Data Scientist based inPerth","ProfilePhotoUrl":"https://sessionize.com/image?f=15172a5a1f87c831c78dcb6b28adb4f7,200,200,True,False,19-fafc-4d92-af2a-6c74ec11ff47.09db078d-ac4a-4fcc-8fe0-fdc92eddd3c7.jpg","TwitterHandle":null,"WebsiteUrl":null}]},{"Id":"a45d6be4-668d-4c01-8522-34c43580baab","Title":"Machine Learning to Diagnose Childhood Brain Tumours","Abstract":"Brain tumours are currently the number one cause of cancer related death in children worldwide. The current method of identifying childhood brain tumours is problematic at best and useless at worse for remote and budget limiting healthcare locations. But perhaps machine learning holds the key to speed and cost allowing isolated areas like Perth to diagnosis these deadly diseases locally. I will be discussing how we have addressed this problem both from machine learning software development perspective and deployment approach.","Format":"20 mins","Level":"No experience necessary","Tags":["Data and analytics","Backend dev","Cloud","Machine Learning"],"Presenters":[{"Id":"c9aacc98-f53b-428f-a1bd-fd556c4a4f8a","Name":"Wes Wilson","Tagline":"Health Tech Developer & Cancer Researcher","Bio":"Wes is a cancer researcher, currently working to develop new treatment regimens for solid tumours, with a focus on novel approaches to immunotherapy and radiotherapy. He is also a software and hardware developer experienced in health and medical technology, having served as CTO of two medical technology companies in Canada, and CMO of an American health tech startup. His work in software development and engineering has earned him awards from Intel, Microsoft, MIT and Waterloo. He continues to work on machine learning algorithms to produce new tools for the future of medicine.","ProfilePhotoUrl":"https://sessionize.com/image?f=9e87b80d63f79506b802d2f37904a185,200,200,True,False,0e-4ef5-4a73-8040-ff4a4d3f35b5.1eccd42b-07a0-4a3c-8df5-5c22a7611458.jpg","TwitterHandle":"wesleywilson","WebsiteUrl":"https://www.linkedin.com/in/wesleyvwilson/"}]},{"Id":"a9c48983-c3c9-4ceb-b21b-6b1d116a6882","Title":"MicroServices UI Composition","Abstract":"Ever wondered how websites like Amazon were created? They rely on Microservices architecture to be loosely-coupled but what about the UI? How do we avoid a monolithic UI? Join me on this talk to learn about techniques for developing a UI for a Microservices backend.\r\n","Format":"45 mins","Level":"Mostly intermediate","Tags":["Backend dev","Frontend dev","Web","Architecture","Microservices"],"Presenters":[{"Id":"d302dfdd-9a37-4b2a-9ec9-de753a7cd28b","Name":"Hadi Eskandari","Tagline":"Solution Architect, Particular Software","Bio":"Hadi Eskandari is a polyglot programmer, open source contributor, speaker, and blogger. He implemented the first version of the Persian Calendar on .NET framework even before Microsoft did. He now innovates at Particular Software, the makers of NServiceBus. When not programming or helping other developers, he's either playing his Flamenco guitar or trying to capture the moment with his camera.","ProfilePhotoUrl":"https://sessionize.com/image?f=896fefb32353f46c06c500b9dbf22dec,200,200,True,False,1364d523-b173-4690-8d5d-907685f9a3fe.jpg","TwitterHandle":"http://twitter.com/hadi_es","WebsiteUrl":"http://www.seesharpsoftware.com.au"}]},{"Id":"2f2a3626-5ec3-4085-baca-941910c09467","Title":"Overcoming fear, anxiety and doubt as a developer","Abstract":"This talks about the common fears we encounter as developers and how to overcome them. This includes (and won't be limited to) impostor syndrome, contributing to open source, being a \"good developer\", speaking publicly, etc. If you have ever asked yourself: \"Was I good enough?\" or \"Did I do a good job?\", then this talk is for you! ","Format":"20 mins","Level":"No experience necessary","Tags":["Backend dev","Leadership","Soft skills"],"Presenters":[{"Id":"66b3c0ea-b5bb-4834-acc8-afb4638b4877","Name":"Eumir Gaspar","Tagline":"Developer at Rent.com.au and CTO/Co-founder of Beanbag Entertainment","Bio":"I'm a senior Ruby developer from the Philippines. I have been an active part of the Ruby community there - working on the Rubyconf PH website these past four years. I have since moved to Perth to work with Rent.com.au as a developer and the CTO and co-founder of Beanbag Entertainment. I have started as a frontend Rails developer back in 2009 and was hired and trained by my boss as a backend developer. Since then, I have interviewed, hired, and mentored almost all my colleagues in that company as a form of paying it forward. I still mentor people in my free time for some boot camp websites.","ProfilePhotoUrl":"https://sessionize.com/image?f=8b300b9659de488a7edc790a4a90b107,200,200,True,False,85-e89b-41eb-80e0-833878aff8c9.9faa7b9d-4fe3-456d-97f3-f2f8f3da8bef.jpg","TwitterHandle":"corrodedlotus","WebsiteUrl":"https://medium.com/@corrodedlotus"}]},{"Id":"77fea600-238f-4523-baf8-f51b5db5d666","Title":"Reverse Engineering is Good and also For Everyone","Abstract":"In the tech press, you have probably seen a story or two showcasing some kind of ridiculous hacking or technical feat. Maybe it's modifying a video game to have new features or characters, maybe it's rigging an ATM to play a jingle and spit out money like a jackpotting slot machine, maybe it's revealing every workstation/server CPU on Earth as hopelessly insecure in the space of an afternoon. For many, the reaction these stories evoke is roughly \"geez that's pretty rad, I'd love to try something like that but unfortunately I don't have the skill to pull it off\". \r\n\r\nSo how IS it possible? Did these people spend half their lives memorising an entire architecture before starting? Do you need some sort of gift to magically understand assembly language? Are modern chips so different and complex that there's no such thing anymore as a one-size-fits-most understanding? Is there no entry level approach to this at all?\r\n\r\nSpoiler: the answer to all of these questions is HECK NO. In this talk, we will cover basic reverse engineering applications and techniques, and how they can scale up to match almost any technical challenge you can name. Even when starting from scratch. These skills can prove useful for original research, fun personal projects, and even plain ordinary development! How sick is that?","Format":"45 mins","Level":"No experience necessary","Tags":["Security","Architecture"],"Presenters":[{"Id":"cfabbbd7-d349-4239-ac57-399032476850","Name":"Scott Percival","Tagline":"Gonzo developer","Bio":"Scott Percival is a Perth-based software developer who strongly believes in making tech more inclusive and accessible. He is the author of a Python framework to assist in rapid reverse engineering (Mr. Crowbar), and has contributed to a number of prominent open-source projects. On weekends he is an instructor with Perth Parkour.","ProfilePhotoUrl":"https://sessionize.com/image?f=b621f0d75b92a12c08ffe8512a9ec378,200,200,True,False,5a-edad-419c-95d4-f648a5958ee7.af9ffa54-0a93-4c4c-94f9-cbcafeddafbf.jpg","TwitterHandle":"moralrecordings","WebsiteUrl":"https://moral.net.au"}]},{"Id":"2234f8f6-6e13-4998-ba37-baf53ae44d9d","Title":"Rise of the Tech Influencer - Small steps you can take to increase your reach","Abstract":"Keeping your head down and working hard is not enough anymore. If you want to move onwards and upwards in this world you have to make sure the world knows your name. This can be hard when all you care about is the code and you don't want to look like a dick.\r\n\r\nAs Microsoft's #1 Social Seller on LinkedIn Globally - I have more influence and engagement across that platform than Mark Russinovich. I will share all my tips and tricks to help raise your profile with very little effort - so you can keep your focus where it counts.","Format":"45 mins","Level":"No experience necessary","Tags":["Soft skills","Leadership","Career"],"Presenters":[{"Id":"3637dcb5-42cc-49eb-9cbe-1fa83fd4b3a3","Name":"Michelle @ Microsoft","Tagline":"Surfs waves and webs. Level's up outside the (X)box. Keeps one jump ahead of the game(boy).","Bio":"Tedx Speaker, Tech Girl Superhero, Microsoftie and one of MCV's 30 Most Influential Women in Games. I am a Technology Evangelist who acts as an API between technology and the world. I advocate for STEM, the Games Industry and Developers. I present at around 50 Conferences and Events around the world on Technology, Social Media, Inclusion and Gaming.","ProfilePhotoUrl":"https://sessionize.com/image?f=012078893bac2e349fce8d70c54c5ac6,200,200,True,False,65-6d4a-402e-afe6-03af233c30eb.3eb9b265-dec2-42ed-8af7-612eaa5d2e1c.jpg","TwitterHandle":"msandfor","WebsiteUrl":"https://www.linkedin.com/in/michellesandford/detail/recent-activity/posts/"}]},{"Id":"68927257-08c3-41f7-9810-5d290c373405","Title":"Securing Single Page Applications","Abstract":"We’ve been spending more and more time developing applications that run in the browser, Single Page Applications, SPA's, and more recently Progressive Web Applications, PWA’s. But with more code running client side what changes do we need to make to how we write applications, test applications and secure applications?\r\n\r\nSo how do we write a secure SPA? What do we do with our security tokens, client-side data, track vulnerabilities in our dependencies or implement trust between the client and server?\r\n\r\nIn this talk, we'll deep dive into some practical solutions on how to create secure modern web applications.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Security","Frontend dev","Web","Architecture"],"Presenters":[{"Id":"f97156c1-d647-4771-9135-c3d0d7e1c16e","Name":"Aaron Powell","Tagline":"I like long walks on the beach talking about JavaScript","Bio":"Aaron is a Principal Consultant at Readify and Microsoft Front End Web Dev MVP. By day he spends his time in all facets of .NET development and by night he explores crazy ideas like writing your own implementation of numbers in .NET, creating IoC in JavaScript or implementing tic-tac-toe using git commits.","ProfilePhotoUrl":"https://sessionize.com/image?f=2daa4f08d946144987f2c5c52c6a86ce,200,200,True,False,f8943ee2-ebbf-4b33-98c8-82b16377c1a9.jpg","TwitterHandle":"slace","WebsiteUrl":"http://www.aaron-powell.com"}]},{"Id":"3a0236e4-c8fa-4cc9-ab48-fc0371a6b990","Title":"Serverless Cloud Native Progressive Web Apps in Production : Lesson from the Trenches","Abstract":"This talks outlines our experience in building PWA in the Cloud and how we manage to utilise most if not all of the browser API that makes a web app progressive, while doing it without hosting any server at all.\r\n\r\nTechnologies that I will touch on:\r\n- Notification Api in collaboration with Push Api\r\n- Sync Api \r\n- Offline Storage (local storage, IndexedDB)\r\n- Event Sourcing with DynamoDB stream\r\n- Data Lake with Kinesis Firehose and S3\r\n- Analytics with AWS Athena","Format":"20 mins","Level":"Mostly intermediate","Tags":["Web","Frontend dev","Cloud","Serverless","Architecture","APIs","AWS"],"Presenters":[{"Id":"8a048784-97e3-4cb1-8190-d6e65a4d227d","Name":"William Sia","Tagline":"Principal Consultant at Mechanical Rock","Bio":"William Sia is a repentant .net programmer, who now dabbles in the magic art of JavaScript, the occasional Golang and YAML.....so.....much......YAML. With his AWS Solution Architect Pro, AWS DevOps Engineer Pro and GCP Cloud Architect Pro certificates, it's safe to say he knows more about the cloud than his own wife (if only spouse come with certification). He now serves his time in Mechanical Rock as #8 (we are just a number here).","ProfilePhotoUrl":"https://sessionize.com/image?f=e0676fcb829b6fde7a705450a3b2c139,200,200,True,False,fa-5872-43a7-9b04-7b36aaed904b.1a48dbe9-d5c7-4b74-900a-b01f8897a8a0.jpeg","TwitterHandle":"williamsia82","WebsiteUrl":"https://www.linkedin.com/in/william-sia-67880956/"}]},{"Id":"ab660bb2-d12a-4627-9c2a-b92900e87bca","Title":"Service Meshes - Powering the next wave of microservice architectures","Abstract":"Microservices and containers have transformed application design and deployment patterns. Modern cloud native architectures - which underpin many of the world's groundbreaking tech companies such as Uber, Netflix and Airbnb - afford unparalleled levels of agility and scale but are not without trade-offs. In applications comprising hundreds of services (and thousands of service instances), concerns such as security, operability and observability pose significant challenges. Supporting compensating capabilities such as circuit breakers, retry policies and service discovery in each microservice adds undesirable code bloat and impacts our ability to choose the best language for the problem at hand should the required libraries not be available. \r\n\r\nIn this session, we will take an in-depth look at the service mesh pattern; the benefits that a decentralized microservice management approach brings; the best practices that have evolved; and most importantly what you need to know to effectively leverage a service mesh in your architecture:\r\n\r\n- How to determine the suitability of a service mesh for your application context. Don't just drink the cloud native Kool-Aid!\r\n- Disambiguate the overlapping responsibilities of an API gateway and service mesh in a modern architecture and demonstrate how they can be used in harmony.\r\n- How a service mesh enables choosing the best tool or language for a given service without being constrained by the availability of libraries for each platform. Effectively it's a weight loss plan for your microservices.\r\n- What techniques to apply when transitioning to a service mesh based architecture.\r\n\r\nAdditionally, we will take a hands-on look at what is involved to build and manage a microservice architecture leveraging Kubernetes and Istio, a leading open source service mesh. By the end of the session, you will not only understand the concepts underpinning the service mesh pattern but also have the knowledge to put them into practice.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Backend dev","Testing","Security","Cloud","DevOps","Containers","Continuous Delivery","APIs","Architecture","Microservices"],"Presenters":[{"Id":"3ec360b0-1700-4723-a91f-c287bd1e11ac","Name":"Rob Crowley","Tagline":"Principal Consultant for Readify","Bio":"Rob is a software consultant, developer and team lead with a passion for delivering systems that perform at scale. Rob has over 15 years of experience building distributed systems on the web stack and has read more RFCs than he cares to admit. Rob is an active member of the Perth IT community and regularly shares his ideas at various Meetups and conferences around Australia and internationally. He is also a co-organiser of DDD Perth, the largest IT conference in Western Australia.","ProfilePhotoUrl":"https://sessionize.com/image?f=d68d22d1fffce0605afc7ae030ccecbe,200,200,True,False,57-1142-4eb0-9b08-719c3d875bf8.b26f935d-593e-4798-a41b-d1453e1e0b85.png","TwitterHandle":"robdcrowley","WebsiteUrl":"https://www.linkedin.com/in/robdcrowley/"}]},{"Id":"5588dee1-39a1-47a9-bc04-376ff1578930","Title":"Sketching & how to win at Pictionary","Abstract":"Have you ever told yourself or others that you can’t draw? If you’ve ever played a game of Pictionary then you’ll know that getting your point across isn’t necessarily about how beautiful your drawing is. Sketching isn’t just for artists and designers - it’s a powerful tool for communicating ideas, and you don’t have to be Da Vinci to do it.\r\n\r\nMaybe you’ve struggled to get a concept across in a meeting, but hesitated to grab a marker and start scribbling on the whiteboard. Maybe you’ve struggled getting ideas out of your own head and onto paper, and dot points aren’t cutting it. Maybe you’re just not very good at Pictionary and want to beat your cousins at the next family party.\r\n\r\nYou’ll learn why sketching is such an effective method of communication, and how to put together your own visual vocabulary to bust out next time when words alone are not enough. More importantly, we’ll go over why anyone can develop the skills and confidence to use sketching in their work. No fancy tools or artistic talent required.","Format":"45 mins","Level":"No experience necessary","Tags":["Design and UX","Soft skills","Leadership"],"Presenters":[{"Id":"ff110d04-8331-4a79-a527-bb968ffc464a","Name":"Teresa Watts","Tagline":"UX Designer & Sketchnoter","Bio":"Teresa Watts was talked out of becoming an artist at a young age, but now takes every opportunity to bring her love of drawing, comics, and lettering into her UX design work at Bankwest. Before getting into UX, Teresa spent over a decade working at and with digital agencies designing and developing websites, brands and illustrations. She also runs calligraphy workshops, sketchnotes at conferences, was co-editor of Side Project magazine, and once had a comic published in a Naruto fan zine.","ProfilePhotoUrl":"https://sessionize.com/image?f=f3ae1ddb338263bc5aa0c9b545d98a47,200,200,True,False,5c23d640-b4b6-46e3-8ef3-52445ac8522e.jpg","TwitterHandle":"http://twitter.com/chisa","WebsiteUrl":"http://teresawatts.com"}]},{"Id":"26c62196-0d96-4e52-b4ba-7896ddf2ff04","Title":"The Structure of Software Revolutions","Abstract":"This talk will provide a new view of the Agile and DevOps movements, through the lens of scientific and cognitive revolutions.\r\n\r\nIt will show how to make strategic choices in recruitment, organization, culture, and technology to best situate an organization for success in this brave new world.","Format":"45 mins","Level":"No experience necessary","Tags":["Agile","DevOps","Leadership","Continuous Delivery"],"Presenters":[{"Id":"c47df330-a5c0-4b70-b4f3-1ef295d0b317","Name":"Mike Long","Tagline":"CTO@Praqma, Devops/CI/CD/Cloud/Embedded","Bio":"Mike is a CTO at Praqma, a Continuous Delivery and Devops consulting company based in Scandinavia. He has extensive experience delivering software in various cultures and industries. He helps organize several community events and conferences, including CoDe Academy which teaches Continuous Delivery to university students. Mike is a trustee on the cyber-dojo foundation.","ProfilePhotoUrl":"https://sessionize.com/image?f=a2f6dd039be1d27111633234eb755a86,200,200,True,False,b3-e9c4-44a2-ad58-b540facef65a.018e3ea5-d75a-46fe-8fe8-d3afb10ba4fd.jpg","TwitterHandle":"meekrosoft","WebsiteUrl":null}]},{"Id":"24bc1c06-ec0d-4ba0-8d3e-a995d2118f46","Title":"Thinking in Streams - gentle introduction to reactive programming via RxJS","Abstract":"Apps nowadays have an abundance of real-time events of every kind that enable a highly interactive experience to the user. We need tools for dealing with that and reactive programming comes to the rescue.\r\n\r\nIn this talk, I will introduce you to reactive paradigm using RxJS and JavaScript for examples. We'll talk about important principles when getting started with Rx, like observable and observer pattern, leveraging functional programming concepts, hot and cold observables and Rx operators.\r\n\r\nYou'll learn how to let go of old imperative and stateful programming habits, and stretch your brain to work in a different paradigm.\r\n\r\nRx is not restricted to client-side apps (it works great also in event-heavy backends), neither to a specific language (it is widely available in many dialects: .NET, Java, Scala, Clojure, JavaScript, Ruby, Kotlin, Swift, C++, Elixir, etc.), so whatever your tools are, you can definitely benefit from it.","Format":"20 mins","Level":"No experience necessary","Tags":["Backend dev","Frontend dev","Web","Functional programming"],"Presenters":[{"Id":"0053c86a-b250-4161-9d4b-ca8d5b6e598a","Name":"Chris Filipowski","Tagline":"Software Engineer at Imdex Limited","Bio":"I'm a passionate software engineer, enthusiast of modern JavaScript culture, fan of software craftsmanship, clean code and automation. Originally from Poland, currently working in Perth based company in the mining sector, delivering digital transformation by implementing bespoke web and mobile platform. Previously worked for Nokia on smart network optimisation solutions.","ProfilePhotoUrl":"https://sessionize.com/image?f=668bc7f56b5316eb3b9708f874706a67,200,200,True,False,fc-f6a5-40fb-896f-59d73ee127d1.d33a66bf-6a45-4780-b7a9-27834bfdc7f5.jpg","TwitterHandle":"chrisfilipows","WebsiteUrl":"https://www.linkedin.com/in/filipows/"}]},{"Id":"c79f149d-4e7b-4202-ba30-13cbb1df1b33","Title":"Towards a welcoming Web","Abstract":"The Internet is supposed to be an open, accessible platform. Unfortunately, frequently we see pitfalls in reliability, accessibility or performance stemming from a privileged understanding of connectivity, cultural and economic context. It turns out; the Web can be unwelcoming to many.\r\n\r\nThis talk will set the necessary context for inclusive design practice, focusing on accessibility, performance and equality. We'll learn how to foster a user-experience focused culture, no matter whether you're a developer, designer, project or business owner. You will leave inspired to build a better Web for everyone.","Format":"45 mins","Level":"No experience necessary","Tags":["Leadership","Frontend dev","Design and UX","Web","Architecture"],"Presenters":[{"Id":"35732f50-0f3f-4402-b91a-cfdfe4f02fc6","Name":"Karolina Szczur","Tagline":"Front-end engineer at HelpScout and advisor at Calibre","Bio":"Karolina has worn many hats over the last decade—a designer, front-end developer, community leader as well as diversity and inclusion activist. Currently, she's a front-end engineer at HelpScout. She's also advising Calibre, a web performance monitoring platform aiding in building a faster, more accessible Web for everyone.\r\n\r\nShe writes and speaks about tech industry culture and ethics, relentlessly pushing towards more diversity and welcoming spaces.  Her pieces have been published in Huffington Post, Smashing Magazine, Adobe, The Pastry Box, Creative Bloq and Hack Design amongst others.\r\n\r\nWith over fifteen conferences under her belt, Karolina is also a seasoned organiser, previously curating such well-known events as JSConf and CSSConf Australia or JSConf Europe.","ProfilePhotoUrl":"https://sessionize.com/image?f=f99389bce175ec4d19a5d227e72be7f0,200,200,True,False,ea-fd82-42c3-89b7-e732d79a947c.c27309b5-e5e2-4b5d-9710-120d6d2d822e.jpg","TwitterHandle":"fox","WebsiteUrl":"https://thefox.is/"}]},{"Id":"96326393-7372-46d0-a07c-3006b97517cf","Title":"Toxic Developers and You","Abstract":"Have you ever started your morning by worrying about “that person”, and how long you can put off having to deal with them? Do thoughts of this person and their actions occupy your mind when you should be focussing on work or your personal life? Have you been so unmotivated and anxious about work that you’ve considered quitting?\r\n\r\nToxic developers can make you doubt yourself and your abilities.  Their behaviour can be hugely disruptive to the success of individuals and ultimately teams as a whole.\r\n\r\nI will address how to identify and deal with toxic developers in the workplace by providing you with strategies you can apply day to day. My aim is to help you regain your focus by sharing coping mechanisms and healthy ways to respond to a situation, whether it is you who is affected or your teammates.\r\n\r\nThere may be others on your team who struggle and self-sacrifice in an attempt to cope with the situation. No one should leave a job they enjoy or lose their passion for their work because of one individual.","Format":"20 mins","Level":"No experience necessary","Tags":["Soft skills","Teams","Leadership"],"Presenters":[{"Id":"a941c0cc-1133-484e-8a91-4f94295f02ef","Name":"Patrik Affentranger","Tagline":"Swiss Front End Web Developer and Professional White Space Hunter","Bio":"Having swapped the Swiss mountains with Western Australian beaches, Patrik calls Perth home while working as a Front End Web Developer. He is passionate about creating great user experiences and being happy when going to work.","ProfilePhotoUrl":"https://sessionize.com/image?f=bdbfd1a0df98fcf8d9b31ac2efb1c912,200,200,True,False,be-177b-40ad-a307-80d002e6f987.fed41b5a-4fb3-47fa-8e7e-2d1a2854daf1.jpg","TwitterHandle":"pzimat","WebsiteUrl":"https://www.linkedin.com/in/paffentranger/"}]},{"Id":"f7fc010d-8c47-4b86-b1e9-1221b63e0281","Title":"Understand Functional Programming in 40 Minutes (or your Money Back*)","Abstract":"Functional programming is becoming increasingly important as we build more complex systems and use more parallel and concurrent programming.  It’s also now present and being used more in mainstream languages like Java, C#, Swift and Javascript so it can no-longer be ignored by developers.  \r\n\r\nHave you tried to understand functional programming but been completely bamboozled?  Or do you know what a function is and understand the basics of functional programming but wonder what’s with all the other stuff?  It’s most likely the big picture hasn’t been explained, or at least not clearly enough.\r\n\r\nThis talk will give you a clear conceptual overview of functional programming with simple examples so that you will really get what it’s all about.  There are consequences of only using functions and this is what makes functional programming very different from other programming paradigms.   \r\n\r\nThis talk won’t use terms like functor, applicative, or monad but by the end of the talk you will definitely understand them.  It also won’t make you a functional programmer overnight but it will give you a conceptual framework to know what you need to do and why when doing functional programming.  \r\n\r\nThe presenter has more than twenty years experience explaining complex technical concepts in clear and simple terms.  \r\n\r\n(* not really but you’ll certainly get your money’s worth and more)","Format":"45 mins","Level":"Mostly intermediate","Tags":["Backend dev","Frontend dev","Functional programming"],"Presenters":[{"Id":"84bee702-93a5-494f-8ecc-2a7b567eae0f","Name":"Ashley Aitken","Tagline":"Entrepreneur, developer, academic, and professional trainer!","Bio":"Ashley has a PhD in Computer Science and Software Engineering from UNSW (specialising in AI) and has over 25 years experience in academia and the IT industry as a consultant, developer and professional trainer.  He has given professional courses for IBM, Apple and other companies around Australia, across S/E Asia and in the UK and UK.  He is currently building the software for his edtech startup Acavista using CQRS, ES, microservices, Akka, and React in Scala and JavaScript and has deployed on Google Cloud and Digital Ocean.  He also provides consulting and training services in Lean Startup with Customer Development for companies and startups through Innovately.com.au.  To give back to the community he runs the Lean Startup Perth meetup, presents at various meetups and conferences, and helps out with DDD Perth.   ","ProfilePhotoUrl":"https://sessionize.com/image?f=879abac402fb2c4b85feb0f6593cc06a,200,200,True,False,8c-1ae4-44cf-bf2d-53bc7b035ea7.1c29599d-6559-465a-9672-46d6d482f789.jpg","TwitterHandle":"ashleyaitken","WebsiteUrl":"https://www.linkedin.com/in/ashleyaitken/"}]},{"Id":"88344a80-a3e8-484a-93b6-e6a4f80af84f","Title":"What to do with our unconscious bias.","Abstract":"Upgrade your skills on how to identify your own unconscious bias, when to challenge it, how to communicate it and best deal with the environment that doesn't match your perfect world scenario.\r\n\r\nA journey into a critical and hysterical investigation of the speakers own personal unconscious bias across childhood experiences, education and careers.\r\n\r\nYou don’t need to be a manager help create safe space to question bias in your organisation.","Format":"20 mins","Level":"No experience necessary","Tags":["Leadership","Teams","Soft skills"],"Presenters":[{"Id":"5664deb1-f1d9-4b40-b00c-29cb3230f66b","Name":"Ming Johanson","Tagline":"Mother of Unicorns","Bio":"Ming works with a number of businesses across the globe of varying sizes training in social media, shaping the landscape for leaders to adapt their management, sales and marketing culture so that it fits into the modern day world of hyper-connectivity.\r\n\r\nIn her spare time Ming is also an elected board member of the Western Australian Branch of the Australian Computer Society (ACS), a regular contributor and commentator for 6PR radio in digital and social media, a mentor at Startup Weekends in Perth, and an Ambassador for in mental health for R U OK? Day.","ProfilePhotoUrl":"https://sessionize.com/image?f=d1ef422051b8c199927f03d9d5922ac1,200,200,True,False,2b-89af-4b97-bd48-f8e8174eb9d1.8a088eb2-2cfc-4db8-be6d-991db8f6abe3.jpg","TwitterHandle":"http://twitter.com/MingJohanson","WebsiteUrl":"https://mingjohanson.com.au"}]},{"Id":"6cf90233-65d8-4bdd-868f-9d13683aac78","Title":"You're doing TypeScript wrong","Abstract":"TypeScript is a great language with a ton of features to support application development in JavaScript. By allowing optional type annotations, TypeScript can tell you at write-time or compile-time when something could break at run-time, reducing the number of bugs in your code. What could be wrong with that?\r\n\r\nWe will look at a few examples where you may have inadvertently prevented TypeScript from being able to help you, how you can avoid them in the future, and (maybe) how we all got in this mess in the first place.","Format":"20 mins","Level":"Mostly intermediate","Tags":["Frontend dev","Backend dev","Web"],"Presenters":[{"Id":"9640d000-a8f6-4f25-be3a-5eb5c369f981","Name":"Ben Lowry","Tagline":"Developer at Readify","Bio":"Ben has spent the last couple of years writing a whole bunch more TypeScript and a little less C# than he expected. Currently working at Readify, Ben gets the chance to work with teams all over the place, and is excited to meet all of you!","ProfilePhotoUrl":"https://sessionize.com/image?f=f3fd9dc6cb39a213d8dcb5d5be50da39,200,200,True,False,42-e77c-413a-9e7f-f085c03ad9dd.d95cf6f6-648a-4722-a7b8-d397fa37bb55.jpg","TwitterHandle":"benjaminlowry","WebsiteUrl":null}]}]