[{"Id":"9c81bbdb-8898-4259-afac-0dc73ff363b5","Title":"100% Remote Working - Better than you Dared to Dream","Abstract":"You've seen seen people talking about it, even had friends doing it, but is remote working really as good as they say it is?\r\n\r\nIn August 2018 I took the plunge and discovered developer nirvana, a re-invigorated soul, and a desire to never work in open-plan offices ever again.\r\n\r\nIn this talk I'll share my experiences working 100% remotely for a company in a different time zone.  I'll cover the techniques and the tech I use (both hardware and software), the challenges I face, and the peace I have found.\r\n\r\nThis talk is for introverts who struggle in their current work situation, for developers desperate to get work done, and for people wanting to level-up at communicating.","Format":"20 mins","Level":"No experience necessary","Tags":["Soft Skills","Career","Health"],"Presenters":[{"Id":"0f36aee9-e973-44cc-848f-142b395c0744","Name":"Carl Scarlett","Tagline":"Designer, Developer, Dreamer, Doer","Bio":"Carl believes anyone can do anything and lives by this philosophy.  He believes pigeon holes serve only as convenient labels, not unsurpassable boundaries. \r\n\r\nCarl values patterns and practices across multiple disciplines.  His thirst for knowledge and experience is insatiable.  When challenges arise he brings an endless stream of ideas to bear. \r\n\r\nCarl thinks with empathy and critically, and is effective as a designer and as a software engineer.  His leadership style is to share knowledge and to teach by doing.  He achieves goals on his own or in a group.\r\n\r\nHis side projects include constructing tiny houses and building computer games.","ProfilePhotoUrl":"https://sessionize.com/image?f=e1a460aaf5b2e8c3afb56b60b7febb7f,400,400,True,False,65b1eb82-1b30-4298-b39e-8fb6d135bc90.jpg","TwitterHandle":"ZodmanPerth","WebsiteUrl":"http://www.redperegrine.net/"}]},{"Id":"112b54cc-df00-40fd-ad5e-4b0714329821","Title":"AI for Earth: Using machine learning to monitor, model, and manage natural resources","Abstract":"The AI for Earth program applies machine learning and data science to hard challenges in agriculture, water, climate, and biodiversity.  In this talk, we will discuss how the AI for Earth team, Microsoft Research, and AI for Earth grant recipients are using machine learning to enable precision agriculture, to predict outbreaks of disease, to detect poachers in real time, and to classify animals for conservation.  Finally, we will briefly provide details on the AI for Earth grant program to obtain resources for everyone to work on these challenges.  \r\n","Format":"45 mins","Level":"No experience necessary","Tags":["Data & Analytics","Machine Learning"],"Presenters":[{"Id":"cbd64302-96fa-44ed-8113-f933ce3ebc84","Name":"Jennifer Marsman","Tagline":"Microsoft, Principal Engineer","Bio":"Jennifer Marsman is the Principal Software Engineer of Microsoft’s “AI for Earth” group, where she uses data science, machine learning, and artificial intelligence to aid with clean water, agriculture, biodiversity, and climate change.  Jennifer is a frequent speaker at software development conferences around the world.  Since 2016, Jennifer was recognized as one of the “top 100 most influential individuals in artificial intelligence and machine learning” by Onalytica, reaching the #2 slot in 2018.  She has been featured in Bloomberg for her work using EEG and machine learning to perform lie detection.  In 2009, Jennifer was chosen as \"Techie whose innovation will have the biggest impact\" by X-OLOGY for her work with GiveCamps, a weekend-long event where developers code for charity.  She has also received many honors from Microsoft, including the “Best in Role” award for Technical Evangelism, Central Region Top Contributor Award, Heartland District Top Contributor Award, DPE Community Evangelist Award, CPE Champion Award, MSUS Diversity & Inclusion Award, Gold Club, and Platinum Club.  Prior to becoming a Developer Evangelist, Jennifer was a software developer in Microsoft’s Natural Interactive Services division.  In this role, she earned two patents for her work in search and data mining algorithms.  Jennifer has also held positions with Ford Motor Company, National Instruments, and Soar Technology.  Jennifer holds a Bachelor’s Degree in Computer Engineering and Master’s Degree in Computer Science and Engineering from the University of Michigan in Ann Arbor.  Her graduate work specialized in artificial intelligence and computational theory.  Jennifer blogs at http://blogs.msdn.microsoft.com/jennifer and tweets at http://twitter.com/jennifermarsman.","ProfilePhotoUrl":"https://sessionize.com/image?f=a0dd6cf7e9ed95d05ddad2adb8a367a3,400,400,True,False,fa-d680-4613-9b43-2721f6fbe5d6.0ffc20a0-b3f0-45b4-93ad-fb8c4ab92676.jpg","TwitterHandle":"http://twitter.com/jennifermarsman","WebsiteUrl":"https://blogs.msdn.microsoft.com/jennifer/"}]},{"Id":"385e78cf-b12a-466c-9fb8-e29c7fd627fb","Title":"Anyone can Animate, even if they Can’t Draw","Abstract":"Can you sing? Even if you sound like a gargling crow, I bet you can still tap out some kind of rhythm. \r\nThat's the difference between animation, especially in UX, and drawing. UI Animation is all about the timing, plus understanding a few basic principles. \r\n\r\nIn the last year, the toolscape of UI development has bloomed with new animation tools that vastly simplify development.\r\n\r\nUntil recently, delivering animation in a user interface was the most painful kind of designer-developer handoff. An expert user of a major design tool crafted an animation. Then one of two things happened. Either that animation was plonked on a screen as an isolated movie or gif, or a developer was tasked with manually converting it into low-level drawing calls. \r\n\r\nThis talk includes a brief overview of animation but focuses on practical ways to simply animate elements of your UI to add more fun and user hinting.\r\n\r\nTools covered are mainly code-generation tools which go straight  from visual animation design to usable code. This closes the gap between designer intention and delivery. Even better, they make animation in UX feasible for developers lacking the luxury of design experts.","Format":"20 mins","Level":"No experience necessary","Tags":["Frontend Development","UX","Mobile"],"Presenters":[{"Id":"dfb253cd-f22e-4503-9a76-fc42d99f133a","Name":"Andy Dent","Tagline":"Touchgram founder, enabling visual Dad jokes in iMessage. ","Bio":"Andy is Founder & CEO of Touchgram, a messaging platform for adding more delight into your digital relationships. He's a life-long Chinese martial artist & programmer for the same 35+ years. As a technical dev in a mining town, he's worked on international products ranging from CAD to 3D stereo movies. He's often been a (very) remote team member from home in Perth, Western Australia. This includes a fun 2 years for Realm mobile database's Danish Xamarin team. Naturally a toolsmith, inspired by the Montessori motto \"help me to do it for myself\", his first startup was C++ dev tools in the 90's. He's now focused on creativity tools for a wider audience, starting with iMessage & with a broad ambition to help connect scattered families.","ProfilePhotoUrl":"https://sessionize.com/image?f=200a6f0786e27d0649556f590597880f,400,400,True,False,57-47d1-4a9c-b6a3-04f71e73227e.b5a42b99-cccf-4d1e-aaec-803fef668906.jpg","TwitterHandle":"AndyDentPerth","WebsiteUrl":"https://medium.com/@andydentperth"}]},{"Id":"fa861d2a-9597-4a98-8510-fc0dc0b400e6","Title":"Breaking Up With Redux: Client State Management with Apollo and GraphQL","Abstract":"Do you love React but have been finding yourself spending an excessive amount of time battling Redux? \r\n\r\nIn this talk, I will walk you through how you can manage your state in React using GraphQL with Apollo Client, in a simple and maintainable way. \r\n\r\nI will go over some of the basics of GraphQL and how it can be implemented in a React app using the same syntax we already know and love to use in our GraphQL API.  \r\n\r\nAnd then I will share some of my personal experiences with it.","Format":"20 mins","Level":"No experience necessary","Tags":["Frontend Development","Web"],"Presenters":[{"Id":"9d711efc-7e0f-497c-b77d-34d89e030126","Name":"Inaie Ignacio","Tagline":"Senior Developer, Readify","Bio":"Inaie is a senior developer at Readify who enjoys building and learning about all things frontend whenever she is not travelling around.","ProfilePhotoUrl":"https://sessionize.com/image?f=c3d6eccf7cbd86403b8dca608f19d8e5,400,400,True,False,5c-ddb9-4aa7-b853-3afde2b0bc08.2893259c-fa8c-4324-8b9b-b51245d9f048.jpg","TwitterHandle":"inaiei","WebsiteUrl":"https://www.linkedin.com/in/inaie/"}]},{"Id":"9b7efb7a-64e0-41ac-9439-f65a662147da","Title":"Building Great Teams","Abstract":"How do you build your dream team and ensure it continues to thrive? \r\n\r\nIn this talk I will run through the life cycle of growing, developing and retaining a great team. Starting with strategies to create a great culture within your existing team, tips for interviewing to ensure you hire the right people and lastly practical ways to manage or influence behaviour and have \"difficult\" conversations to ensure you keep a great team!\r\n\r\nThis talk is aimed at team leads / tech leads / senior developers / and anyone who is going to be involved in this life cycle. ","Format":"45 mins","Level":"No experience necessary","Tags":["Soft Skills","Leadership","Teams"],"Presenters":[{"Id":"0901be27-7de0-43f2-92f0-7c5691a3b9f8","Name":"Donna Edwards","Tagline":"Partner Manager @ Amazon Web Services | CEO @ SHOUTOUT | NFP Committee Member | 40under40 Winner","Bio":"Donna has been building technical teams for over twenty years. She is passionate about helping businesses scale, creating great workplace environments where people can thrive. \r\n\r\nDonna recently joined AWS as the Partner Manager for WA/SA and was previously the State Delivery Manager at Readify, leading a team of 80. She is the CEO of startup SHOUTOUT - a simple recognition platform designed to help companies create a culture of gratitude. \r\n\r\nDonna is passionate about community and an organiser for many NFP groups including Women in Technology WA, Muses Code JS, Women Who Code Melbourne and is a Beacon Foundation mentor.\r\n\r\nDonna was recognised for her contribution to Professional Services and Community with a 40 under 40 Award in 2019.","ProfilePhotoUrl":"https://sessionize.com/image?f=1f585c241c584bc4e3f198924026cd3b,400,400,True,False,28-da1d-4681-817c-6cc42bf9484e.e85def54-cb87-4fe8-a2b7-a909351f01ab.png","TwitterHandle":"Don_IsGood","WebsiteUrl":"https://www.linkedin.com/in/edwardsdonna/"}]},{"Id":"70537fd7-4e49-4100-97ee-ce79c71545d6","Title":"Building Serverless APIs with Azure Functions and C#","Abstract":"Azure Functions allow us to run small pieces of code without having to be concerned about the underlying infrastructure.\r\nBy using a serverless model, we only pay for the time that our code runs and Azure takes care of scaling resources when we need it to. This means that as developers, all we need to do is focus on our APIs business logic\r\n\r\nIn this session, I'll talk about how you can use Azure Functions to create endpoints using built-in HTTP triggers and bindings that\r\nthat allow you to connect to a variety of data sources and build APIs that scale. \r\nI'll also demo how you can use Proxies to specify endpoints to other resources, create OpenAPI definitions for your serverless APIs and how you can consumer your APIs\r\n\r\nBy the end of this session, you'll know how to use Azure Functions to develop, test and deploy serverless APIs to Azure.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Backend Development","Azure","Serverless"],"Presenters":[{"Id":"873dddaf-e22a-4c5f-8927-91861348733a","Name":"Will Velida","Tagline":"Graduate Engineer at ASB Bank","Bio":"I'm a Graduate Engineer at ASB Bank in New Zealand. I'm passionate about machine learning, data and artifical intelligence and how it can be used to augment our lives.\r\n\r\nOutside from that, I love to kayak when I get the chance.","ProfilePhotoUrl":"https://sessionize.com/image?f=e7cee634e5b6c4543c3200bb634b1f1a,400,400,True,False,9a1d047a-4b08-4989-a67a-bf69313b7f63.jpg","TwitterHandle":"willvelida","WebsiteUrl":"https://williamvelida.com/"}]},{"Id":"643434fc-64d5-49ba-a1d8-848a7570b6fa","Title":"Coding in Interviews","Abstract":"Have you ever had to write code in an interview? Did you @#$* your pants? Is it even a good idea to make people code in such a high pressure environment? In this session I’ll aim to address these questions and provide a basic methodology to help guarantee success in your next coding interview!","Format":"45 mins","Level":"No experience necessary","Tags":["Soft Skills","Coding","Career"],"Presenters":[{"Id":"30e2d7c2-bdfd-4d08-8c7d-4596d25d5bec","Name":"James Miles","Tagline":"Engineering Lead @ Virtual Gaming Worlds","Bio":"I'm have a passion for computer programming and the design of software systems. I'm currently and engineering lead at VGW where I look after the Casino engineering team.","ProfilePhotoUrl":"https://sessionize.com/image?f=8ce47ea7addc9a116ec198bc11b09fea,400,400,True,False,25-436e-4c49-b050-b11b9b9cfdd3.86c834dc-b1c0-4a5f-89e5-1f9c29ab80b4.png","TwitterHandle":null,"WebsiteUrl":"https://www.linkedin.com/in/jamesomiles/"}]},{"Id":"7bb9859c-ed23-4569-b863-7b4c440b2b88","Title":"Creative Coding and the JavaScript Canvas","Abstract":"Software development is often thought of as a hard science, rather than a creative pursuit.\r\n \r\nIn this talk, I'm planning to challenge that assumption. I'll be giving a practical demonstration of how to use the JavaScript canvas to create artistic visualizations on the fly, using real time data - including human brain activity. I'll also be discussing the creative process behind making art using unconventional tools, and how we can use some of these concepts to our advantage when working with technology. \r\n \r\nNo artistic (or technical) talent is required to enjoy! ","Format":"20 mins","Level":"No experience necessary","Tags":["Frontend Development","Web","IoT"],"Presenters":[{"Id":"33e81ddd-1212-4ecc-91d8-47d9faf2e253","Name":"Alice McCullagh","Tagline":"Software Developer Consultant - Readify","Bio":"I'm a Perth based software engineer, who's also a part time artist and part time stand-up comedian. I started mucking around with JavaScript visualisations when I was about 11, and never really stopped. Currently, I work at Readify as a developer/consultant, doing a mish-mash of fullstack things - currently, I'm focusing on .NET development, but overall I like to stay language agnostic. In broad terms, the main focus of my work is making apps look nicer and do the things they're supposed to do. ","ProfilePhotoUrl":"https://sessionize.com/image?f=475bc0c57f95cab66d9983fd024812a7,400,400,True,False,5c-278c-45bc-9e10-d822ce1cf8a4.27353396-33f8-4b71-98fe-f72b1c074d73.jpg","TwitterHandle":"TheRealMcCluff","WebsiteUrl":"https://www.linkedin.com/in/alice-mccullagh-06699966/"}]},{"Id":"3c2badde-1534-494b-a084-8ca5857d648d","Title":"Cryptography: so much to learn! (If history is anything to go by.)","Abstract":"Cryptography is all the rage, and not without reason. It's an important part of the security of all our communication. You hope your passwords are handled securely, and you assume anything you send to your bank in your online banking session is protected by encryption. \r\n\r\nGetting your head around cryptography can be daunting. There's a lot to learn. It's a fast-evolving field within science and software engineering, and encryption protocols sometimes don't even last a decade before they become obsolete (read: unsafe). But it doesn't mean you shouldn't try to learn as much as you can. \r\n\r\nIn my session, I'd like to show you what I learned about cryptography by looking at an \"ancient\" encryption/decryption tool: the German Enigma. The Germans assumed the Enigma was uncrackable, but due to problems inherent in the design and fundamental cryptographic problems, the allied forces were able to crack it. Some of the lessons learnt can (and should!) be applied to modern cryptography. \r\n\r\nYou don't need any experience or extensive knowledge around the topic of encryption to enjoy my session. ","Format":"20 mins","Level":"No experience necessary","Tags":["Data & Analytics","Security","Architecture"],"Presenters":[{"Id":"960c7a10-1f78-474d-971f-dd1dd0bcfd98","Name":"Sander Huijsen","Tagline":"Sander Huijsen Software Engineering & Consultancy","Bio":"Sander Huijsen is the owner of Sander Huijsen Software Engineering and Consultancy in Perth, WA. He has a long-standing track record in the field of software engineering. He has worked for various companies in various countries and with a plethora of platforms and programming languages. ","ProfilePhotoUrl":"https://sessionize.com/image?f=0fb6fecbf280a6641648456d5d9da3bd,400,400,True,False,da-0756-499a-bc7b-608a4c5a6565.07f6c6c8-229b-4d2f-a1b4-983487cec7eb.png","TwitterHandle":"ahuijsen","WebsiteUrl":"https://www.linkedin.com/in/ahuijsen/"}]},{"Id":"df03352d-b177-420d-b66a-b1c174e3e0a3","Title":"CSS Grid - What is this Magic?!","Abstract":"We’ve all heard a lot in the last year about a new advancement in the world of CSS, called CSS Grid. Starting off at whispers, we’re now starting to hear it as a deafening roar as more and more developers write about it, talk about it, share it and start using it. In the world of front end, I see it everywhere I turn and am excited as I start to use it in my own projects.\r\n\r\nBut what does this new CSS specification mean for software developers, and why should you care about it? In the world of tech today, we can do so many amazing things and use whatever language we choose across a wide range of devices and platforms. Whether it’s the advent of React and React Native, or frameworks like Electron, it’s easier than ever to build one app that works on multiple platforms with the language we know and work with best. The ability to do this also expands to styling apps on any platform using CSS, and therefore being able to utilise the magical thing that is\r\nCSS Grid.\r\n\r\nThe reason CSS Grid is gaining so much attention, is because it’s a game changer for front end and layouts. With a few simple lines of code, we can now create imaginative, dynamic, responsive layouts (yep, I know that’s a lot of buzz words). While a lot of people are calling this the new ‘table layout’, grid gives us so much more, with the ability to spread cells across columns and rows to whatever size you choose, dictate which direction new items flow, allow cells to move around to fit in place and even tell certain cells exactly where they need to sit.\r\n\r\nWhile there is so much to worry about when developing an app, CSS Grid means that you can worry less about building the layout on the front end, and more about making sure the back end works well. Let me show you how the magic works.","Format":"45 mins","Level":"No experience necessary","Tags":["Frontend Development","Web"],"Presenters":[{"Id":"a8d5d307-54a8-4ef6-a5de-d4cce2a950e8","Name":"Amy Kapernick","Tagline":"Front End Jedi, Evangelist and Dog Lover","Bio":"Amy is a freelance developer, starting her own business, working with other freelancers and learning everything she can about the web. She’s been a freelancer on the side for 4 years, and most recently worked at an agency in Subiaco.\r\nAmy also spends her time helping out as a co-organiser for Fenders (a community group of front-end developers in Perth), other community events (such as the JuniorDev Meetup and Perth Web Girls) and works as an evangelist for YOW! Conference. She blogs in her spare time (about tech, the web and life), and volunteers as a reviewer for the Fringe World Festival in Perth.","ProfilePhotoUrl":"https://sessionize.com/image?f=0db4ea20d56b0f19a4f5801f1adaa8ed,400,400,True,False,5c-ed26-4dc6-8612-0f18abdfd9f5.e5b882c9-8f56-4eb9-a20d-7c6723ab8bf0.jpg","TwitterHandle":"amys_kapers","WebsiteUrl":"https://amygoestoperth.com.au"}]},{"Id":"fd0518e0-a52c-44dd-84fb-61ce59c3cdb5","Title":"Demystifying AWS Security Services","Abstract":"Are you using AWS? Are you aware of the difference between Trusted Advisor, Config, Macie and Guard Durty? Are you familiar with what each of those services do and how to use them? Worry no-more, this talk will skill you up with major AWS security services and show you how you can apply them to secure your AWS workloads today.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Cloud","AWS","Security"],"Presenters":[{"Id":"27bea4e1-48f7-439f-adbd-babf45209234","Name":"Even Zhang","Tagline":"Innovation Engineer at VGW","Bio":"Even is a software engineer with a strong background in container, serverless and cloud technology. Recently he has focused his efforts on building infrastructure, tools and services in enabling products and teams to scale and creating an environment where creativity is unhindered by infrastructure. He is also passionate about empowering others in and outside of the software field; spending his spare time volunteering and mentoring students and junior developers.","ProfilePhotoUrl":"https://sessionize.com/image?f=1e926d2888001474b6bcd8a67c3864d2,400,400,True,False,19-38ab-4d9a-b8f3-636532bf6d42.ae83c72a-649d-4f4e-b98f-a07be1455846.png","TwitterHandle":"evenzdev","WebsiteUrl":"https://medium.com/@evenzdev/"}]},{"Id":"b73abc43-7634-40d3-a38b-696bdb844cc0","Title":"Dependency Injection is only 1/5 of the Inversion of Control problem","Abstract":"What is The OO Matrix?  I can not tell you.  I must show you what it is.  Some may be aware of it's existence, while others have grown up in it knowing no difference.  This talk offers you the red pill to show you whatis The OO Matrix.\r\n\r\nPlus, if you think Spring is great, then this talk shows you how it can be better.  If you think Spring has issues, then this talk gives you the missing pieces.\r\n\r\nDependency Injection is a great concept, but it's actually only 1/5 of the Inversion of Control (IoC) problem.   By introducing further injection techniques (such as Thread Injection and Continuation Injection), we can create a more complete Inversion of Control.\r\n\r\nAlso, Functional Programming is on the rise.  Functional programming claims dependency injection is not necessary, as this is achieved through higher order function composition. Therefore, is there still a place for Dependency Injection in the future of programming?   Yes, we actually need to apply IoC to Functional programming.\r\n\r\nThe result is better cohesion and lower coupling in your code.\r\n\r\nThis talk will take you through the remaining IoC concepts, so that these enable you to build and maintain your systems easier.","Format":"20 mins","Level":"Mostly intermediate","Tags":["Backend Development","Functional Programming","Architecture"],"Presenters":[{"Id":"ea015a3a-8d50-46f8-81a8-2c5ce157a7a1","Name":"Daniel Sagenschneider","Tagline":"Evangelist for \"true\" inversion of control","Bio":"Author of OfficeFloor: using office patterns to improve software design and founder of OfficeFloor (http://officefloor.net).   My focus has been on improving Software via taking patterns from the Business (rather than the typical forcing \"tech\" patterns on the business).  This has led to closing many gaps in some of the most fundamental software patterns.","ProfilePhotoUrl":"https://sessionize.com/image?f=e771190bc5a647aba22524b2c39e5e68,400,400,True,False,e8d69ad2-4fb9-4c19-aa06-9acc49a95705.jpg","TwitterHandle":"sagenschneider","WebsiteUrl":"http://sagenschneider.blogspot.com"}]},{"Id":"0bcae524-eb87-4080-b189-ab5c7d5ad5fa","Title":"Design: 25 lessons from 25 years","Abstract":"What's this about?\r\n \r\nFrom industrial Northern 90's England to sunny 21st Century Perth - starting, growing and steering design teams through thick, thin and just plain weird - there's 25 years of Nick’s experiences to be shared! Tales of woe, some unlikely successes, many leaps of faith and a few poignant reflections might just strike a note with and inspire those leading or aspiring to become a design, UX or software team leader.\r\n \r\nHow will this session run?\r\n \r\nThis won't be a presentation! We'll host a lively interview to surface and share tangible take outs, relayed through stories of starting out, succeeding, failing and leading.\r\n \r\nWhat will I get out of it?\r\n \r\nBeyond your sublime technical skills, learning how to work with people is foundational to your career. More than ever we're carving our own destiny, so through a series of reflections, anecdotes, projects and people experiences, you'll (hopefully!) come away armed with some new tools to help you navigate your career path.\r\n \r\nBetween them Nick and Jonathon have years of industry experience across many sectors. The deck will be shared for all, and Nick will be happy to elaborate, coach or otherwise share more throughout the event and beyond.\r\n","Format":"45 mins","Level":"No experience necessary","Tags":["Design and UX","Design","Leadership"],"Presenters":[{"Id":"bbb3e32d-94f5-450c-8f32-6ee7a6cd1258","Name":"Nick Leigh","Tagline":"Experience design leader at Bankwest and consultant","Bio":"Since graduating with an honours degree in Business, Nick has dedicated his 20+ year career to design and design leadership. From a backyard startup through agency life to WA’s biggest institutions, Nick has created – and built and lead – teams to create digital and physical experiences and artefacts across a broad spectrum of industries, platforms and brands. With entrepreneurial and leadership experience delivering design, digital and social marketing, customer and brand experience, and digital strategy and transformation projects, Nick is still humbly learning the idiosyncrasies of human-centred design. ","ProfilePhotoUrl":"https://sessionize.com/image?f=f72f4320823982152586b84110fdc3f1,400,400,True,False,c9-5a7b-4790-b12c-bf95b4a256f8.d5ac028e-2ed4-4c8a-9a9e-8ca8bb709119.jpg","TwitterHandle":"nixstuff","WebsiteUrl":"https://www.linkedin.com/in/nickjleigh"},{"Id":"02477e75-f69d-4942-a71c-2ec85fa8e3e8","Name":"Jonathan Steingiesser","Tagline":"Isobar, Strategic Design Associate Director ","Bio":"Jonathan is the Strategic Design Associate Director at Isobar where he divides his time between design strategy, customer research, consulting and service design improvements. With over 15 years of design experience in all industry sectors, Jonathan has fostered a passion for design innovation and continuous improvement. Jonathan has also advised startups in Perth, Melbourne and Sydney. Locally he is one of co-organisers of the Service Design Perth Meetup which you are all welcome to attend.\r\n \r\nHe is a trilingual third culture kid who enjoys spending time with his family and playing football.","ProfilePhotoUrl":"https://sessionize.com/image?f=fd9034350022e56673783e9d24a5c888,400,400,True,False,aa87c322-ade9-48d7-8f36-2a94ce80d58c.jpg","TwitterHandle":"stemaco","WebsiteUrl":"https://au.linkedin.com/in/jonathansteingiesser"}]},{"Id":"b446c945-6210-4b56-bc78-772347060a5b","Title":"DesignOps - How to get ideas out faster","Abstract":"In this talk I will be discussing how Designers and Developers can work together to get ideas into their customer's hands as quickly as possible, so that they can be used, measured and improved. \r\n\r\nProduct testing will let you know if your customers 'can' use your product, but it will not tell you if they 'will' use your product. These two things are very different. We need to get ideas out quickly and start monitoring and measuring the outcomes.\r\n\r\nTechniques like 'Dual Track Delivery' and 'Designing your backlog' can help multi-capability teams get ideas into the live environment quickly and I will be discussing how they work and the risks you need to be aware of.","Format":"45 mins","Level":"No experience necessary","Tags":["Design and UX","Agile","Teams"],"Presenters":[{"Id":"99257575-ddae-425b-bfc5-9f4ca68e0ebb","Name":"Kristy Sachse","Tagline":"Readify, Lead Experience Designer","Bio":"Lover of all things design, technology, whimsy and icy pole...I've been in IT for over 18 years. My style is collaborative and hands-on. I'm all about empowering everyone to contribute, this ensures we are solving the right problems with the right solutions. ","ProfilePhotoUrl":"https://sessionize.com/image?f=4e44712fc8669ec2653d921790efebbc,400,400,True,False,c5-e48d-42a5-af7c-b7cb88e66d73.6f9badef-51bf-4527-bc39-7ea33ca7aab8.png","TwitterHandle":"kristysachse","WebsiteUrl":"https://linkedin.com/in/ksachse/"}]},{"Id":"a6eb8bb3-6086-4cb3-b024-d0a6c4dd3de3","Title":"Every good outage starts with a queue","Abstract":"Queues are bad, but software developers love them. The problem with queues is they are binary, either they're full or empty. You'd think they would magically fix any overload or failure problem. But they don't, and bring with them a bunch of their own problems.\r\n\r\nHear a war-story about how naive assumptions and over-optimism caused a near week-long ongoing outage.\r\n\r\nLearn about some of the reasons why queues are not a one-size fits all solution, and how there is no such thing as a good queue, only one that is absolutely necessary. Queues are in more places than you think, and they can bite you in ways that you wont expect.\r\n\r\nAre you building event sourced systems with process managers and read model populators? Are you working with serverless? This session is for you.","Format":"20 mins","Level":"Mostly intermediate","Tags":["Backend Development","Microservices","Architecture"],"Presenters":[{"Id":"097cbfd1-1926-4953-a56a-79e3d8aeebf3","Name":"Macklin Hartley","Tagline":"Software Engineer","Bio":"I am a Software Developer with over 7 years of experience building highly-scalable distributed systems. I'm an advocate for modern design patterns and architectures such as Domain Driven Design, Event Sourcing and CQRS. I am also passionate about mentoring and volunteering my time to helping others grow. ","ProfilePhotoUrl":"https://sessionize.com/image?f=ddb3302209d0cee6396004a3cf6a1233,400,400,True,False,bf064476-1d38-4734-9ba1-9a6bc65897e3.jpg","TwitterHandle":"macklin_hartley","WebsiteUrl":"http://macklin.me/"}]},{"Id":"f3a57e6c-0325-4898-bffd-2d3040f5dee9","Title":"Falling For Flutter: A web developer's journey to the app store, and how you can do the same","Abstract":"Taking the leap from web to mobile development can be intimidating. There are countless tools and frameworks competing for your attention, it can be hard to know where to begin. You may be familiar with React Native, Cordova or Xamarin - but have you considered Flutter?\r\n\r\nFlutter is a cross-platform UI framework created by Google. With a delightful developer experience and a focus on polished, performant UI, Flutter provides a refreshing alternative for cross-platform app development.\r\n\r\nThis is the story of how I fell in love with Flutter, how it helped me achieve my goals, and how it could help you do the same. We will talk about what makes Flutter different from the alternatives, play with some code, and hopefully inspire you to pursue the idea that you wrote on a napkin that one time.","Format":"20 mins","Level":"Mostly intermediate","Tags":["Frontend Development","Mobile","Tooling"],"Presenters":[{"Id":"ca6983aa-e2d1-4431-92f6-cca396cbb4ff","Name":"Jacob Impson","Tagline":"Senior Front End Developer at Berlitz Corporation","Bio":"Jacob works as a Senior Front End Developer at Berlitz Corporation where he focuses on React and Design Systems. While not coding he loves to make music and hunt for the highest quality tofu donburi. ","ProfilePhotoUrl":"https://sessionize.com/image?f=ac352d465e26c2fb950b81d3208adedc,400,400,True,False,767234ba-bb3c-4ce9-a47c-78d87e86ad2b.jpg","TwitterHandle":"jacobimpson","WebsiteUrl":"https://www.jacobimpson.com/"}]},{"Id":"5aba6e83-cfd9-4114-af80-f28de931d8c2","Title":"Finding a Needle in a Call Stack - Intro to Distributed Tracing","Abstract":"Microservices have transformed the way we think about software architecture and design. They enable developers to rapidly extend application functionality in the form of additional services, each of which can be scaled and deployed independently. Many highly successful software companies such as Netflix, Amazon, and Airbnb, have thousands of interconnected services which form the foundation of their products. These services often communicate over HTTP - passing messages between each other, synchronously and asynchronously, sometimes via message queues or brokers. \r\n\r\nOf course, none of the benefits of microservices come without a cost. Networks are unreliable, and correlating thousands or millions of log entries between services can quickly become unmanageable. Therefore, understanding the source of an issue can be like finding a needle in a haystack. This is where distributed tracing comes in! Distributed tracing is the process of tracking requests through their lifetime within a complex distributed system, and has become a critical tool for debugging and understanding microservices.\r\n\r\nIn this session we will explore the basics of distributed tracing. We'll then take a look at the OpenTelemetry (formally OpenTracing) standard - a vendor neutral framework for distributed tracing instrumentation. Finally, we'll take a hands-on look at distributed tracing in action using Jaeger, a popular open source distributed tracing tool which is part of the Cloud Native Computing Foundation. By the end of this session I hope you will not only have a good understanding of distributed tracing, but will be equipped with the knowledge and inspiration to introduce it within your own applications.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Backend Development","Microservices","Tooling"],"Presenters":[{"Id":"786c1488-5184-4e18-be44-87bf2ab9ba60","Name":"Josh Michielsen","Tagline":"Creating a Global Platform at Condé Nast International","Bio":"Josh Michielsen is a software engineer, hobbyist data scientist, photographer, cyclist, and doge owner living in Cambridge, UK. He specialises in container orchestration, software development, continuous delivery, and cloud operations. He currently works as a Senior Software Engineer for the Cloud Platform team at Condé Nast International, where he helps to drive the vision of a truly global platform to house the worlds largest online publications, including Vogue, GQ, Wired, and Vanity Fair!","ProfilePhotoUrl":"https://sessionize.com/image?f=2c6a2a04c0d94393184d412234e91be8,400,400,True,False,67-c5b5-457c-99b2-da10c6a94475.f296fc45-77bb-42d0-ba5a-e9c8788abcbd.jpg","TwitterHandle":"jmickey_","WebsiteUrl":"https://mickey.dev"}]},{"Id":"6d6553c0-b678-434d-b94e-c46fe77c86eb","Title":"Forget your passwords with the Web Authentication API","Abstract":"Passwords are hard. Data breaches frequently expose poor security practices, proving that, as an industry, we're not very good at this. As developers have become more aware of these challenges, we've tried to offload password management to \"the big guns\", making our lives easier, but what about our users? From confusing or ineffective password complexity restrictions to password fields you can't paste into, it's no wonder so many people find one password and stick with it.\r\n\r\nThe Web Authentication API (WebAuthn) allows you to build passwordless authentication or two factor authentication into your web applications seamlessly in the browser. Using an asymmetric key pair where the public key is sent to a server, and the private key stored securely on your device, your secrets are never sent over the internet, greatly reducing the risk of phishing attempts.\r\n\r\nThis talk will provide an introduction to WebAuthn, outlining the benefits, tradeoffs, and future of this new authentication protocol. Through a code demonstration, you will see how to build an experience that puts control over their credentials (literally) back into the hands of your users.","Format":"45 mins","Level":"No experience necessary","Tags":["Frontend Development","Web","Security"],"Presenters":[{"Id":"88a6e76d-7051-4f1c-a057-71fd76edf249","Name":"Ben Lowry","Tagline":"Developer at Readify","Bio":"Ben has spent the last couple of years writing a whole bunch more TypeScript and a little less C# than he expected. Currently working at Readify, Ben gets the chance to work with teams all over the place, and is excited to meet all of you!","ProfilePhotoUrl":"https://sessionize.com/image?f=f301e519b0a5f3e6a3b990d363b49196,400,400,True,False,42-e77c-413a-9e7f-f085c03ad9dd.8e334bab-5878-4fe1-a526-979202ae16d1.jpg","TwitterHandle":"benjaminlowry","WebsiteUrl":null}]},{"Id":"ae58057e-2cea-4300-bdb7-f51d57476179","Title":"Fun with Sensors and APIs for the web!","Abstract":"Developments in Sensor & Browser Apis has opened up many opportunities for your website to react and respond based on the users device, environment or input. As of right now there are many great Sensor & Browser APIs that you can take advantage of including Light Sensors, Gyroscopes and Audio and because these APIs are all available in more devices than you would think they are more accessible than ever.\r\n\r\nIn this presentation we’ll talk through the possibilities, tools and resources as well as exploring some of my favourite features so you can get started creating engaging and creative effects, visualisations and experiences in your projects tomorrow.","Format":"20 mins","Level":"No experience necessary","Tags":["Frontend Development","Web","APIs"],"Presenters":[{"Id":"ba836d06-2b0c-4b28-a020-72e837ea4854","Name":"Mandy Michael","Tagline":" Front End Developer, Dev Manager | Founder & Organiser @fendersperth | Organiser @mixinconf ","Bio":"Mandy is a community organiser, speaker, and developer working as a Development Manager at Seven West Media in Western Australia. She is a co-organiser and Director of Mixin Conf (http://mixinconf.com/), and the founder and co-organiser of Fenders (http://www.fenders.co), a local meetup for front end developers providing events, mentoring and support to the Perth web community.\r\n\r\nMandy’s passion is CSS, HTML and JS, she has a particular interest in web typography, accessibility and modern layouts, and hopes to inspire that passion in others. Mandy loves the supportive and collaborative nature of the web, her aim is to create a community of web developers who can share, mentor, learn and grow together.","ProfilePhotoUrl":"https://sessionize.com/image?f=b0467f54c5cc72456aa09f2fecd027cd,400,400,True,False,c5-0ab8-440d-8899-9665c3ad6d78.7c29362d-8adb-413c-8a8d-ebf86f99c8f9.jpg","TwitterHandle":"http://twitter.com/mandy_kerr","WebsiteUrl":null}]},{"Id":"f8967843-c437-4a90-9242-fac45c4ea1a6","Title":"GraphQL, gRPC or REST? Resolving the API Developer's Dilemma","Abstract":"GraphQL, gRPC, REST and WebHooks are among a bewildering array of technologies and architectural styles that are available to API developers today. Presented with such myriad options, how can we be confident of making an appropriate decision for the problem at hand? In search of guidance, developers often turn to online communities. This can exacerbate the problem as discussions about API styles often descend into statements about the superiority of one approach over another being presented as universal truths. Such comments invariably earn emotive rebuttals that also lack sufficient nuance. The result of such exchanges is increased confusion and uncertainty. Join me on a tour of these API styles where we will cut through this noise, demonstrate where each style shines (plus where they don't!) and ultimately resolve this dilemma of choice.\r\n\r\nIn this session we'll take an in-depth look at API design; the best practices that have evolved; the game changing supporting technologies that are now available including HTTP/2; and most importantly what you need to do to deliver a world class developer experience:\r\n\r\n- How to determine the suitability of an API style for your application context. Don't be a victim of technology hype!\r\n- What is required to support graceful evolution of the API contract including the potential implications of both Hyrum's Law and the Law of Implicit Interfaces\r\n- Understand the supporting toolchains and technologies that dovetail with each API style.\r\n- The importance of treating your API as a product with an unwavering focus on improving the ease of consumption for your clients.\r\n\r\nBy the end of the session, you will not only understand the concepts underpinning these various API styles but also have the knowledge to put them into practice. If you want to take to your API design expertise to the next level, then this is the session for you. See you there!","Format":"45 mins","Level":"Mostly intermediate","Tags":["Backend Development","APIs","Architecture"],"Presenters":[{"Id":"9b917d43-896c-4b21-a5c9-5da683c7a60b","Name":"Rob Crowley","Tagline":"Principal Consultant @ Readify","Bio":"Rob is a software consultant, developer and team lead with a passion for delivering systems that perform at scale. Rob has over 15 years of experience building distributed systems on the web stack and has read more RFCs than he cares to admit. Rob is an active member of the Perth IT community and regularly shares his ideas at various Meetups and conferences around Australia and internationally. He is also a co-organiser of DDD Perth, the largest IT conference in Western Australia.","ProfilePhotoUrl":"https://sessionize.com/image?f=786e3fbb5d5ef29d082c5061b05ec7e8,400,400,True,False,57-1142-4eb0-9b08-719c3d875bf8.b26f935d-593e-4798-a41b-d1453e1e0b85.png","TwitterHandle":"robdcrowley","WebsiteUrl":null}]},{"Id":"2fff2f0e-7f55-4a26-bf15-7537a6c3f700","Title":"How do you apply Agile on a solo project?","Abstract":"Have you ever been in a situation where you had to develop alone? Have you started a side project and didn't go well? Agile methodologies always talk about teams and how to get the best out of the project based on different ceremonies and the interaction between teams. It rarely mentions what you should do when you are on a solo gig. Could applying agile practices save the project? Could you apply agile while you are working in a solo capacity?\r\n\r\nDuring my journey, I share the pain with you and I have been in the same situation many times. I have started many side-projects and worked on many solo projects. It wasn't easy to apply Agile and focus on delivery. Yet, while focusing on success, I found my way to Agilify my solo gigs and discovered why my side-projects were not successful. Through many gigs and amplifying the feedback, I have managed to \"Agilify\" any one-person show project and it helped me delivering better and faster with great success.\r\n\r\nBy the end of the session, you will have the hard-learned lessons as takeaways which make your solo or side project much easier and more fun from now on. Despite not being an Agile coach, I'm a developer with the right experience who could tell you how to Agilify any solo-project. I will share with you my way of applying Agile on your solo project and backed by some scars from the field.","Format":"45 mins","Level":"No experience necessary","Tags":["Soft Skills","Agile","Teams"],"Presenters":[{"Id":"c2980278-fb86-4431-b0ee-3adc04a83a6d","Name":"Mo Zaatar","Tagline":"Senior Consultant - Readify","Bio":"Mohamed (Mo) is an energetic software engineer who is enthusiastic about technology for over 13 years. He is a “Logician” who likes the big picture first and looking continuous improvement. He believe in continuous learning, passionate about sharing knowledge and giving back the community that’s why he joined DDD WA Inc. \r\n\r\nOn his free time, he enjoys learning new tech and maintaining his car. He is a full time Senior consultant at Readify, full time husband, servant leader of his teammates, half mechanic, a semi-lucky fisher and an untalented cook.","ProfilePhotoUrl":"https://sessionize.com/image?f=f5e653ba8dc6c768c7b38cae358cf0c9,400,400,True,False,3b-5650-4419-89b1-979dec82d1bb.c16466e0-32d0-4826-b346-1fc1a800e0c8.png","TwitterHandle":"Https://twitter.com/mzaatar","WebsiteUrl":"https://au.linkedin.com/in/mzaatar"}]},{"Id":"adbcf783-1ab2-456b-ba41-1041f139e3f2","Title":"How to define a chatbot personality","Abstract":"Chatbots have a voice, so they need a personality because even if one isn't defined, users will assume one.  In this talk I will cover some methods to define and build chatbot personalities that are more relatable, believable and relevant to users and represent your brand appropriately.","Format":"20 mins","Level":"No experience necessary","Tags":["Design and UX","Chatbots","UX"],"Presenters":[{"Id":"f8245dfa-f6d4-4abc-88f2-f7b741a12c15","Name":"Marieke Lunel","Tagline":"User Experience Designer","Bio":"I work as a User Experience Designer at an IT consultancy. My favourite aspect of working in tech, is that it's an ever-expansive industry that allows for constant learning, innovation and problem solving.","ProfilePhotoUrl":"https://sessionize.com/image?f=a993f5dd2ff4afa5b04eb85795de1024,400,400,True,False,20-f3b6-484f-8efa-7511930612a3.45a1436f-ce0b-4785-b140-af0714df1f00.jpeg","TwitterHandle":"MieksiRose","WebsiteUrl":"https://www.linkedin.com/in/mariekevl/"}]},{"Id":"94a2f4b3-bd6e-4eb6-9917-baa3bcb3d41f","Title":"How to Raise a Robot Army over #100DaysofCode","Abstract":"A pythonic introduction to building bots when you are starting from *scratch*.  In this talk we'll look at how they work, what they can be used for, and see some demo's to play with.\r\n\r\nImagine you have a 100 days and your only directive is that you **must** spend at least an hour a day in the code. Could you build an army of bots and take over the world?\r\n \r\nRecently I've taken part in the #100DaysOfCode Challenge, which is designed to help beginners get started with meaningful and fun activities, even when they have no previous knowledge.\r\n \r\nTogether we'll cover the basics of bot building and go under the hood to look at the code and the basic architecture that holds it together. We'll examine some of the bots you can build and by the end of the session you'll be able to start building your own robot minions.\r\n","Format":"45 mins","Level":"No experience necessary","Tags":["Backend Development","Chatbots","Artificial Intelligence"],"Presenters":[{"Id":"f74543ea-f9c1-445e-b504-0f5ee5ec07a6","Name":"Michelle @ Microsoft","Tagline":"Surfs waves and webs. Level's up outside the (X)box. Keeps one jump ahead of the game(boy).","Bio":"Tedx Speaker, Tech Girl Superhero, Microsoftie and one of MCV's 30 Most Influential Women in Games. I am a Technology Evangelist who acts as an API between technology and the world. I advocate for STEM, the Games Industry and Developers. I present at around 50 Conferences and Events around the world on Technology, Social Media, Inclusion and Gaming.","ProfilePhotoUrl":"https://sessionize.com/image?f=115abc10207ae62ad91cbcafbffb73b0,400,400,True,False,65-6d4a-402e-afe6-03af233c30eb.3eb9b265-dec2-42ed-8af7-612eaa5d2e1c.jpg","TwitterHandle":"msandfor","WebsiteUrl":"https://www.linkedin.com/in/michellesandford/detail/recent-activity/posts/"}]},{"Id":"83b6a640-935b-4e5e-b251-81c3d69c0129","Title":"How to survive the stakeholder battle for features","Abstract":"Imagine you're tasked with building a website for a large organisation that has many different products, services and customer types.  Over 100 stakeholders have been identified, many of whom have their own unique KPIs, goals, and personal agendas. How can you prioritise all the required features and content while still gaining acceptance and buy-in from all 100+ stakeholders?  \r\nIn this session, I will share a stakeholder engagement technique and a feature prioritisation tool that we have used successfully on several large projects at various organisations.","Format":"20 mins","Level":"No experience necessary","Tags":["Design and UX","Design","Agile"],"Presenters":[{"Id":"94fa2dce-1143-44b9-bbbf-61bc40d9100c","Name":"Trent Cain","Tagline":"Design Capability Lead - Insight","Bio":"I am an Experience Designer with background in software engineering.  I have 14 years professional experience in many aspects of software design and development.  I am passionate about inducing great experiences through elegant and intuitive design.  I believe great design comes from engaging and testing with users as early and as often as possible.  Similarly, I believe a design is never finished, but we must release it in order to learn from it and then, we can continue to improve on it. ","ProfilePhotoUrl":"https://sessionize.com/image?f=7a80b0c391a6b42ddeff714dc2930165,400,400,True,False,9b-c8ac-402b-8402-c561db06fb75.828a7bdf-e21d-4d63-a667-aec82065071d.jpg","TwitterHandle":"trentdcain","WebsiteUrl":"https://www.linkedin.com/in/trentcain/"}]},{"Id":"f548e402-d04d-4318-a8c6-d879b3f11d37","Title":"Hypothesis-Driven Development: Why you need online controlled experiments to scale","Abstract":"Simply put, hypothesis-driven development (HDD) is the process of stating the desired impact of a new product feature, and then measuring the actual impact of that feature on real users, often using online controlled experiments, commonly called A/B tests.  \r\n\r\nIn a world where the opinions of even expert product and UX people is wrong as often as it is right, the HDD approach to product development is important for consumer-facing businesses of any size. \r\n\r\nBut we'll make the case that as a consumer-facing online business scales to thousands of daily-active-users, HDD combined with extensive A/B testing becomes absolutely crucial in growing a business to the next level.","Format":"45 mins","Level":"No experience necessary","Tags":["Data & Analytics","Design","Testing"],"Presenters":[{"Id":"b77495c6-85ab-4543-b3c0-39f0d3a2037c","Name":"Tommy O'Dell","Tagline":"VP of Data and Analytics @ VGW","Bio":"Tommy is a Canadian expat who moved to WA in 2007 to work in the booming mining industry. Soon after that, he decided to pursue his budding passion for analytics, data visualisation, statistics, data science and machine learning by founding the Perth Data Science meetup and completing a Master's Degree in Statistics, back when few people had heard of data science. In the last three years, as the VP of Data and Analytics at VGW, he's built a talented and cross-functional team of analysts, data scientists and data/machine learning engineers.","ProfilePhotoUrl":"https://sessionize.com/image?f=6b59e0d96e601f54d486817decbf1918,400,400,True,False,74-a7e0-438e-98b0-ed1fdc4351be.f058a9e3-095f-4b19-b65e-5907f1bafdb0.jpg","TwitterHandle":null,"WebsiteUrl":null}]},{"Id":"80721e7b-b082-4b50-9a9d-136d3054b7b0","Title":"Is it done yet?  (How about now?)","Abstract":"No matter how utopian your agile working environment, if you're building a commercial product, at some stage you will be asked the inevitable question - When will it be done? This talk will provide you with tools and techniques to use when you hear your manager say \"We just need to get better at estimating\".  (Spoiler alert: that's not the answer)  If you have ever wished for a crystal ball to help you predict the team's future, this talk is for you!","Format":"45 mins","Level":"No experience necessary","Tags":["Soft Skills","Agile","Teams"],"Presenters":[{"Id":"43b68922-273f-4643-88bc-12492716d494","Name":"Michele Playfair","Tagline":"Executive Director, YOW","Bio":"Michele is a consummate software development generalist, having successfully performed in roles ranging from pre-sales and business analysis, through design, development and testing, to training/coaching and production support. She is also a qualified high school I.T. teacher. Having cut her teeth as a consultant on large scale retail banking implementations for major US and NZ banks, and then working within Agile product development environments, these days Michele is focused on continuous improvement through education. She gets excited about learning, teaching and using collaboration for the greater good.","ProfilePhotoUrl":"https://sessionize.com/image?f=f965a14406c8e4a6206454dff611b705,400,400,True,False,43-7a30-4307-8a40-a1b26d7195c7.9489e49c-26de-410e-9258-e88aa41bacbe.jpg","TwitterHandle":"MichelePlayfair","WebsiteUrl":"https://www.linkedin.com/in/micheleplayfair/"}]},{"Id":"c044309e-e859-4b5c-adad-7534a36284e0","Title":"Is VR going to be a “Thing” for UX Design?","Abstract":"\r\n\"This talk is about the lessons that UX and UI designers can learn from the long and troubled history of Virtual and Augmented Reality. It discusses the current hype vs reality of the VR/AR market, and considers the social, technological and economic factors that will make VR/AR implementations a part of a mainstream UX/UI designer's daily work within 10 years. Will you be ready?\"","Format":"20 mins","Level":"No experience necessary","Tags":["Design and UX","Augmented/Virtual Reality"],"Presenters":[{"Id":"759dde03-1a80-494f-b52a-1197b5d16c0b","Name":"Andrew Hutchison","Tagline":"UX Designer","Bio":"Andrew is a User Experience Designer, with particular strengths in research, education, instructional design, and working with interdisciplinary teams.","ProfilePhotoUrl":"https://sessionize.com/image?f=7b7019d852b45f468094f2039e7aa67e,400,400,True,False,a2-97b7-4b4c-bdc3-b1b95f5cad85.8a8baa60-3367-4203-a386-04d555807572.jpg","TwitterHandle":null,"WebsiteUrl":null}]},{"Id":"00311b92-6c21-47a8-b8d2-af325581d6f9","Title":"JavaScript and AI, no you're not dreaming","Abstract":"Like fire which was stolen from Mudhens, Artificial Intelligence has been kept away from front end developers for ages.\r\n\r\nHowever, things has changed and doing AI is as easy as installing a npm package. That's why I've decided to open your mind to what's possible today and a few examples which can even be executed in the browser.\r\n\r\nYou don't need to have any background in AI or Maths, just a curious mind and a willingness to try.","Format":"45 mins","Level":"Mostly intermediate","Tags":["Frontend Development","Machine Learning","Artificial Intelligence"],"Presenters":[{"Id":"f6407cdc-f1e5-4543-a212-12cbd5be2885","Name":"Yaser Adel Mehraban","Tagline":"Lead front end engineer, speaker, technologist, blogger, almond croissant addict, nut not in that order.","Bio":"Although it doesn’t look like it, Yaser is an almond croissant addict cleverly disguised as a successful web developer. Since it was relatively clear early on that it would be slightly more than difficult to make a living out of thin air and sitting in a café eating a croissant and drinking a cappuccino, he’s focused his energy on the web, which happily has proven itself to be a wonderful decision.\r\n\r\nApart from that, he has a hunger for public speaking, hence a number of talks in big conferences like NDC and Voxxed Days around the world under his belt.","ProfilePhotoUrl":"https://sessionize.com/image?f=5bd833f0c324a5370b018621c70530bd,400,400,True,False,24-82ac-42df-8761-ecb106c8ef61.1a2e96ca-6232-431a-b552-9b8eb518416c.jpg","TwitterHandle":"yashints","WebsiteUrl":"https://mehraban.com.au/"}]},{"Id":"35e1174f-8d50-48db-a410-d53c3c8ddf73","Title":"Kubernetes vs. Serverless - The Great Cloud Native Debate","Abstract":"How do you pick your platform for development in 2019? Using real-world examples taken from projects all over Perth, together we'll build a framework for comparing the merits of a Kubernetes vs. Serverless approach.\r\n\r\nWe'll cover aspects such as:\r\n- Security\r\n- Cost\r\n- Performance\r\n- Learning Curve\r\n- Development Experience\r\n- Operations","Format":"45 mins","Level":"No experience necessary","Tags":["Cloud","Containers","Serverless"],"Presenters":[{"Id":"b9641b37-fb0d-4531-abe0-e5a712391824","Name":"Josh Armitage","Tagline":"Cap","Bio":"Known as the tall one in Mechanical Rock with glorious hair, I've worked across Perth in a variety of companies, from early stage startups to giant corporations, covering roles such as operations, development and architecture. Nowadays I work for Mechanical Rock spreading the gospel of DevOps across Perth.","ProfilePhotoUrl":"https://sessionize.com/image?f=fb999705140052a2ed3a4be83bbfeba0,400,400,True,False,b4-e848-4262-b194-694bc575a0b5.58348be7-02df-41c9-9b52-0be580e64aa9.jpg","TwitterHandle":null,"WebsiteUrl":null}]},{"Id":"24ad37da-2c0b-4f5c-afde-3266217e6d80","Title":"Lost in Space: Risk, Reward and Women-in-Tech","Abstract":"Launching sideways from Animation into the rapidly expanding Tech Cosmos has been the best adventure of my life. I’ve found my people, my niche and I’ve never felt more connected.\r\n\r\nBut looking all around, this little rocket ship is not yet convinced it will be an entirely smooth-sailing journey...\r\n\r\nWhether you’re a Femme, Fabio or Face-Hugger brace yourself for a light-speed journey through the ins and outs of deciding to become a 'Woman in Tech'.\r\n\r\nIncluding learning to:\r\n-\tBurn the right Brain Fuel\r\n-\tDodge the ‘Black Hole of Burnout’\r\n-\tIdentify Aliens and Imposters\r\n-\tBuild a strong Ship Maintenance Crew\r\n-\tAnd convince the Mother Ship to keep course… no matter what it takes.\r\n\r\nI don’t have all the answers for creating a toolkit to increase diversity in tech. But I sure do have a damn good metaphor, decision-making trees, risk-calculating kittens, and plenty of space cake.\r\n\r\nSo, sit back, relax and discover why I choose to #BeHer, even if I can’t always #SeeHer.\r\n\r\n","Format":"20 mins","Level":"No experience necessary","Tags":["Soft Skills","Career"],"Presenters":[{"Id":"b4ffd60a-0ea8-4e85-810e-4d5aec66d1b3","Name":"Caitlin Bathgate","Tagline":"Digital Design, Communications, Systematic Organiser and Girls Coding Mentor.","Bio":"Bringing creativity, design skills and infectious enthusiasm to local tech, social impact and education spaces around WA.\r\n\r\n#womenintech #girlswhocode\r\n","ProfilePhotoUrl":"https://sessionize.com/image?f=a0027c4a7aef5ab355de8ec93ec95eef,400,400,True,False,a7-dab3-461f-a5a4-ef21571b602b.61c7a7a7-d4ea-42b1-9740-26436878c95e.jpg","TwitterHandle":null,"WebsiteUrl":"https://www.linkedin.com/in/caitlinbathgate/"}]},{"Id":"8cd14aaa-89cb-4886-9649-ceb0cd4b27d1","Title":"Machine Learning with .NET (for Non-Data-Scientists)","Abstract":"Machine Learning has for many years has lived in two extremes: Calling APIs to see if the cloud can recognise your dog pictures, or hiring lots of Data Scientists to crunch maths that you thought you'd put away for good a long time ago! What if I told you there was a middle ground?\r\n\r\nIn this demo-heavy session I'll talk about ML.NET and show you how you can apply your own engineering and coding expertise to to build interesting ML solutions - without bribing a data scientist to do all the work for you.","Format":"20 mins","Level":"Mostly intermediate","Tags":["Data & Analytics","Machine Learning","Tooling"],"Presenters":[{"Id":"1a9fa16a-866a-45b4-85e6-a4ac7c655268","Name":"Ryan Preece","Tagline":"Senior Consultant / Troublemaker","Bio":"Ryan has been building stuff with code for over 10 years, and has spent most of the last five of them with Readify in Melbourne. He's mostly a .NET tragic with a bit of everything else mixed in - and he's never met anything he couldn't automate. ","ProfilePhotoUrl":"https://sessionize.com/image?f=ea00130f4df05042c6e10b206c4d5c35,400,400,True,False,64-788b-42c1-9c10-1a268170838e.690816e4-47cb-4ba6-8261-905fa356d202.jpg","TwitterHandle":"Preecington","WebsiteUrl":"https://preece.dev"}]},{"Id":"97792db7-0c73-4fee-91c3-00d7fe002540","Title":"Mobile App Development - Crossing the platforms, dotting the notation","Abstract":"Mobile app development has come a long way since it first burst onto the scene. In this talk we’ll look at the lay of the land, focussing largely on the current landscape and the tools which are available to the modern mobile developer.\r\n\r\nAs developers we currently have many different routes to realise our applications on mobile devices. From native languages, cross platform development tools such as React Native and the new “app like”, Progressive Web Apps.  We’ll delve into exactly what these differing platforms are, their strengths and weaknesses and in which circumstances each may be appropriate to use.","Format":"20 mins","Level":"No experience necessary","Tags":["Frontend Development","Mobile"],"Presenters":[{"Id":"3b4ab42e-02f9-4c74-9729-47ed14422e48","Name":"Dave Cumming","Tagline":"Adapptor Developer","Bio":"Originally from Scotland, I moved to Perth 4 years ago to enjoy the much sunnier climate!  Having worked in a variety of programming roles across a wide breadth of industries for nearly 20 years, I finally fell into mobile development in 2011 and never looked back.  I currently work at Adapptor in the Perth CBD who are a mobile focussed development team who I've been with for a year and a half.  ","ProfilePhotoUrl":"https://sessionize.com/image?f=b0f375b973b8d5bf432b9cf4c5a81d8d,400,400,True,False,b7-be30-4b01-8d6a-72ef7bdeb594.bcac6689-a7a2-4dff-af13-95aba508437b.jpg","TwitterHandle":null,"WebsiteUrl":"https://medium.com/adapptor"}]},{"Id":"cea40511-0eeb-4ac8-8c1e-098a966f7314","Title":"NLP for fun & business - AI at your fingertips","Abstract":"Do you want to know what is the connection between customer service, Game of Thrones and AI so powerful that it was forbidden from being released to the public?\r\n\r\nNatural Language Processing (NLP) is the art of extracting information from unstructured text and it’s one of the most exciting branches of AI. Written data is ubiquitous  and making sense of it has become a superpower. We want to invite you to join in the fun.\r\n \r\nIn this talk we’ll explore the main building blocks of natural language processing algorithms, and show a practical example of how topic modelling can be used to better understand your customers, and the benefits of its use. \r\n\r\nYou will walk out with the main ingredients to dive into the NLP world and a clear business use, you can put into action. \r\n","Format":"45 mins","Level":"No experience necessary","Tags":["Data & Analytics","Machine Learning","Artificial Intelligence"],"Presenters":[{"Id":"d43e32ce-eefb-40a6-a635-15a227104f71","Name":"Diana MozoAnderson","Tagline":"VGW, Marketing Science Lead","Bio":"I'm passionate about Marketing  & Data Science,  live & breath it, I'm pursuing a Master in Data Science, and lead the Marketing Science Team at VGW.\r\n\r\nI have been living in Western Australia for the last 9 years, and love the relaxed - beach live style.","ProfilePhotoUrl":"https://sessionize.com/image?f=520bcccc8cde8a2d3183f2b03f49fb82,400,400,True,False,af-e3bb-49f1-be54-4a0f76fddb02.430b6992-0a3d-4c7d-be48-d0a8e36ff655.jpg","TwitterHandle":null,"WebsiteUrl":"https://www.linkedin.com/feed/?trk=nav_back_to_linkedin"},{"Id":"dcbe0bfe-d22c-4427-b43b-a2d13d2f2adc","Name":"Denis Lapchev","Tagline":"VGW, Data Scientist","Bio":"Denis transitioned into data science from multidisciplinary engineering R&D background. Currently leading core data science team within VGW.","ProfilePhotoUrl":"https://sessionize.com/image?f=0f1f7e795a63be06cc764229fc8d6139,400,400,True,False,a9-acfc-406b-aed1-d359efe33acf.5057902d-215c-48fa-a578-ea01d151df82.png","TwitterHandle":null,"WebsiteUrl":"https://www.linkedin.com/in/dlapchev/"}]},{"Id":"2fcea05c-96dc-4802-b8a9-14bcfee01a64","Title":"Putting the fast in Fast.Ai - Machine Learning models in 15 mins","Abstract":"Machine learning is enabling computers to learn things which are not explicitly programmable. It’s complex – involving equivalent amounts of maths and computer science. It’s daunting and often hard to figure out where to start. Fast.Ai was created with the aim of helping developers and non-technical SME’s build their own machine learning models. It provides a top-down approach which abstracts away the need for elaborate coding and complex theoretical concepts. Join me in an end to end demonstration of how to create a 95% accurate image classification model from scratch, using the Fast.Ai library. An ideal introduction to testing the waters in machine learning. ","Format":"20 mins","Level":"Mostly intermediate","Tags":["Data & Analytics","Machine Learning","Artificial Intelligence"],"Presenters":[{"Id":"c22be45b-8310-438f-8def-944b7230b403","Name":"Akanksha Malik","Tagline":"Graduate Data Scientist, Readify","Bio":"Akanksha is a graduate Data Scientist at Readify learning all things data. She graduated from University College Cork, Ireland in 2018 with a degree in BSc Financial Maths and Actuarial Science. She is an advocate for women in STEM and is currently a co-organiser of Women Who Code Melbourne.\r\n","ProfilePhotoUrl":"https://sessionize.com/image?f=d17479de99e1a4fffe00fe864bb4369c,400,400,True,False,1c-6caf-48d7-ac42-ae5ab2d442ca.db93a5b0-8f77-475e-be57-ad3e04dafd46.jpg","TwitterHandle":"akankshamalik96","WebsiteUrl":"https://www.linkedin.com/in/akankshamalik96/"}]},{"Id":"b2795175-d14d-4090-a62e-153d4534b916","Title":"Quantum Computing 101: A gentle introduction to the world of quantum computing!","Abstract":"What is all this talk about quantum computers and quantum computing?  Will I have to learn a new programming language?  What does it mean for our enterprise apps?  Our startup?  My games?  My job?\r\n\r\nQuantum computing is a fascinating topic that will change the world of computing and, probably, even our world.  It can be technical but don’t worry, we will make it easy to understand what you need to know.  \r\n\r\nThis talk will give a clear and simple introduction to quantum computing and explain the current state of play, services that are currently available, and what we can expect in the future, e.g. how it will affect IT jobs.\r\n\r\nIt’s all from a developer’s perspective and for developers but it will be understandable by anyone interested.  \r\n\r\nWith an Honours Degree in Theoretical Physics, a PhD in Computer Science and Software Engineering, and many years experience in IS an IT, I have the knowledge to be able to bridge the gap between the physics, computing, and software to help you understand Quantum Computing. ","Format":"45 mins","Level":"No experience necessary","Tags":["Backend Development","Architecture","Coding"],"Presenters":[{"Id":"c6f0950f-dbf2-4a9c-a667-c78f9cd99f26","Name":"Ashley Aitken","Tagline":"Entrepreneur, developer, academic and professional trainer!","Bio":"Ashley is a software developer, entrepreneur, academic and professional trainer.  \r\n\r\nHe has a PhD in Computer Science and Software Engineering from UNSW and 25 years experience in the IT industry.  For his startup he's using a very distributed microservices architecture with CQRS/ES on the backend, written in Scala and quite functionally-oriented, and React/JavaScript for multiple frontend SPAs.  It's deployed within Docker containers and using Docker Swarm.\r\n\r\nHe has delivered training courses around Australia, across SE Asia and in the US and UK for multi-national computer companies like Apple, IBM, HP and others, including CBA and Woodside Energy.  He has won awards and recognition from the ICT industry, academia, the federal government, and the student community for the quality and excellence of his teaching and professional training.  \r\n\r\nHe is the co-founder of Acavista, an edtech startup, and principal for Innovately.com.au, which helps with the application of Lean Startup and Customer Development principles and practices to the commercialisation of innovation in organisations from any sector, of any size, and at any level of maturity (not just startups).  He graduated from the Founder Institute and Curtin Accelerate startup accelerators.  ","ProfilePhotoUrl":"https://sessionize.com/image?f=c2a00a20bff42880f816a407f9fe5928,400,400,True,False,c1-1bdd-4ee5-9a6a-a4ed88af7265.5482f6a3-7281-44a6-b26f-2b302cc146c4.jpg","TwitterHandle":"ashleyaitken","WebsiteUrl":"https://www.linkedin.com/in/ashleyaitken/"}]},{"Id":"a577e148-b1d7-42e1-a424-5d0db3107ae2","Title":"The Dark Side of Agile: Burnout and You","Abstract":"Have you ever experienced a time where overwhelming expectations have led to extreme stress that has  impacted your health and well-being? Burnout and work-related stress is becoming all too prevalent in our industry. This, coupled with an unfortunate stigma around the topic, is having a detrimental impact on our overall well-being. The complexities of people and technology are making it increasingly difficult to estimate and frame projects in a true agile sense, consequently contributing to the increase of burnout in our industry.\r\n \r\nThis presentation will focus purely on solutions that are specific to burnout. Key solutions being; managing work-life balance, coupled with the ability to identify early indicators for yourself and those around you.  If we equip ourselves with knowledge of burnout, can we remove the stigma around it so that people can call it out early and feel safe to do so?","Format":"20 mins","Level":"Mostly intermediate","Tags":["Soft Skills","Career"],"Presenters":[{"Id":"c605cad0-1711-4efc-9979-3151ef8873c9","Name":"Siobhan Avenell","Tagline":"People & Culture Partner @ Readify WA & SA ","Bio":"Siobhan has specialised in People and Culture based roles within the software community for over a decade. With a love of learning, she is currently finishing her Masters of Human Resources Management and hopes to share her knowledge and passion for creating best place to work cultures.  ","ProfilePhotoUrl":"https://sessionize.com/image?f=e875e8440655d0922223a7ed505ffd76,400,400,True,False,45-ab9b-49b6-9b78-d78075f7a594.f2ac21df-f96f-4529-84cc-42e02b072c73.jpg","TwitterHandle":"siobhanavenell","WebsiteUrl":"https://www.linkedin.com/in/siobhan-avenell-0095852b"}]},{"Id":"cc740103-612c-4673-b293-97487787f093","Title":"What Chickens and Submarines Can Teach You About Teams","Abstract":"Many people believe that having the smartest people makes the best teams. Logically, it makes sense as the best people will enable you to do great things. But what if that wasn't the case? What if there was something else that makes up great teams?\r\n\r\nDuring my career, I have been on projects surrounded by smart people, yet our achievements were mediocre. I have also been on teams with average people and we were a raving success! How could that be? What were we missing that made some teams so wildly successful, yet others were average? It was those questions that made me embark on my leadership journey to try and discover the secret to successful teams.\r\n\r\nIn this talk, we'll discuss what chickens and submarines can teach you about creating great teams. We'll go through some approaches you can take, some hard truths that we learnt along the way and lastly you will get some first-hand experiences from the trenches.","Format":"20 mins","Level":"No experience necessary","Tags":["Soft Skills","Teams","Leadership"],"Presenters":[{"Id":"30620f36-9e7d-45a7-8cc3-236665fb4b77","Name":"Mauro Da Silva","Tagline":"Senior Consultant as Readify","Bio":"Mauro is a passionate software developer with a keen interest in leadership. He has been in the industry for over 13 years and has loved tinkering on the PC from the early age of 3 years old with his earliest memories being those of playing Dig Dug and Donkey Kong on his dad's IBM XT 286 PC. He is continuously striving to learn, grow and improve in not only in his technical skills but his soft skills as well. \r\n\r\nIn his free time, Mauro enjoys playing board games and playing some games on the Xbox with his kids. ","ProfilePhotoUrl":"https://sessionize.com/image?f=a3c0911be7a6b0152ba3df57d71ff166,400,400,True,False,f5-445d-4cba-a188-345dcf13c0e7.7f934ebc-b21c-4db4-a3cb-470e0a447c6b.jpg","TwitterHandle":"mauro_dasilva","WebsiteUrl":"https://www.learningapprentice.com/"}]},{"Id":"4c019f6f-c312-4bb9-8024-3352f6034d6e","Title":"You. Are. Awesome.","Abstract":"You may not realize it, but you are awesome. You have the power to change the world. Regardless of your job title or amount of experience, I firmly believe you have amazing potential to impact the people around you in powerful and meaningful ways. My goal is to help you realize the awesomeness you already possess and be encouraged to unleash it!","Format":"45 mins","Level":"No experience necessary","Tags":["Soft Skills","Leadership","Teams"],"Presenters":[{"Id":"aa61fde1-dee9-45d4-b812-5110ba3b1cb9","Name":"David Neal","Tagline":"Ambassador of Awesome","Bio":"David is a family man, software developer, musician, illustrator, and Microsoft MVP living in North Georgia, USA. He is currently a Senior Developer Advocate for Okta. David runs on a high-octane mixture of caffeine and JavaScript, and is made entirely of bacon.","ProfilePhotoUrl":"https://sessionize.com/image?f=82f25ab188adf2c024ba2e6d1d661670,400,400,True,False,4d-8364-4316-9b9a-e16561d87af3.d17409e8-43e8-453d-b516-efece566f872.jpg","TwitterHandle":"reverentgeek","WebsiteUrl":"https://reverentgeek.com"}]}]