[{"SessionId":"0cb4d75e-2183-4733-af35-2a01395b9315","SessionTitle":"Fun with IoT and the Raspberry Pi 3","SessionAbstract":"The idea of playing with a pocket-sized computer, hooking up motors, sensors and LED\u0027s sounds like a perfect afternoon, but if you\u0027re anything like me, there is always something that gets in the way! Kickstart that inner geek with a zero to hero session on getting started with IoT and the powerful Raspberry Pi 3. In this session you will see how easy it is to set up the Pi, the use of a Pi-Top and how to start work on those cool home projects.","RecommendedAudience":"Level 100","PresenterName":"Paul Usher","PresenterEmail":null,"PresenterTwitterAlias":"dxAustralia","PresenterWebsite":"http://www.devexpress.com","PresenterBio":"Paul Usher is a Microsoft Azure MVP and Technical Evangelist for DevExpress. With over 25 years real world experience in software development he has plenty of knowledge and war stories to share.  Paul is also a  published author and WintellectNOW trainer comfortable talking about any platform, development stack or language."},{"SessionId":"13178167-2124-44ce-a07e-c796449652e2","SessionTitle":"How to build (and retain) an amazing team","SessionAbstract":"\"We hire only average people,\" said no company, ever. With so many guns, superstars, ninjas, full-stack thingamies and guru whatsits, why would they? Hiring great people is hard. Retaining them is extremely hard. And yet neither is complicated. There are a few simple things that your company can do to start attracting and retaining top talent.\n\nThis talk is about stories. Stories about people. Stories about situations. Stories about stories and the power they have to influence people, teams and culture.\n\nIsn\u0027t it nice to wake up in the morning and feel happy about the day to come? Let\u0027s talk about how to create that - both for the people we want to hire and for ourselves.","RecommendedAudience":"Anyone in the tech industry. Anyone in any industry, for that matter :)","PresenterName":"Andrew Harcourt","PresenterEmail":null,"PresenterTwitterAlias":"uglybugger","PresenterWebsite":"https://www.uglybugger.org/","PresenterBio":"Andrew Harcourt is a Principal Consultant at ThoughtWorks. He is a solutions architect and software engineer with extensive experience in large-scale, high-load, geographically-distributed systems. He specialises in project rescue, governance and development methodologies.\n\nAndrew\u0027s main areas of interest are domain-driven design, event sourcing, massively-scalable service architectures and cloud computing. Andrew\u0027s mother wrote COBOL on punch cards and he has been coding in one form or another since he was five years old."},{"SessionId":"1403740b-48d9-4674-9eed-e2af035831dc","SessionTitle":"Universal Windows: The Right Way","SessionAbstract":"So you want to start a new Universal Windows app for Windows 10, IoT or maybe even HoloLens but you\u0027re not sure how to do things right. There\u0027s models to wire up, bindings to do, background tasks that don\u0027t let you inherit objects, dependencies on unique platforms to manage... it all very quickly becomes a mess. But it doesn\u0027t have to!\n\nIn this talk I\u0027ll go through the anatomy of a well-designed basic Universal Windows Platform (UWP) application with all the good things we all know and love: Convention based ViewModel Binding, DI, IoC, easy lifecycle management and separation of concerns.","RecommendedAudience":".NET C#, Basic XAML","PresenterName":"Ryan Preece","PresenterEmail":null,"PresenterTwitterAlias":"Preecington","PresenterWebsite":null,"PresenterBio":"Ryan is a Senior Consultant with Readify specialising in UWP/WPF with an eye for User Experience. In his spare time he builds Windows Phone apps (still) hoping that someone will notice the platform. He prefers short walks onto planes as opposed to long walks on beaches."},{"SessionId":"14fe62d5-b37b-4cf3-8a3d-aa1ba116e83e","SessionTitle":"Consumer Driven Contracts - Mean what you say and say what you mean","SessionAbstract":"The API economy is here and it\u0027s fuelling disruption in many established industries. In response to this. many companies are looking to increase their agility through breaking down legacy monoliths into discrete services focused around specific business capabilities. While this approach has many advantages, there are potential pitfalls awaiting the unwary. The number of integration points between these distributed components is greatly increased. Considering such an architecture, a naïve approach could be to simply continue to apply traditional integration testing techniques as this can lead to spiralling cost of ownership through brittle test suites. What can we do to mitigate this risk while still giving us the confidence that the various services will work cohesively?\nIn this session we will explore using consumer driven contacts, specifically Pact, to solve this problem and share some lessons learnt from the trenches through leveraging them as part of our API journey at Bankwest.","RecommendedAudience":"Intermediate. Experience in building RESTful APIs and associated testing techniques would be beneficial but not essential.","PresenterName":"Rob Crowley","PresenterEmail":null,"PresenterTwitterAlias":"robdcrowley","PresenterWebsite":null,"PresenterBio":"Technical Lead for APIs at Bankwest. Passionate about creating APIs that are scalable, robust and deliver a truly world class developer experiences. I am an active member of the Perth IT community and have presented at number of Meetup groups and conferences."},{"SessionId":"174d8338-0201-4711-b1f7-f3a0cca60d29","SessionTitle":"Brendan and Cristian Unplugged","SessionAbstract":"It’s not every day you propose a session that’s deliberately unplanned, but here we are. \n\nCristian and Brendan have spent way too much time talking about random things and trying to solve the world\u0027s problems over beers, so why not do this in front of an audience? No promises that the organisers will let us have beer though… \n\nThose in the audience will have a chance to propose topics they want to hear us talk about (and we will disregard boring topics), and then who knows where things will go? Technical, non-technical, off-topic, whatever - bring whatever’s on your mind and we’ll have some fun.","RecommendedAudience":"Not really","PresenterName":"Brendan Forster and Cristian Prieto","PresenterEmail":null,"PresenterTwitterAlias":null,"PresenterWebsite":null,"PresenterBio":"Brendan Forster\n\nBrendan is a Senior Engineer at GitHub, focusing on all things Git and Windows. He also contributes to a few open source projects, such as ReactiveUI, Reactive Extensions for .NET, libgit2sharp, Octokit.net and up-for-grabs.\n\nCristian Prieto\n\nCristian Prieto has been a software developer for more than 16 years. During that time he has had to wear many hats ranging from developing Linux kernel drivers to developing cross platform and web applications - he doesn\u0027t care, he just loves to develop software.\n\nHe is passionate about software development and internals, how things works, and how can we make it better. He tries to explain complex things in a common everyday language.\n\nHe currently works as Technical Lead at HealthConnex, in Melbourne, Australia where he helps the company to create better software and ship faster. When he is not playing around with programming languages, he loves to learn and code for things he should not be coding right now, like assemblers and retro consoles."},{"SessionId":"24a69d28-172d-4e77-90d3-190e221b7c60","SessionTitle":"Random Failures of Architecture I Have Committed","SessionAbstract":"Everyone loves to talk themselves up in conference presentations, regaling you with tales of their technical brilliance. Sure these talks can be filled with valuable information about the latest technologies, but have you ever stopped to consider how it makes you, the audience, feel? After you\u0027ve spent the weekend hearing about reactively programmed event sourced games running in the cloud isn\u0027t hard to go back to writing CRUD forms using ASP.NET WebForms 3.5 against an Access DB? Don\u0027t you want someone to stand up and tell you all the ways they\u0027ve screwed up so you can feel better about the code that awaits you on Monday? \n\nThis is that talk. \n\nIt\u0027s taken Colin 17 years to learn these things through failures big and small. Now you can learn such classic mistakes as inappropriate layering, leaky abstractions, reimplementing perfectly valid frameworks because reasons, undervaluing the cost of development friction, and so much more. All this (probably, maybe) in just one session the length of which I did not bother to research. Yours to take away so you can laugh smugly at me when you fail to do so in your career*. Vote now but don\u0027t send any money. \n\n*offer void where prohibited","RecommendedAudience":"Beginner to intermediate","PresenterName":"Colin Scott","PresenterEmail":null,"PresenterTwitterAlias":"abstractcode","PresenterWebsite":"https://www.abstractcode.com","PresenterBio":"Having escaped Western Australia through daring, courage and the stunning ability to book flights Colin has recklessly agreed to return in an attempt to bring civilisation to you barbarians. Or at least convince you that cities shouldn\u0027t be shut by 6. He is known for his pathological inability to take biographies seriously and is survived by more computers than it is sensible for one person to own."},{"SessionId":"27557018-3caa-44fd-bd77-d6061d36b04d","SessionTitle":"Building Droids with JavaScript","SessionAbstract":"IOT is a *big deal* with billions being spent in the sector globally and a rapid proliferation of devices being connected to the Internet. Just because you CAN do something doesn\u0027t mean you SHOULD do it as the case of internet connected kettles that leak security details shows. \n\nNodeBots use web technologies - namely JS - to interact with hardware, enabling physical things that can interact with the Internet and the web.\n\nThe aim of this session is to introduce developers to the hardware \u0026 software stack and show what it is capable of and how to work with it. Examples will showcase physical \u0026 software systems working together.\n\nAttendees should go away from the session armed with the information needed to start their own explorations in the hardware space.","RecommendedAudience":"JS familiarity and some understanding of NodeJS","PresenterName":"Andrew Fisher","PresenterEmail":null,"PresenterTwitterAlias":"ajfisher","PresenterWebsite":"https://nodebotsau.io","PresenterBio":"Andrew Fisher is a career web developer who has always had an interest in hardware. Andrew is a core team member of the NodeBots project, creator of Interchange (a package manager for hardware) and primary maintainer of node-pixel. When not working on hardware \u0026 open source projects, Andrew has a normal job too, where he\u0027s the CTO of LUXE City Guides."},{"SessionId":"453f9406-3c72-4009-92bd-4c0afe65e1e2","SessionTitle":"What\u0027s It Like Being a Open Source Maintainer Anyway?","SessionAbstract":"Open Source seems to be the way of the future for most software development, but what does it actually look like day to day for those people who are helping to shepherd projects both big and small.\n\nIn this talk, I will walk through my experiences - the ups and downs - of being involved with a number of open source projects over the previous few years - as a maintainer, advisor and keen observer. I will share what things I\u0027ve seen succeed on projects, what things need to be addressed, and share some thoughts on what the future hold for creating sustainable projects might look like.","RecommendedAudience":"Not really","PresenterName":"Brendan Forster","PresenterEmail":null,"PresenterTwitterAlias":"shiftkey","PresenterWebsite":"http://brendanforster.com","PresenterBio":"Brendan is a Senior Engineer at GitHub, focusing on all things Git and Windows. He also contributes to a few open source projects, such as ReactiveUI, Reactive Extensions for .NET, libgit2sharp, Octokit.net and up-for-grabs."},{"SessionId":"477cabb8-4ca8-4f72-8e64-1cd11f6b2602","SessionTitle":"CQRS and Event Sourcing For The Win!","SessionAbstract":"Command Query Responsibility Segregation (CQRS) is an important architectural pattern for enterprise applications.  It offers a number of important benefits for more complex and collaborative applications. This presentation will give a quick introduction to and overview of CQRS within a Domain Driven Design (DDD) context.  CQRS applications can also benefit from the use of Event Sourcing (ES). This presentation will give an introduction to and overview of CQRS using Event Sourcing.\n\nHowever, the second part of the presentation will be an investigation of whether events are the ultimate and most timeless way to persist application state (without actually persisting application state). The ability to construct and reconstruct data stores on the read-side enables post-hoc optimisations of data representation for queries. The ability to change paradigms on the application write-side means that the data representation is perhaps even more powerful and timeless than relational stores.","RecommendedAudience":"Intermediate level developers","PresenterName":"Ashley Aitken","PresenterEmail":null,"PresenterTwitterAlias":"AshleyAitken","PresenterWebsite":null,"PresenterBio":"Ashley has over twenty years experience as an IT academic, developer, consultant and professional trainer in academia and industry around Australia, across S/E Asia and in the US and UK. He has won awards and been recognised for the quality of his teaching and professional training from industry, academia, the student body, and the Australian Federal Government. He is currently working on a startup using the CQRS architectural pattern with Scala, Akka Persistence, and Greg Young’s Event Store plus various SQL and NOSQL data stores."},{"SessionId":"82988c58-8d9c-4518-a4f7-94cf7739299d","SessionTitle":"The Force Awakens: Mastering Your Inner Developer","SessionAbstract":"It takes effort and discipline to be a great developer, but how do you know what to focus on, what to pursue, what to say no to? And how do you fit it all into an already packed life of family, friends, discovery and ambition?\n\nGetting a grasp on key professional skills, such as time management, learning to say no, building a network and, most importantly, keeping an open mind is no simple task. This talk will provide guidance and share personal experiences on how to build up the life of your creation, rather than the life you have settled for. From managing 3 businesses, being an author and speaker, organising conferences, giving as much back to the community as possible as well as being a father and partner, there are gold nuggets aplenty in this talk. Be inspired to think beyond yourself.","RecommendedAudience":"Everyone","PresenterName":"Lars Klint","PresenterEmail":null,"PresenterTwitterAlias":"larsklint","PresenterWebsite":null,"PresenterBio":"Lars is an author, trainer, Microsoft MVP, community leader, authority on all things Windows Platform and part time crocodile wrangler. He is a published Pluralsight author, freelance solution architect, and has been a part of the software development community for the past 20 years. Lars co-organises the DDD Melbourne community conference, organises developer events with Microsoft, and also runs a part time car restoration business. He has spoken at numerous technical events around the world and is an expert in Australian Outback Internet."},{"SessionId":"852827dd-a467-4c66-b2a6-a60b2dba34cc","SessionTitle":"What makes React different?","SessionAbstract":"There has been a heap of talk about web frameworks recently, React is one which is particularly interesting. Almost weekly we are hearing about large companies who have made the switch and are saying it has helped them delivery their applications quicker with fewer issues.\nThis is because React takes a very different approach to how you build and compose your JavaScript applications. If you do frontend web development this session will show you what React is, how it works and practical tips on where to go once you have mastered the basics.","RecommendedAudience":"Basic JS knowledge needed","PresenterName":"Jake Ginnivan","PresenterEmail":null,"PresenterTwitterAlias":"JakeGinnivan","PresenterWebsite":"http://jake.ginnivan.net","PresenterBio":"Jake is a Microsoft MVP in .NET developing JavaScript and .NET applications day to day with Readify in Perth, Australia. He maintains a number of open source projects such as Shouldly, GitVersion and really should blog more. He recently moved back to Perth after working in London in the financial services space with Adaptive Consulting for two years."},{"SessionId":"8c3f3aaa-02a1-45ed-81f3-91233575c687","SessionTitle":"Low Latency designs from London Finance","SessionAbstract":"Recently returning from London, where I was exposed to a world of low latency high throughput systems, I share my experiences and misconceptions. In this talk we talk discover how to measure latency, how single threaded can be the go-to design for speed and how to make Managed Memory systems (.NET/Java) perform like native systems. We also investigate the things that can be holding you back.\n\nThere will be code!","RecommendedAudience":"Middle to advanced developer.","PresenterName":"Lee Campbell","PresenterEmail":null,"PresenterTwitterAlias":"LeeRyanCampbell","PresenterWebsite":"http://IntroToRx.com","PresenterBio":"Author of the 5star book Introduction to Reactive Extensions (IntroToRx.com), Rx coach, Presenter and freelance .NET Developer."},{"SessionId":"aa9f3fc0-8d47-404d-ba3e-2e5e058a00be","SessionTitle":"Mars, Cars, Stars and VR - developing resilience for a crazy future","SessionAbstract":"If you\u0027re a software engineer in 2016, you\u0027re quite possibly a tiny bit jaded by this year\u0027s new and improved frameworks, 3rd set of must-have developer tools, cool as a cumulus cloud configurator, or magical monitoring software. Couldn\u0027t we just slow all this down for a minute? Half of us are still working at banks on enterprise java apps written in 2002! Nigel Dalton peeks under the covers of the societal and business drivers for what might appear (to a rational person) to be change for change\u0027s sake, followed by madly attempting to predict some key trends, and finally concludes what our #1 focus as humans within the systems of work should probably be.","RecommendedAudience":"Everyone","PresenterName":"Nigel Dalton","PresenterEmail":null,"PresenterTwitterAlias":"nxdnz","PresenterWebsite":"http://rea.tech/","PresenterBio":"Nigel Dalton is Chief Information Officer at the REA Group in Melbourne, and a veteran agile evangelist with over 14 years of experience applying agile principles to IT and product development in the USA, Australia and NZ. Nigel was also the co-founder of Luna Tractor, an Australian business consultancy taking agile, lean and systems thinking beyond software development to all areas of business and organisations. Luna Tractor leveraged the experience gained in the transformation of Lonely Planet between 2007 and 2011, with over 20 teams running variants of agile, kanban and lean methods to support their aim to make amazing guides in all formats for customers. At REA Group Nigel takes a strong interest in the broad application of lean, agile and systems thinking approaches around the workplace. His greatest career regret is having once tried to apply agile techniques to a rock and roll band. The result was not pretty."},{"SessionId":"abedcd4e-b0a3-42df-9d5b-26e5d566b50e","SessionTitle":"An Agile Retrospective","SessionAbstract":"One of the core principles behind Agile software development is being retrospective and fosting a culture of continuous improvement. In this session you will see us do that on a macro scale. As consultants we\u0027ve seen more than our fair share of Agile done right and Agile done poorly as well as everything in between.\n\nBack in 2011, Rob made a prediction on his blog that \"within the next 5 years Agile won’t exist anymore because everyone will be doing it; kind of like what happened to Object Orientation\". Now, on first thought, a talk about Agile in 2016 seems a bit outdated. The problem is, to this day a lot of companies/teams still can\u0027t get it right and we have famous Agile advocates saying things like \"Agile is dead\". So, while Rob\u0027s prediction hasn\u0027t completely held true, it\u0027s still a good time to reflect on it.\n\nThis session will cover a bunch of stuff that we notice all the time across multiple companies that doesn\u0027t hold true against the values and principles of the Agile manifesto, we\u0027ll blow a hole through all of the strawman arguments we hear day in, day out, and we will inject some enthusiasm and experience by describing the techniques we use to stay true to the original values and principles of Agile and helps us consistently deliver great software outcomes.","RecommendedAudience":"Everyone","PresenterName":"Rob Moore and Chris Gilbert","PresenterEmail":null,"PresenterTwitterAlias":"robdmoore","PresenterWebsite":"http://robdmoore.id.au/","PresenterBio":"Rob Moore\n\nRobert is a Principal Consultant with Readify and specialises in leading teams towards the delivery of business value using Agile and Lean values and principles and by adopting DevOps and Continuous Delivery practices.\n\nRobert has a proven track record of successfully delivering software projects with a particular focus on accelerated business value delivery, measurement and realisation and he has also been a proponent for and leader towards positive cultural change and gradual continuous improvement across a number of organisations, teams and projects.\n\nChris Gilbert\n\nAs a SixPivot and ex-Readify consultant, Chris has been leading agile teams to victory for many years in beautiful Brisbane.  \n\nHis code has helped dig holes, check prices, sell pizzas, kill ants, plan infrastructure, save babies, and collect garbage. \n\nHe loves helping people and teams improve their software and their processes. \n\nHe is skilled in many buzzwords (agile, cloud, microservices, etc) and passionate about many acronyms (DDD, TDD, SOLID, YAGNI, etc)."},{"SessionId":"ccbb469f-5406-48dc-8e70-d20a84dd2044","SessionTitle":"RoboCup Junior Australia Rescue Robots","SessionAbstract":"RoboCup Junior is a project-oriented educational initiative that sponsors local, regional and international robotic events for young students. It is designed to introduce RoboCup to primary and secondary school children. The focus in the junior league is on education. RoboCup is an international effort whose purpose is to foster Artificial Intelligence (AI) and robotics research by providing a standard problem where a wide range of technologies can be integrated and examined. Created in a true cooperative spirit, the RoboCup Junior Educational Competition encompasses not only engineering and IT skills, but extends right across a school curriculum. RoboCup Junior also addresses social development by encouraging sportsmanship, sharing, teamwork, understanding of differences between individuals and nations, cooperation and organisational skills.\n\nThe competition is divided into Rescue, Dance and Soccer divisions and the Australian Open National competition will be held in Sydney on 16th to 18th September 2016. For more information see http://robocupjunior.org.au/.","RecommendedAudience":"","PresenterName":"All Saints College students","PresenterEmail":null,"PresenterTwitterAlias":"","PresenterWebsite":"","PresenterBio":"All Saints\u0027 College is a private coeducational Anglican school located in Perth."},{"SessionId":"ec6e7098-4615-4cf3-88b5-fb92ff5a20b4","SessionTitle":"Modern Authentication","SessionAbstract":"Terms like OAuth, OpenIDConnect, claims, tokens, two and three legged authentication, etc. are becoming increasingly common in discussions about software development. Most of us rely on these for authentication to services we use nearly every day! In an era where applications are highly distributed and dependent on other services to perform their function, modern identity approaches are important in allowing us to access protected resources without needing to share passwords around. This talk will help unravel some of these terms, explain modern approaches to authentication and show you how to easily get started setting some of these up yourself.","RecommendedAudience":"Any developer or operations person.","PresenterName":"Matt Davies and Rob Moore","PresenterEmail":null,"PresenterTwitterAlias":"mdaviesnet","PresenterWebsite":"http://mdavies.net","PresenterBio":"Matt Davies\n\nMatt is a Principal Consultant for Readify specialising in Windows Azure and mobile application development. He sets out to introduce targeted Agile software delivery practices and modern technology options with the goal of always leaving teams he works with operating more effectively than when he first met them.\n\nRob Moore\n\nRobert is a Principal Consultant with Readify and specialises in leading teams towards the delivery of business value using Agile and Lean values and principles and by adopting DevOps and Continuous Delivery practices.\n\nRobert has a proven track record of successfully delivering software projects with a particular focus on accelerated business value delivery, measurement and realisation and he has also been a proponent for and leader towards positive cultural change and gradual continuous improvement across a number of organisations, teams and projects."},{"SessionId":"f34f4325-bdba-4798-8f53-7a5d8a3bbf96","SessionTitle":"Building a conversational user interface","SessionAbstract":"Chat tools have become an important part of our daily lives. Whether it’s Messenger, WhatsApp, Slack or Skype we all use some sort of chat tool to communicate with each other on a regular basis. This has paved the way for a new type of application that isn’t a desktop, web or mobile. It’s an program that lives in your chat platform and communicates with you conversationally. In this talk I will demonstrate creating a conversational user interfaced program that lives in Slack and will use Natural Language Processing and Machine Learning to work out what you are asking it to do and act accordingly. I will demonstrate how this can create a low friction interface that can automate mundane or complex tasks and make it feel like you are asking a colleague to help you out. This could change the conceptual relationship we have with programs and open new possibilities in terms of interaction and user experience.","RecommendedAudience":"Any","PresenterName":"Norman Noble","PresenterEmail":null,"PresenterTwitterAlias":"INormanNoble","PresenterWebsite":null,"PresenterBio":"Technical Practices Manager at SEEK"},{"SessionId":"ffc49099-c8d9-4262-9e00-82ea414dc083","SessionTitle":"Banish the boilerplate - using pipelines to go faster","SessionAbstract":"0% boilerplate. 3% Javascript. 100% value. Dream? Impossible? Mad ramblings? \n\nIn this session we\u0027ll have a look at some patterns which allow us to concentrate on the code that we want to write, without getting bogged down by the boring stuff around the edges.  We\u0027ll then enhance them with some testing patterns  now that Rob and Matt have burned down the testing pyramid.\n\nWe\u0027ll introduce pipelines, see how they eliminate boilerplate, and see how they lend themselves to highly composable, rich test suites.\n\nBy the end of this session, every keystroke you write is almost guaranteed to enhance your end products.","RecommendedAudience":"Anyone who thinks things should be easier!","PresenterName":"Graeme Foster","PresenterEmail":null,"PresenterTwitterAlias":"graefoster","PresenterWebsite":null,"PresenterBio":"Graeme’s IT passion was first stirred with a 1Kb ZX81 in 1983 at 8 years old. He’s now had 20 years of commercial experience using .Net, Javascript, Java, and VB, as well as writing Lisp neural networks at Uni and having Objective-C ios apps in the AppStore.\n\nHe was a Spanish Software Developer, but has since moved on and no longer pretends to speak Spanish."}]