[
  {
    "Id": "620775e4-6179-4637-80c4-f59027d3c54b",
    "ExternalId": "261426",
    "Title": "(Un)Anticipated Consequences: Rethinking artificial intelligence and automated systems",
    "Abstract": "From chatbots to electric cars our world is becoming increasingly connected. You can turn your lights on or watch what is happening in private homes from across the globe right from your phone. Elevators make supposedly smart decisions about how best to deliver people to their floors and smart sensors tell us what speed the traffic should flow.\r\n\r\nWe all work on, in, or around technology every day of our lives. Despite our best intentions, we sometimes build systems with the potential for great harm. Visual recognition systems have mistaken a man for a monkey, a chemical plant that nearly levelled a community or a safety system that led to stalking.\r\n\r\nHow is it, the tiny little decisions we make every day can lead to some rather unpleasant outcomes? This talk will explore how our systems are designed, built, maintained, and decommissioned and what can go wrong when we don’t consider where our decisions may lead. It poses some simple questions we can begin to ask ourselves, the companies we work for, and those we buy products from, in order to help us build a safer, fairer, and more equitable world; a world we all want to live in. ",
    "Format": "45 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Design and UX", "Artificial Intelligence", "Machine Learning"],
    "Presenters": [
      {
        "Id": "f1e5fba1-58fc-4bbe-ae2c-fce9bbeb4624",
        "Name": "Felicity Millman",
        "Tagline": "Cyberneticist, technology therapist and data explorer.",
        "Bio": "Felicity began her career as a psychologist. Her PhD spanned psychology and genetics, where she explored what our genetic data can, or can’t, tell us about our behaviour before she transitions into a career in technology. Felicity has worked in a variety of areas, from building chatbots for private companies to helping to improve cybersecurity in international governments. She holds a Masters Degree in Applied Cybernetics and some of her innovations have been personally lauded by Microsoft CEO Satya Nadella. She has a fascination with technology innovation and a passion for creating safer and more equitable technology. ",
        "ProfilePhotoUrl": "https://sessionize.com/image/7448-400o400o2-KtswJSfZsCT65WLQQ4KMAG.jpg",
        "TwitterHandle": "FelicityMillman",
        "WebsiteUrl": "http://www.thecontested.space"
      }
    ]
  },
  {
    "Id": "ca8d113d-38c6-4042-a006-03f2add9ead4",
    "ExternalId": "261365",
    "Title": "Animation - a Whole Lottie Tools out There",
    "Abstract": "Little bits of animation make websites and mobile UI \"pop!\" They can add fun and clarity to your UI's micro-interactions.\r\n \r\nLottie is a popular file format for simple vector animations, that's grown to an entire ecosystem. It can be used in websites that have JS enabled as well as native apps.\r\n\r\n This is NOT a talk about Adobe tools but about the cheaper alternatives that make Lottie more accessible to designers and developers. \r\n\r\nRequired: willingness to dabble\r\nOptional: love of visual puns and silliness\r\nUseful: experience with any drawing app",
    "Format": "20 mins",
    "Level": "No experience necessary",
    "Tags": ["Frontend Development", "UX", "Tooling"],
    "Presenters": [
      {
        "Id": "cce2f4e9-566d-4efc-b522-43120353d517",
        "Name": "Andy Dent",
        "Tagline": "Touchgram founder, giving people creative power to compose interactive messages.",
        "Bio": "Andy is Founder & CEO of Touchgram, a messaging platform for adding more delight into your digital relationships. He's a life-long Chinese martial artist & programmer for the same 40 years. As a technical dev in a mining town, he's worked on international products ranging from CAD to 3D stereo movies. He's often been a (very) remote team member from home in Perth, Western Australia. This includes a fun 2 years for Realm mobile database's Danish Xamarin team. Naturally a toolsmith, inspired by the Montessori motto \"help me to do it for myself\", his first startup was C++ dev tools in the 90's. He's now focused on creativity tools for a wider audience, starting with iMessage & with a broad ambition to help connect scattered families.",
        "ProfilePhotoUrl": "https://sessionize.com/image/8aae-400o400o2-ER5mcBKB1pzaUh5zFVzf1D.jpg",
        "TwitterHandle": "AndyDentPerth",
        "WebsiteUrl": "https://medium.com/@andydentperth"
      }
    ]
  },
  {
    "Id": "798f295f-a38e-49cf-98ad-a3bf4b513b7a",
    "ExternalId": "261414",
    "Title": "ASX Trading vs. Machine Learning – ML Ops by accident",
    "Abstract": "Trading shares is a complex proposition. There is potentially an enormous volume of information to consider, news articles, announcements, economic indicators, world events and even the time of day. How can anyone distil all of that into a successful trade? What if there was a way to “consider” data and determine if it was tradeable, that is, can be used to make profitable share trades? Enter machine learning!\r\n \r\nIn this talk, we will explore how to use machine learning models to decide what shares to trade and when while wading through a daunting array of disparate data types. With this base level of shared understanding established, we will explore techniques of how to run machine learning at scale as well as practical techniques to automate the creation, development, scoring and deployment of machine learning models. Hope to see you there!",
    "Format": "20 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Data & Analytics", "Machine Learning", "Architecture"],
    "Presenters": [
      {
        "Id": "8aa05866-9c9a-4afc-badd-03adcd4ba015",
        "Name": "David Martin",
        "Tagline": "Blue Harvest Digital : My Version of FinTech",
        "Bio": "David Martin is currently the Technical Lead for the Covid-19 response for the WA Health Department. He's been solving problems in the Public Health System for the last 17 years. More recently he has been focused on mixing his financial qualifications with his IT ones, resulting in Machine Learning projects with a FinTech flavour. Who knows, he just might make a few dollars along the way.",
        "ProfilePhotoUrl": "https://sessionize.com/image/8229-400o400o2-7hJc9LXtazSDgeKh9sFMJD.jpg",
        "TwitterHandle": "BluHrvstDigital",
        "WebsiteUrl": "https://www.linkedin.com/in/davidmartinau/"
      }
    ]
  },
  {
    "Id": "3cc93f61-ef21-4a8a-ac91-645c1bca3f16",
    "ExternalId": "261446",
    "Title": "Build-a-[Mal]bear",
    "Abstract": "TDD, dependency injection, DevOps – buzz-words galore! We constantly hear about how these practices improve software maintainability, increase productivity, and reduce time-to-ship. But what if these practices were applied to malicious software development? In this presentation, I walk through my journey building a real-world ransomware payload which was ultimately executed in multiple production networks, as part of a cyber security exercise.",
    "Format": "20 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Backend Development", "Coding", "Security"],
    "Presenters": [
      {
        "Id": "1223ad7c-9608-49f3-8c6a-7d236acc6188",
        "Name": "Emanuel Paduraru",
        "Tagline": "Cyber Security Consultant and Software Developer at Retrospect Labs",
        "Bio": "Emanuel is a Perth-native Cyber Security Consultant and Software Developer at Retrospect Labs. Technology captured his interest from a young age, and he has been learning more and more about how the technology that we interact with every day works, ever since. He has a desire to help uplift the Cyber Security capability of organisations, and enjoys architecting robust and secure software solutions. When not tinkering with technology, he enjoys music, motorsport, discovering new food experiences, and going on road-trips.",
        "ProfilePhotoUrl": "https://sessionize.com/image/7a00-400o400o2-4TtEmUWZ6H8L6xYtCDpxGY.png",
        "TwitterHandle": null,
        "WebsiteUrl": "https://www.linkedin.com/in/emanuel-paduraru/"
      }
    ]
  },
  {
    "Id": "c04dc773-feaa-4c07-8aab-7e7598e58c48",
    "ExternalId": "256294",
    "Title": "Building a 6 million request per second web server",
    "Abstract": "And to be clear this is not a cluster of web servers.  This talk is about a single web server servicing 6 million requests per second.\r\n\r\nI'm the author of a web server that is ranked in the top 20 of the TechEmpower benchmarks.  These benchmarks performance test various web servers built in any technology.  All the web servers are pitted against each other and the results published yearly.  While some might question the value of performance testing, Microsoft supports these benchmarks after having been called out to improve their IIS performance.\r\n\r\nThis talk goes into the engineering of how to service 6 million requests per second.  This is definitely a technical presentation, as we deep dive into performant software on multi-core hardware. If you want warm and fuzzy soft skills, I highly recommend going elsewhere.  This is a hard skill technical presentation that will enable even junior developers to obtain an appreciation for the engineering required for high performance applications.\r\n\r\nWhat you get out of this talk is an appreciation for what high performant software looks like.  It will highlight key bottlenecks you can avoid in your everyday software practices to improve the performance of the systems you build.  It will also debunk much of the thinking about how to write performant software.  I hear so many developers concerned about certain performance aspects of software, missing simple key things that are significantly more important.",
    "Format": "20 mins",
    "Level": "Deeply technical",
    "Tags": ["Backend Development", "Coding", "Architecture"],
    "Presenters": [
      {
        "Id": "3532e487-1bf2-4532-b321-5340a740f674",
        "Name": "Daniel Sagenschneider",
        "Tagline": "Evangelist for \"true\" inversion of control",
        "Bio": "Author of OfficeFloor: using office patterns to improve software design and founder of OfficeFloor (http://officefloor.net).   My focus has been on improving Software via taking patterns from the Business (rather than the typical forcing \"tech\" patterns on the business).  This has led to closing many gaps in some of the most fundamental software patterns.",
        "ProfilePhotoUrl": "https://sessionize.com/image/e771-400o400o2-e8d69ad2-4fb9-4c19-aa06-9acc49a95705.jpg",
        "TwitterHandle": "sagenschneider",
        "WebsiteUrl": "http://sagenschneider.blogspot.com"
      }
    ]
  },
  {
    "Id": "83cc08fb-f422-42b3-bb7b-300e75cd1728",
    "ExternalId": "261169",
    "Title": "Bye bye YAML, painless Kubernetes deployments with CDK8s",
    "Abstract": "AWS CDK has revolutionised the developer experience and significantly improves productivity when deploying AWS resources compared to writing CloudFormation YAML. CDK allows developers to model application infrastructure using familiar programming languages, IDE’s, testing tools, and workflow patterns. I was very relieved to learn the same is possible for Kubernetes using CDK8s and I never need to write another YAML manifest ever again.\r\n\r\nI’ll show how CDK8s can be combined with CDK to spin up an AWS EKS cluster, generate Kubernetes manifests and apply them to the cluster without the headaches of writing any YAML.",
    "Format": "45 mins",
    "Level": "Mostly advanced",
    "Tags": ["Cloud", "Continuous Delivery", "AWS"],
    "Presenters": [
      {
        "Id": "40b76e42-2451-4576-9997-fe24fd95ce24",
        "Name": "Cameron Tranthim-Fryer",
        "Tagline": "DevOps Aficionado, Devoted Dog Dad",
        "Bio": "Cameron is currently working in a DevOps Engineer role at INX Software. Before learning about Software Development Cameron was an Accountant where he quickly outgrew spreadsheets and exposure to business improvement methodologies like LEAN Six Sigma lead to a passion for DevOps.",
        "ProfilePhotoUrl": "https://sessionize.com/image/ff4a-400o400o2-EW3ZmBeSWPcvAkpVbDCRoN.jpeg",
        "TwitterHandle": null,
        "WebsiteUrl": "http://www.linkedin.com/in/cameron-tranthim-fryer"
      }
    ]
  },
  {
    "Id": "270889cf-405a-4422-ac97-c4e9bc1f7d8c",
    "ExternalId": "260914",
    "Title": "Embedding Cybersecurity into your Business Culture",
    "Abstract": "To contend with hackers, you have to think like one. What are the easiest entry points?  \r\n\r\nBeing in the technology-oriented industry, we often get so fascinated by security practices used for developing, testing, and deploying the applications that we forget the most unpredictable cyber-security factor: humans (not machines).  \r\n\r\nAt this talk, you will discover some useful tactics to embed cybersecurity as a part of your business culture. Also, sharing some great examples, and examples of disasters. ",
    "Format": "20 mins",
    "Level": "No experience necessary",
    "Tags": ["Soft Skills", "Security"],
    "Presenters": [
      {
        "Id": "32f4c1f0-b19d-4d2a-bb9b-4825d85ec294",
        "Name": "Vidhu Bhardwaj",
        "Tagline": "ICT Lecturer at South Metropolitan TAFE & Perth Chapter Lead at Australian Women in Security Network",
        "Bio": "Vidhu is a mentor, an educator, and an advocate for women in technology. She is working as an IT Lecturer at South Metropolitan TAFE. She is a certified CISCO Instructor as well as an accredited AWS Educator. She also voluntarily serves AWSN (Australian Women in Security Network) as one of the leads for their Perth Chapter. She loves to empower others to solve problems, self-direct and self-reflect. Her motto is ‘Be passionate, be curious and never stop learning!’. ",
        "ProfilePhotoUrl": "https://sessionize.com/image/1bdb-400o400o2-fxsCzEzDASSJbCZ1MCLEkh.jpg",
        "TwitterHandle": null,
        "WebsiteUrl": "https://www.linkedin.com/in/vidhubhardwaj/"
      }
    ]
  },
  {
    "Id": "cc7b2e63-3eca-4c0a-8205-117e5a53dfc5",
    "ExternalId": "256700",
    "Title": "Embracing the unknown while working backwards, how Amazon product teams innovate",
    "Abstract": "Businesses often want to enlist talent that will come to them with \"genius\" ideas on how to improve their business or generate more revenue for them. Designers, Product Owners, and Develpoers are often asked how to make products \"loveable\" or create new innovative solutions that \"delight\" customers. Trouble is, at the start of a project most builders don't know anything about the customers who they are building the project for.\r\n\r\nThis talk focuses on how to embrace your own lack of end-user industry expertise, adopt an experiment driven to identify the most important customer benefit of any solution and pivot from an assumption to a data driven product definition. This talk will take you through the process that is used by product teams at Amazon and other global enterprise companies to work backwards from the needs of the customer while reinforcing the value of user feedback to stakeholders.",
    "Format": "45 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Design and UX", "UX", "Leadership"],
    "Presenters": [
      {
        "Id": "73558d64-cf65-4031-af3d-220356d62f35",
        "Name": "Eric Starling",
        "Tagline": "Senior Innovation Advisor, Amazon Web Services - Innovation Advisory",
        "Bio": "Eric draws boxes and arrows for a living, when he's not asking pedantic questions, somehow he has made a career out of this spanning 20 years from startups to global enterprises.  When he's not looking at a glowing rectangle he can be found nearby an open bottle of whiskey, usually playing with power tools.  ",
        "ProfilePhotoUrl": "https://sessionize.com/image/383c-400o400o2-QNQXJntJ65nDu5HqVimdkj.jpeg",
        "TwitterHandle": null,
        "WebsiteUrl": null
      }
    ]
  },
  {
    "Id": "774715b2-dd53-48fc-a144-80df9325eea9",
    "ExternalId": "259036",
    "Title": "Everything is a Feature Toggle",
    "Abstract": "High performing teams require the ability to deploy code to production on demand, multiple times a day. Continuous delivery techniques such as trunk-based development have demanded the use of patterns that reduce batch size and deployment risk.\r\n\r\nFeature Toggles have emerged as a powerful pattern for enabling developers to deploy to production on-demand with confidence. Most developers will use the Feature Toggle pattern in some form through their journey - sometimes without being aware of it.\r\n\r\nIn this talk, I propose the question; what exactly is a Feature Toggle? What happens if we apply the definition to all code? Could the definition of a feature toggle be broader than most expect?",
    "Format": "45 mins",
    "Level": "Mostly advanced",
    "Tags": ["Backend Development", "Continuous Delivery", "Architecture"],
    "Presenters": [
      {
        "Id": "c9c7d1cc-3ac9-41b6-93ea-a5a872f5d498",
        "Name": "Macklin Hartley",
        "Tagline": "Distributed Software Systems Engineer",
        "Bio": "I am a Software Developer with over 7 years of experience building highly-scalable distributed systems. I'm passionate for modern design patterns and architectures such as Domain Driven Design, Event Sourcing and CQRS. I am an advocate for creating cultures of ownership, accountability, transparency and trust. I'm a strong believer in the value of Continuous Delivery, and deploying software frequently with a high degree of automation.",
        "ProfilePhotoUrl": "https://sessionize.com/image/ddb3-400o400o2-bf064476-1d38-4734-9ba1-9a6bc65897e3.jpg",
        "TwitterHandle": "macklin_hartley",
        "WebsiteUrl": "http://macklin.me/"
      }
    ]
  },
  {
    "Id": "a1765cb1-a194-470d-8654-213e44afe5ba",
    "ExternalId": "257586",
    "Title": "From start-up founder to Fortune 500 and back again: What I’m doing differently this time",
    "Abstract": "I quit my job at Microsoft to found a start-up in a pandemic. I have the confidence to do this because it’s not my first venture.\r\n\r\nThis talk will explore the lessons I learned from founding my original start-ups, exiting those businesses, working for one of the world’s biggest companies — and then leaving to do it all again.\r\n\r\nThere are some lessons that only experience (read: failure!) can teach us, but there are definitely philosophies and hints that can make life easier for anyone considering starting a business of their own. I’ll be sharing insights into what I wish I knew at every stage of my career and the things I’ll be doing differently as a founder this time around.",
    "Format": "45 mins",
    "Level": "No experience necessary",
    "Tags": ["Soft Skills", "Career", "Startups"],
    "Presenters": [
      {
        "Id": "7e654dc9-89bf-4a01-b4cc-77a3af13c168",
        "Name": "Joshua Boys",
        "Tagline": "CEO & Founder - Arkahna",
        "Bio": "Josh is a pioneer in the Australian cloud industry. For 18 years he’s led businesses of all sizes through digital transformation, most recently leading the Microsoft Azure business through several years of strong growth. He’s got a passion for progressive thinking and an obsession with customer success — with the scorecard and battle scars to prove it. ",
        "ProfilePhotoUrl": "https://sessionize.com/image/54e8-400o400o2-7CE28sSSr3vaA3ZM7G9Z6z.jpg",
        "TwitterHandle": "aneki",
        "WebsiteUrl": "https://www.linkedin.com/in/joshboys/"
      }
    ]
  },
  {
    "Id": "63183d8b-2e1e-4675-9316-5278a63f8ab7",
    "ExternalId": "261349",
    "Title": "Functional Domain Modelling in F# (and C# 9)",
    "Abstract": "Functional programming has a reputation for being better at algorithms and logic than business entities and domain models.\r\n\r\nHowever, F# offers a fantastic set of data modelling capabilities that enable you to model your domain more accurately, reliably and concisely than the standard object-oriented approach.\r\n\r\nIf you can’t use F#, the latest version of C# can employ similar techniques and the talk will show examples in both languages.",
    "Format": "45 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Backend Development", "Coding", "Functional Programming"],
    "Presenters": [
      {
        "Id": "8b48c6c9-2fe4-4ad1-a327-3cff511dc486",
        "Name": "Sam Ritchie",
        "Tagline": "Chief Codesplicer",
        "Bio": "Sam is a mobile & cloud developer who likes writing Swift and F#. He runs the software consulting company codesplice, organises the Perth iOS Developers and Perth Functional Programmers meetup groups, and occasionally speaks at conferences.",
        "ProfilePhotoUrl": "https://sessionize.com/image/ec7f-400o400o2-664c57c7-f53d-4f80-9529-1412dc8cc52d.jpg",
        "TwitterHandle": "FakeSamRitchie",
        "WebsiteUrl": "https://www.linkedin.com/in/sam-ritchie-57824422/"
      }
    ]
  },
  {
    "Id": "1a67c372-f559-4713-8937-9d67646e23f7",
    "ExternalId": "259762",
    "Title": "How to design tutorials your users won't ignore",
    "Abstract": "Do you ever find tutorials annoying and think you're smart enough to figure things out on your own?\r\nThen after skipping the tutorial get frustrated with the website/app/game because you can't figure something out?\r\nHear from a former teacher about how people learn and how to use this knowledge to make effective tutorials. \r\nThis presentation will cover topics like:\r\nRepeating information in different ways\r\nProviding information just in time\r\nAttention span and working memory\r\n\r\nThese tips and tricks from cognitive science can help you design tutorials your users won't ignore. \r\n",
    "Format": "20 mins",
    "Level": "No experience necessary",
    "Tags": ["Design and UX", "Design", "UX"],
    "Presenters": [
      {
        "Id": "9b0ce0a5-b73d-4708-866a-141bd52c1c27",
        "Name": "Megan Pusey",
        "Tagline": "PhD Candidate, Murdoch University",
        "Bio": "Megan is a PhD candidate at Murdoch University researching video games, motivation and resilience. She has a background in education and science communications. Megan is interested in how people learn and interact with technology. In her (very little spare time) she enjoys crafting and playing games. ",
        "ProfilePhotoUrl": "https://sessionize.com/image/3b98-400o400o2-M4awqHw4k1iiN892o47bPi.png",
        "TwitterHandle": "scienceninjagal",
        "WebsiteUrl": "https://www.linkedin.com/in/megan-pusey-05302940/"
      }
    ]
  },
  {
    "Id": "443bd0ee-bef3-4fe7-aa95-8b08782e248e",
    "ExternalId": "256312",
    "Title": "Lets build a CarPlay app",
    "Abstract": "CarPlay is an extension of iOS that enables a car's infotainment system to display and control a range of apps. As using a phone while driving is illegal and dangerous, how can Apple ensure CarPlay apps are safe to use in the complex driving environment?\r\n\r\nIn order to ensure apps provide quick and clear information, Apple enforces various rules and processes when developing CarPlay functionality. During this presentation I will give an overview of how CarPlay works and how to develop an app with simplistic CarPlay functionality.",
    "Format": "20 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Frontend Development", "Coding", "UX"],
    "Presenters": [
      {
        "Id": "928b58f2-fb57-498a-af5f-deabdac45274",
        "Name": "Jason Crowley",
        "Tagline": "Senior Developer at Adapptor",
        "Bio": "Senior Developer at Adapptor",
        "ProfilePhotoUrl": "https://sessionize.com/image/2c74-400o400o2-M6YhEDnZEfHkNHYdk2wqwR.png",
        "TwitterHandle": null,
        "WebsiteUrl": null
      }
    ]
  },
  {
    "Id": "ed54a247-f530-4057-8000-04fd82d08be1",
    "ExternalId": "261306",
    "Title": "Moving the needle on diversity in tech - a candid conversation",
    "Abstract": "We've got a Iot of work to do to increase diversity in tech. There's a number of things we can do as individuals (all genders) and organisations to help move the needle. Join me in a safe place to have candid and raw conversation about the challenges we all face and some practical tips to help you navigate what can sometimes feel like a political landmine!\r\n\r\n",
    "Format": "45 mins",
    "Level": "No experience necessary",
    "Tags": ["Soft Skills", "Leadership", "Teams"],
    "Presenters": [
      {
        "Id": "e5e04ca1-0787-4fed-8b78-65d8335c3b0b",
        "Name": "Donna Edwards",
        "Tagline": "Partner Manager @ Amazon Web Services | CEO @ SHOUTOUT | NFP Committee Member | 40under40 Winner",
        "Bio": "Donna has been enabling technical teams for over twenty years. She is passionate about helping businesses scale, creating great workplace environments where people can thrive. \r\n\r\nDonna works for AWS as the Partner Manager across WA/SA and was previously the State Delivery Manager at Readify, leading a team of 80. She is the CEO of startup SHOUTOUT - a simple recognition platform designed to help companies create a culture of gratitude. \r\n\r\nAn international conference speaker and keynote speaker, Donna is passionate about the community and volunteers for not-for-profit groups; Women in Technology WA, Muses Code JS, Tech Girls Movement and the Beacon Foundation. \r\n\r\nDonna was recognised for her contribution to Professional Services and Community with a 40 under 40 Award in 2019.",
        "ProfilePhotoUrl": "https://sessionize.com/image/6b1b-400o400o2-28-da1d-4681-817c-6cc42bf9484e.8546f53c-2de6-4e18-8c80-d6cbc9ba3e4c.jpg",
        "TwitterHandle": "Don_IsGood",
        "WebsiteUrl": "https://www.linkedin.com/in/edwardsdonna/"
      }
    ]
  },
  {
    "Id": "3560629c-36cd-4dd7-91cf-7d3f00dba047",
    "ExternalId": "261125",
    "Title": "Practical Performance",
    "Abstract": "A rapid 10x growth in our customer base was wonderful for our company but caused stress on our systems and engineers. Mongo is on fire! Redis is on fire! The network is saturated! These are but a few of the scalability problems we encountered.\r\n\r\nTime again, how could we have avoided the pain? Can we embed performance-centric practices in our daily routines?\r\n\r\nPerformance is often a misinterpreted and unloved responsibility of the modern software engineer. Terms like “premature optimisation” can discourage us to consider the performance implications of the software we write. Additionally, many higher-level abstractions and tools we use have a less visible performance cost. I won’t mention time pressure nor agile!\r\n\r\nIn this session, we review performance principles and practices, and how they relate to common (and very real and experienced!) performance issues. I wrap it up by suggesting some simple means to embed performance practices in the daily routine. \r\n\r\nThe hope is to be blissfully unaware that a performance issue has been avoided through good practices!\r\n\r\n",
    "Format": "45 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Backend Development", "Architecture", "Coding"],
    "Presenters": [
      {
        "Id": "c7ec7a5a-5a54-4997-a853-3020ff09fb0c",
        "Name": "Sam Price",
        "Tagline": "Software Architect @ Family Zone",
        "Bio": "I'm an experienced architect, manager, and developer with a passion for developing quality software solutions and teams. I'm particularly interested in high throughput, cost-effective and scalable distributed systems - sometimes it's a challenge to find the intersection!",
        "ProfilePhotoUrl": "https://sessionize.com/image/f489-400o400o2-9mPdsmE2jK8rhNZg2awsxZ.jpeg",
        "TwitterHandle": null,
        "WebsiteUrl": "https://www.linkedin.com/in/muel"
      }
    ]
  },
  {
    "Id": "18c9f6a2-2655-4242-8535-cf61c1605cb9",
    "ExternalId": "259766",
    "Title": "Product Ownership - what is it?",
    "Abstract": "In an world where agile teams keep popping up we hear the term Product Owner, but do we know what it means?\r\n\r\nHave you heard the term product owner? Have you every wondered what it is they own? Do you work with one? Do you want to be one?\r\n\r\nMore often Businesses are getting scrum masters to act as Product Owners or creating agile teams without a true Product Owner. How do we increase the understanding of how effective this role can be in an agile team in making sure we achieve the outcomes that customers love.\r\n\r\nThis talk will help you understand what a product owner is at it’s core and how to navigate the common challenges in both being one and working with one.",
    "Format": "45 mins",
    "Level": "No experience necessary",
    "Tags": ["Soft Skills", "Agile", "UX"],
    "Presenters": [
      {
        "Id": "b7b96a3e-3119-4a35-8058-1bc2ed2dc96a",
        "Name": "Donna Boyd",
        "Tagline": "Product Management Consultant, JourneyOne",
        "Bio": "Donna has worked across multiple roles in agile and product over the past 15 years. She spends her days obsessing over what she doesn’t know and filling the gaps. She doesn’t be claim to be an expert but more on a continuous learner that loves to share her journey with others.",
        "ProfilePhotoUrl": "https://sessionize.com/image/b765-400o400o2-86cd0c72-9869-4f4b-9bf8-e1dfe019c27f.jpg",
        "TwitterHandle": null,
        "WebsiteUrl": null
      },
      {
        "Id": "e5f30671-c897-45ab-b435-41b6d1bc7d92",
        "Name": "Aish Srinivas",
        "Tagline": "Actioner with JourneyOne",
        "Bio": "I'm all about empowering diverse and inclusive teams to be at their best. My involvement within the WA community and my focus on the intersection between business, technology & social impact has led me to be a recipient of the Women in Technology WA Tech [+] 20 Award for 2020, and nominated for the Business News 40 under 40 Award for 2021. ",
        "ProfilePhotoUrl": "https://sessionize.com/image/e6cf-400o400o2-4fTcJpPxh6tWtUz6cpnxFy.jpg",
        "TwitterHandle": null,
        "WebsiteUrl": "Http://LinkedIn.com/in/aishwaryasrinivas/"
      }
    ]
  },
  {
    "Id": "46cde2ca-8b44-4ff5-9b82-ad3c41a2b329",
    "ExternalId": "271165",
    "Title": "Return code < human error >",
    "Abstract": "In a world where ransomware can be bought for a couple of dollars and we stand in the throes of a global pandemic, we now learn that over 70% of us are comfortable with restricting peoples’ freedoms to keep Australia safe.\r\n\r\n“Quite an experience to live in fear, isn't it?” Is it inevitable that we hand over our agency or can understanding human performance help save us from cyber crime?",
    "Format": "30 mins",
    "Level": "No experience necessary",
    "Tags": ["Security", "Security"],
    "Presenters": [
      {
        "Id": "e79a72ce-f2ce-4e1f-83f1-e8afa37fc117",
        "Name": "Hannah McKelvie",
        "Tagline": "DevOps & Code Security Manager",
        "Bio": "Hannah is a multi-award-winning Cyber Optimisation Principal & DevSecOps Manager at Telstra.\r\n\r\nIn 2019 she won the prestigious honour of Australia’s Female Secure Coder of the Year.\r\n\r\nHer background in Cognitive Science gives her a strong understanding of people and technology; enabling her to bridge the gap between IT and Business, facilitating clear communication between the different groups.\r\n\r\nHannah's experience encompasses the software industry spectrum, from solution architecture, development, deployment to front-end users, and now Cyber Security.",
        "ProfilePhotoUrl": "https://sessionize.com/image/0d7f-400o400o2-W4GFSrB864cjEX3YekdQgF.jpg",
        "TwitterHandle": "mckelvie_h",
        "WebsiteUrl": "https://www.linkedin.com/in/hanlmckelvie/"
      }
    ]
  },
  {
    "Id": "cf16b808-ac70-463a-90cc-512b68042962",
    "ExternalId": "261107",
    "Title": "Show Your Work - Using Data Science to Peek inside the Black Box",
    "Abstract": "As machine learning becomes increasingly integral to decisions that affect health, safety, economic wellbeing, and other aspects of people's lives, it's important to be able to understand how models make predictions; and to be able to explain the rationale for machine learning based decisions.\r\n\r\nIn this session you will learn how to:\r\n\r\n* Interpret global and local feature importance.\r\n* Use an explainer to interpret a model.\r\n* Create model explanations in a training experiment.\r\n* Visualize model explanations.",
    "Format": "45 mins",
    "Level": "No experience necessary",
    "Tags": ["Data & Analytics", "Machine Learning", "Artificial Intelligence"],
    "Presenters": [
      {
        "Id": "16dcadd6-e541-4c15-bb01-c181b079bf25",
        "Name": "Michelle @ Microsoft",
        "Tagline": "Surfs waves and webs. Level's up outside the (X)box. Keeps one jump ahead of the game(boy).",
        "Bio": "Tedx Speaker, Tech Girl Superhero, Microsoftie and one of MCV's 30 Most Influential Women in Games. I am a Technology Evangelist who acts as an API between technology and the world. I advocate for STEM, the Games Industry and Developers. I present at around 50 Conferences and Events around the world on Technology, Social Media, Inclusion and Gaming.",
        "ProfilePhotoUrl": "https://sessionize.com/image/115a-400o400o2-65-6d4a-402e-afe6-03af233c30eb.3eb9b265-dec2-42ed-8af7-612eaa5d2e1c.jpg",
        "TwitterHandle": "msandfor",
        "WebsiteUrl": "https://www.linkedin.com/in/michellesandford/detail/recent-activity/posts/"
      },
      {
        "Id": "8d0f40fe-45e8-4afd-ac5f-c87207f1fb67",
        "Name": "Jiaranai Keatnuxsuo",
        "Tagline": "I believe every day is a school day",
        "Bio": "Jia is a thriving Triathletes, Tech Optimiser, a STEM Advocate, a TEDx Speaker, a multi-awards winner of Women in Technology Western Australia 2019, NASA Space App Challenge, Energy Hack, Transport Hack WA and UWA Innovation Challenge. Her superpower is learning new technology and smashing Microsoft certificates. In the world of fast changes, she strives to be 1 per cent better technically every day by cultivating her abilities through persistence and effort.",
        "ProfilePhotoUrl": "https://sessionize.com/image/125a-400o400o2-wtLRuQXzE3mS5fVdQZbT4z.jpg",
        "TwitterHandle": "jkeatnuxsuo",
        "WebsiteUrl": "https://www.linkedin.com/in/keatnuxsuo/"
      }
    ]
  },
  {
    "Id": "0a75760c-a5f0-4ce2-b942-e3cff923182e",
    "ExternalId": "261431",
    "Title": "Stop writing tests",
    "Abstract": "Writing tests is one of the best ways to build confidence in releasing our software. It's so useful that many people advocate for test-driven development (TDD) where you write the tests before writing any code. So why would I suggest not writing tests at all?\r\n\r\nThe tests we write now aren't good enough -- we miss things or make mistakes, so for the same reason we've automated so many other processes, it's better to let a computer do it. In this talk we will go over some ways to use formal methods like finite state machines that allow tests to be generated, rather than hand-written and how that will save you time and result in better tests and more confidence in your releases.",
    "Format": "20 mins",
    "Level": "No experience necessary",
    "Tags": ["Frontend Development", "Testing", "Tooling"],
    "Presenters": [
      {
        "Id": "cf7fabaf-75fa-471d-971c-624a9523b180",
        "Name": "Ben Lowry",
        "Tagline": "Lead Consultant at Telstra Purple",
        "Bio": "Ben is a consultant at Telstra Purple, where he helps teams solve their business problems. He is interested in all aspects of web development, and how we can learn from other industries to build better software. He has presented on various topics, from TypeScript to reactive programming to web authentication.",
        "ProfilePhotoUrl": "https://sessionize.com/image/f301-400o400o2-42-e77c-413a-9e7f-f085c03ad9dd.8e334bab-5878-4fe1-a526-979202ae16d1.jpg",
        "TwitterHandle": "bplowry",
        "WebsiteUrl": "https://www.linkedin.com/in/bplowry/"
      }
    ]
  },
  {
    "Id": "dec643ab-4886-4ac5-8f2c-452f945174ae",
    "ExternalId": "261106",
    "Title": "Stringly-Typed to Strongly-Typed with TypeScript",
    "Abstract": "Stringly-typed code. It lurks inside quotation marks in source code, opaque to most to IDE tools, waiting for the unwary developer to rename or refactor something in their codebase. Everything builds and the app is deployed, only to throw runtime errors about references to non-existing HTTP endpoints, CSS classes, database tables, or asset files.\r\n\r\nIn this talk, we'll look at the dangers of stringly-typed code. We'll see how it saps confidence in code changes, making codebases brittle. We'll look for solutions to these issues, using TypeScript to turn opaque strings into well-checked values that can be refactored with confidence.",
    "Format": "45 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Backend Development", "Programming Languages", "Architecture"],
    "Presenters": [
      {
        "Id": "e014eceb-5513-4966-869f-27b8ed6e6a4e",
        "Name": "Troy Gerwien",
        "Tagline": "Senior Software Engineer at VGW",
        "Bio": "Troy is a software engineer with broad industry experience, currently developing games at VGW. He also maintains and contributes to several open-source projects, and is a mentor at CoderDojo. Troy is interested in what makes software great, not just for the user, but also for the team maintaining it.\r\n",
        "ProfilePhotoUrl": "https://sessionize.com/image/f496-400o400o2-HNGZWPvVJi25m2MFTJ27PF.jpg",
        "TwitterHandle": null,
        "WebsiteUrl": "https://au.linkedin.com/in/troygerwien"
      }
    ]
  },
  {
    "Id": "97b4e034-985f-4cc7-bbe2-a1cb22d611a9",
    "ExternalId": "261410",
    "Title": "The Billion Event Challenge",
    "Abstract": "Event sourcing is popular for many reasons, but it’s easy to rack up databases of millions, hundreds of millions, sometimes billions of events. Turning these events into useful read models requires lots of processing, but what if we can’t afford to wait a day?\r\n\r\nLet’s go on a journey into building high performance read models from the simple to the downright silly. Let’s see how fast we can process 1 billion events.",
    "Format": "45 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Backend Development", "Architecture", "Cloud"],
    "Presenters": [
      {
        "Id": "9025b6d7-0806-4190-a23a-6de213440e8a",
        "Name": "Chris Bellew",
        "Tagline": "Squad Lead - Payments @ VGW",
        "Bio": "Chris Bellew is a developer and technical speaker from Perth. He's worked in tech companies of all sizes and has experience in web development and machine learning.",
        "ProfilePhotoUrl": "https://sessionize.com/image/f95c-400o400o2-aVhKoo9Gfq2SfiN1mLmhXk.jpg",
        "TwitterHandle": "chrisjbellew",
        "WebsiteUrl": "https://chrisbellew.me/"
      }
    ]
  },
  {
    "Id": "c06c0dd2-224e-4137-abbd-6fe25177a7b0",
    "ExternalId": "260665",
    "Title": "The Computer Science Behind Colour",
    "Abstract": "We all use colours. Maybe you are a seasoned front end developer or designer, your custom terminal colour scheme is something to behold, or perhaps your small child (or you) is currently going through a finger painting stage. Regardless of what part of tech you work in, you have encountered a situation when you've had to select some colours. The question is, when you pick a colour on a colour wheel or type in a hex or RGB code, how does that colour actually appear on the screen?\r\n\r\nCome and learn about the Computer Science of colour with me. In this talk, we're going to dig deeper into hex codes. What do they mean, how and why do they get converted to RGB codes, and how does a computer use that to generate a colour we can see? We'll unpack it all by learning binary, enjoying a #throwback to mixing paint in kindergarten, and taking a much closer look at the human eye.\r\n\r\nYou will leave this talk with a whole new appreciation and understanding for the science behind something as simple as colour, something you have likely never thought twice about. This talk is not just for designers and front end developers, there is something interesting for everyone to learn here.",
    "Format": "45 mins",
    "Level": "No experience necessary",
    "Tags": ["Frontend Development", "UX"],
    "Presenters": [
      {
        "Id": "4d6fdaed-3e74-413c-bcaa-6409a0b85f57",
        "Name": "Hayley van Waas",
        "Tagline": "Kiwi, Developer, Educator",
        "Bio": "I am a developer and educator, and have been teaching others to code for as long as I have been coding myself. I am a firm believer that anyone can learn to code, and prove it by dedicating a lot of my working and personal life to helping to improve the diversity in the tech industry.\r\n\r\nI have extensive experience in writing resources and teaching workshops about Computer Science and Programming for all ages and experience levels. My ability to describe technical details in a simple manner certainly sets me apart from others in my field and makes me an asset to any team.\r\n\r\nIn my spare time I can be found teaching my dog tricks, watching Netflix and yelling at \"smart\" home devices.",
        "ProfilePhotoUrl": "https://sessionize.com/image/ef13-400o400o2-s466LikuJXe5rWhDyG1h89.jpg",
        "TwitterHandle": "hayley_codes",
        "WebsiteUrl": "https://hayley.codes/"
      }
    ]
  },
  {
    "Id": "616cf974-4922-4fe4-8b2a-23bff247f4ce",
    "ExternalId": "261412",
    "Title": "Unleash Your Inner CTO!",
    "Abstract": "The role of a technology leader has never been more challenging. We are in the midst of unprecedented technological change and yet keeping abreast of such advances alone will not guarantee success. Faced with such myriad options how can we be sure that we are guiding our organisation on the path towards future success?\r\n\r\nIn this talk, we will take an in-depth look at what it takes to create an adaptive technology strategy including metrics, team topologies and evolutionary architecture practices.  We'll explore how to build feedback loops into your organisation’s technology decisions and ensure that its architecture is an accelerator rather than an inhibitor of business agility:\r\n\r\n* How to identify and measure key business-aligned metrics and use these data points to pivot your technology strategy.\r\n* How to enable effective distributed technology decisions across your organisation\r\n* How to build organisational memory surrounding technology decisions that can act as inputs into new decisions.\r\n\r\nBy the end of the session, you will not only understand what is involved in creating a data-informed technology strategy but also have the knowledge to put it into practice. If you want to take to your expertise in crafting effective technology strategies to the next level, then this is the session for you. See you there!",
    "Format": "45 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Soft Skills", "Leadership", "Architecture"],
    "Presenters": [
      {
        "Id": "bd815a69-c2f2-4b03-81f5-e722b098a073",
        "Name": "Rob Crowley",
        "Tagline": "Head of Engineering @ Vix Technology",
        "Bio": "Rob is a software consultant, developer and technical leader with a passion for delivering systems that perform at scale. Rob has over 15 years of experience building distributed systems on the web stack and has read more RFCs than he cares to admit. Rob is an active member of the Perth IT community and regularly shares his ideas at various Meetups and conferences around Australia and internationally. He is also a co-organiser of DDD Perth, the largest IT conference in Western Australia.",
        "ProfilePhotoUrl": "https://sessionize.com/image/786e-400o400o2-57-1142-4eb0-9b08-719c3d875bf8.b26f935d-593e-4798-a41b-d1453e1e0b85.png",
        "TwitterHandle": "robdcrowley",
        "WebsiteUrl": "https://www.linkedin.com/in/robdcrowley/"
      }
    ]
  },
  {
    "Id": "ea671390-b7db-4b36-80c9-07b28973142f",
    "ExternalId": "261278",
    "Title": "What can Indigenous thinking teach us about building sophisticated ethical technology?",
    "Abstract": "Technology moves rapidly. We've learned to move fast and break things, but this method of production often has unintended consequences; machines causing algorithmic harm towards already marginalised groups, a digital economy built to extract data and incrementally influence human behaviour with dubious consent, cryptocurrency contributing harmful emissions and cooking the planet at the same rate as a small country.\r\n\r\nWorking in the tech industry is a privilege and I want to use that good fortune to contribute to a future that is designed to enhance the wellbeing of as many people as possible - not extract and exploit. The sophistication of Indigenous thinking can not only help us build more robust ethical frameworks, but also help unlock the next frontier of technological development.\r\n\r\nIn Australia, we have the privilege of living amongst the world's oldest continuing culture. A culture that has transferred information between generations for 10s of 1000s of years with incredible fidelity does not happen by accident; it involves knowledge of living harmoniously with complex adaptive systems that Western science is slowly catching up to. \r\n\r\nWhat kind of protocols can we learn from Indigenous ways of thinking that can help us build better ethical practices for building technology? How can we optimise for wellbeing and abundance, rather than the kind of limitless growth that is at odds with a healthy planet? \r\n",
    "Format": "45 mins",
    "Level": "No experience necessary",
    "Tags": ["Soft Skills", "Leadership", "Artificial Intelligence"],
    "Presenters": [
      {
        "Id": "1dc6fcf6-1b55-413a-8fbd-ae86f9c11abf",
        "Name": "Kathryn Gledhill-Tucker",
        "Tagline": "First Nations Delivery Centre Lead @ ThoughtWorks",
        "Bio": "Kathryn is a technologist and digital rights activist currently serving on the board of Electronic Frontiers Australia, and campaigns for human rights across movements. She is passionate about using Indigenous thinking - caring for Country and caring for Kin - to shape and foster an ethical future for technology.\r\n\r\nKathryn is currently leading a new initiative at ThoughtWorks creating careers for Aboriginal and Torres Strait Islander technologists. ",
        "ProfilePhotoUrl": "https://sessionize.com/image/2fd4-400o400o2-pyqDJdmx5VoTty4QVkdCBx.jpg",
        "TwitterHandle": "chipswoon",
        "WebsiteUrl": "https://kgt.dev/"
      }
    ]
  },
  {
    "Id": "0b404590-9503-42ac-9e66-bf49adc4496f",
    "ExternalId": "270646",
    "Title": "Your Unique Journey",
    "Abstract": "We spend a significant portion of our lifespans focussing on our careers; a journey that is uniquely yours – your full self, and your experiences. We will reflect on things in your career that have shaped you as a person, and help you to appreciate all the things you may not have realised that you brought to the table.",
    "Format": "30 mins",
    "Level": "No experience necessary",
    "Tags": ["Soft Skills", "Career"],
    "Presenters": [
      {
        "Id": "542e75ab-3008-4ebf-8015-d5a75038b87c",
        "Name": "Camille Woodthorpe",
        "Tagline": "Technologist",
        "Bio": "Camille is a technologist, software generalist, and proud geek, with 11 years of experience using emerging technologies to develop 3D simulations, digital twins, immersive training, VR/AR, gaming, robotics manufacturing, and automation. She has lead multiple software teams and is a champion of good team culture.\r\n\r\nAs an avid futurist she is fascinated by emerging technologies such as VR/AR, robotics, and machine learning. She believes there is tremendous potential in these technologies and the benefits that they can impart on Earth and beyond.\r\n\r\nShe loves to encourage interest in STEM especially for the upcoming generations, and has been a regular STEM mentor for The Innovator’s Tea Party. She has also presented for the Australian Computer Society, SAE College, Female Coders Collective, CoderDojo WA, and The Design Kids, and was a founding committee member of Immerse Australia.",
        "ProfilePhotoUrl": "https://sessionize.com/image/bb7d-400o400o2-BcvP8Myf82kdGr1Q8yb8AY.jpg",
        "TwitterHandle": "astro_camille",
        "WebsiteUrl": null
      }
    ]
  },
  {
    "Id": "b555388f-5f27-42cb-9a01-266bfcc69464",
    "ExternalId": "256985",
    "Title": "Yuck… Difficult Conversations & Feedback",
    "Abstract": "Have you ever avoided a conversation because it was too difficult only for it to blow up in your face later down the track? I know I certainly have… Unfortunately, every difficult conversation that is avoided is a missed opportunity. If we equip ourselves with the knowledge and confidence to respectfully handle these conversations, we can really enable growth and opportunities to those involved.  \r\n\r\nWe humans are complex creatures; this presentation covers our delightful complexities and how they contribute to the difficulty of conversations, coupled with a framework and tips that will help you feel more confident and empowered to have them.  \r\n\r\nLet’s make these conversations less terrifying and frame them in a positive light that ensures you maintain strong relationships whilst enabling growth. ",
    "Format": "45 mins",
    "Level": "Mostly intermediate",
    "Tags": ["Soft Skills", "Leadership", "Career"],
    "Presenters": [
      {
        "Id": "ea325f30-782a-4d15-ae6b-e7d6ebc84808",
        "Name": "Siobhan Avenell",
        "Tagline": "People & Culture Specialist ",
        "Bio": "Siobhan has over a decade of experience in the tech industry focussing on innovative People & Culture led initiatives. With a Masters of Human Resource Management and several years specialising in People & Culture, she enjoys creating workplaces that focus on an outstanding employee experience. \r\n\r\nShe is incredibly passionate about creating environments that focus on diversity and inclusion, flexible and innovative work arrangements, and most importantly, a place where people can bring their true selves. ",
        "ProfilePhotoUrl": "https://sessionize.com/image/186d-400o400o2-Nwj6PwhVXny6N7HSaSt6dv.PNG",
        "TwitterHandle": "SiobhanAvenell",
        "WebsiteUrl": "https://www.linkedin.com/in/siobhan-avenell-people-and-culture-specialist/"
      }
    ]
  }
]
